[
    "VH1 India broadcasts Shaboozey's \"A Bar Song\" in a state which scrubs every mention of Jack Daniel's from the song.\n\nOnly, they don't do so by dipping the vocals, retaining the instrumental. Nor do they even go the lazy route and reverse the audio (as such channels as the now-defunct 4Music would be prone to doing).\n\n  \nTHEY TAKE THE EVEN LAZIER ROUTE AND MUTE THE WHOLE DAMN THING.\n\n  \nLeaving. Nothing. But. Dead. Air.\n\n  \nAnd I find it absolutely, gut-bustingly hilarious.",
    "Yes",
    "There'd be no reason to watch the award shows if the winner was the artist with the most plays in x category.",
    "the grammys have always and will always be an industry networking event that aligns around celebrating artists who have been successful that year. you might find a curveball winner every now and again (arcade fire with the suburbs, for example), but it’s predominantly an industry event to mingle and pat each other on the back.",
    "I agree with you completely.  With that said, I was stunned that Sierra Ferrell won 4 Grammys--because she was the artist who most captured my attention in 2024.  But I feel that in the ignored categories (like Bluegrass and alternative country), the nominations tend to be more based on merit because, frankly, most people have never heard of the artists in those categories.",
    "You think the Grammys are about artistic merit? lmao",
    "Alright I'll play. \n\nDefine \"artistic merit\" for me.",
    "I mean, I’m sure the recording academy has that defined. It’s why their members are composed of artists and members in the industry. If what they wanted was award the numbers they would all be streaming and radio executives .",
    "What makes a particular song or album good? I'm sure you like some songs that I don't like and vice versa, so clearly two people can have different ideas of good music. Art is subjective, there is no scientific measure of \"good.\" The very concept of \"quality\" is a matter of endless philosophical discussion. What *is* quality? \n\nI don't have a problem with artistic awards, but I think it quickly becomes a problem if people take it too seriously. I don't think it's possible to define something like art with rational language, which makes the whole thing kinda silly. I'm not saying we shouldn't do it, but I think the harder we look at it, the less sense it makes.",
    "Can you explain why? The songs are completely different",
    "Doechii deserves it all",
    "My heart wants Chappell but my heart also wants RAYE --- they both had to claw their way into getting a debut album out!",
    "Raye, period. Next question",
    "Teddy Swims!",
    "Raye or Doechii",
    "Yes yes yes",
    "She deserves it so much😭😭😭that album is amazing",
    "Shaboozey? His most popular song is a cover.",
    "YESSS!!!!!!!!!",
    "6th ",
    "“Ohh people actually value authenticity in song writing and performance rather than forced diversity” i can think 3 black artists who deserve the world. Just because its not black dominated doesn’t mean that going against them = racism. But i cant really expect anyone on reddit to get that or even understand."
]