[
    "Welcome to r/popculturechat! ☺️\n\nAs a proud BIPOC, LGBTQ+ & woman-dominated space, this sub is for [civil discussion only.](https://www.reddit.com/r/popculturechat/wiki/index/rules/civil-discussion-only/) If you don't know where to begin, start by participating in [our Sip & Spill Daily Discussion Threads!](https://www.reddit.com/r/popculturechat/search/?q=Sip%20%26%20Spill%20Discussion&restrict_sr=1&sr_nsfw=&include_over_18=1&sort=new)\n\n###No bullies, no bigotry. &#9994;&#127999;&#9994;&#127998;&#9994;&#127997;&#9994;&#127996;&#9994;&#127995;&#127987;&#65039;&#8205;&#127752;&#127987;&#65039;&#8205;&#9895;&#65039;\n\nPlease [read & respect our rules](https://www.reddit.com/r/popculturechat/wiki/index/rules/), [abide by Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette), and [check out our wiki](https://www.reddit.com/r/popculturechat/wiki/index/)! For any questions, [our modmail](https://www.reddit.com/message/compose?to=%2Fr%2Fpopculturechat) is always open.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/popculturechat) if you have any questions or concerns.*",
    "Yes, this was also my introduction to double sided fashion tape.",
    "![gif](giphy|co5Iboa0dZrR7OXivh)",
    "Yeah this dress has a very important role in fashion history....but tbh any post of her, here, is going to be met with....almost blind and venomous hate. 🤷🏽‍♀️",
    "https://preview.redd.it/6f53ml98iske1.jpeg?width=1170&format=pjpg&auto=webp&s=4cf6a102038fa0b65021ad6f692efd8cb55e0af5\n\nI’ll always see it this way.",
    "https://preview.redd.it/8w3krbldzwke1.png?width=1024&format=png&auto=webp&s=a50040aff7c02c7eaeca52fb9665407cda9c5c9e\n\nA Chilean celebrity just wore it to a festival red carpet because it is iconic. Honestly I don't think it causes as much awe to wear it now, for me at least. Yeah it's THE dress but the moment is gone.",
    "This is a perfect example of Motivating Operations.",
    "Before that dress, I was just merely a boy",
    "It was iconic. It was a defining fashion and pop culture moment. \n\nBut I’m not going to lie and wonder what else that dress may have seen that night now that we know what we know.",
    "Who was that quote actually said about?",
    "I'm telling my kids this is Elphaba and Galinda",
    "Welcome to r/popculturechat! ☺️\n\nAs a proud BIPOC, LGBTQ+ & woman-dominated space, this sub is for [civil discussion only.](https://www.reddit.com/r/popculturechat/wiki/index/rules/civil-discussion-only/) If you don't know where to begin, start by participating in [our Sip & Spill Daily Discussion Threads!](https://www.reddit.com/r/popculturechat/search/?q=Sip%20%26%20Spill%20Discussion&restrict_sr=1&sr_nsfw=&include_over_18=1&sort=new)\n\n###No bullies, no bigotry. &#9994;&#127999;&#9994;&#127998;&#9994;&#127997;&#9994;&#127996;&#9994;&#127995;&#127987;&#65039;&#8205;&#127752;&#127987;&#65039;&#8205;&#9895;&#65039;\n\nPlease [read & respect our rules](https://www.reddit.com/r/popculturechat/wiki/index/rules/), [abide by Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette), and [check out our wiki](https://www.reddit.com/r/popculturechat/wiki/index/)! For any questions, [our modmail](https://www.reddit.com/message/compose?to=%2Fr%2Fpopculturechat) is always open.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/popculturechat) if you have any questions or concerns.*",
    "if anything i thought her using her DJ to fill in the lines she was out of breath for was such a smart move, it made the whole performance more cohesive and also more obvious that it was live? like, they were both on stage with mics lol",
    "Anyone who’s seen her Tiny Desk concert would never think that for a second. She’s talented as *hell* man. There are hoards of untalented pop stars riding mommy and daddy’s money train who can barely call themselves artists, but these dorks are all WeLL aCkShuALLy LoOk aT hEr MoUtH\n\n![gif](giphy|kZD8cN1MycfKw)",
    "I love Doechii so much",
    "It’s so obvious she’s singling live like what 😭😭 I love her",
    "People are just making excuses to hate now because anyone with eyes could see it was live?",
    "Doing that in good health already seems like a challenge but doing it sick??? Holy. I can’t wait to see what’s next for her.",
    "To watch that performance and have any kind of critiques is wild \n\nIt was amazing",
    "LOL people are so dumb. She literally has the DJ she’s talking about in the act and they go back and forth. I mean tbh no matter what some people will always think someone’s lip synching.",
    "She ate this performance, and hoes are mad. Everyone intelligent knew she wasn’t lip syncing. LMFAOO",
    "They’re just hating because the DJ, Miss Milan, is present and CLEAR in the performance for “Denial” on the moving floor and they’re CLEARLY going back and forth. They’re just mad whoever they wanted didn’t win. I mean…someone said Beyoncé is lazy because they’re a crazy Billie Stan, mad Billie didn’t win AOTY. You can say many things about Beyoncé…lazy?! That’s just a lie and hater nonsense. I hate how being a psycho stan is normalized and you can just say whatever you want",
    "She is a gorgeous specimen of a human in every way.",
    "it wasn’t hard to realize that the performance was live",
    "Doechii being all...I got bronchitis...\n\n![gif](giphy|Her8HwkH9Fa3S)",
    "Ugh. I just love her so much. Go OFF Doechii",
    "I remember watching her perform “Wat U Sed” with Isaiah Rashad at the 2021 BET awards and being absolutely blown away by how perfect and clean her vocals were (WHILE doing choreo of course). Just incredible breath control. And she’s only gotten better! People really are stupid. If you know nothing about live vocal performances you should just shut up and enjoy the artistry lol",
    "I love her she’s so hot, and I mean that in personality first and foremost, just so happens she’s also physically stunning",
    "I’m glad she stands up for herself on this. Many times artists let these comments slide. I would be pissed too if someone said I didn’t do my performance live especially if I was sick!",
    "I don't blame her for being aggravated, but I hope she doesn't burn herself out on social media a la Chappell. I don't think it's coincidence that the celebs who seem well-adjusted are the ones who stay offline.",
    "I need people to learn the difference between a backing track and lipsyncing",
    "Why are artists always sick for important taped performances?",
    "You could hear her pant throughout the song and there were different voice inflections throughout. A lip synced performance would be too clean and missing the rawness. Lots of people use vocal fills or tracks to make the songs sound fuller. It’s clear people don’t understand how it works. Her performance was electric.",
    "It's so easy for people to sit on their couches and pick apart a performance! These trolls have zero understanding how much work and preparation goes into something like this. I am glad Doechii responded even though she shouldn't have to prove herself whatsoever. She is an unbelievable performer and artist.",
    "I hate that she even felt the need to respond to such obvious nonsense.",
    "it was painfully obvious to me it was live, the girl needs to breathe!!!!",
    "People said the same thing about Benson Boone's performance which was also obviously live 🤦🏼‍♀️",
    "![gif](giphy|2oUfvvUgQHnLsQWFMW)\n\nMY GIRLLL",
    "So stupid. The public finds someone famous and good and just says \"let's fuck with her\"",
    "I’m in love with her 🥰",
    "People be complaining about anything these days. Not worth responding to everything",
    "She’s talented for sure but going to an event to spread the flu is definitely a choice",
    "i love her with all my heart lol",
    "I refuse to let people come for my girl like that. No, she actually can sing live. Sorry folk for this who don’t know what talent is.",
    "Do people really not know that a lot of artists do that",
    "ridiculous criticism in the first place esp when a lot of SINGERS, not even rappers, use backing tracks to help with vocals. it was so clear with her breathing and placement she was rapping live.\n\nalso her skin is god damn flawless.",
    "Responding to everyone on social media is what sends these stars into an emotional tailspin. Why is it so difficult to ignore?",
    "Dummies",
    "Doechii!!! Don't question this badass.",
    "Yeah tell them, she killed her performance",
    "I know it's not the point but she's so stunning. Like ugh imagine being that smart, funny, articulate and just beautiful",
    "I expect a fire song out of this, Doechii.",
    "Lmao I love her. It's so obvious she was singing live because you could even hear her breathing at times. She did amazing and some people really need to being overly negative about promising performers.",
    "As someone with chronic bronchitis, I struggle with even getting a sentence out while talking on the phone or in person when I’m sick, let alone performing and dancing on the Grammys! My respect for her just went up 100 fold with this! WOW! (And I’ve already become a fan from her performance at the Grammys and being an out queer woman).",
    "Also, how is she not blue checked on TikTok yet?! wtf?!",
    "People are truly dumb I agree \nIt’s actually so fucking tiring seeing people who don’t know shit act like they know how live performances work",
    "Literally HOW with bronchitis! I have it now and there’s a coughing fit every ten mins. I need to know her magic! She’s amazing.",
    "Seriously, do people not understand live performances? Even when it's not someone else you can't see on stage signing the live parts, you should be able to tell when they're singing and when it's just recorded audio. It's not like they're trying to fool the audience.",
    "They can never make me hate Doechii.",
    "I love her 🫶🏽🤷🏽‍♀️🤣",
    "I hope she’s okay, that looks like a hospital room setting",
    "It was SO obviously live!!! This isn’t speaking to the use of performance tracks, this is about her, and that was SO live. Her DJ filled in a very smart way, and she’s talking over her own track! She isn’t trying to hide those dubs. She’s performing.",
    "Seriously if you didn’t notice her DJ (Milan, a talent in her own right), that was a you problem lol, she was pretty prominently featured in the performance right up in the front next to Doechii",
    "That's what I thought too. Also I don't want to hear sick voice on stage. It's enough she was even there.",
    "Good point!  That Tiny Desk concert was an amazing showcase of her artistry and how seamlessly her band and dj support each song. ",
    "Pop stars mind you while Doechii is up there rapping her face off and doing serious choreography and acrobatics. That level of breath control is hard to fathom.",
    "the simping is crazy",
    "So excited for someone new and so mother fucking talented",
    "People give too much credit to online comments. Like it’s probably a twelve year old boy.",
    "And ears",
    "Good lord if anybody out there considers Beyonce lazy, I dread to think what they’d consider me lmao. Wild how ppl’s music taste literally distorts reality 💀",
    "Doechii has been rising up in the scene for a bit longer. Her song Yucky Blucky Fruitcake was a pandemic hit and she got her first platinum song 2 years ago. I think her recent album is a reflection on the burn out stage",
    "Long days, hard work, little sleep, high stress levels and constantly going around and being in the vicinity of a lot of other people who may carry whatever kind of bugs. Not sure but a performance like that takes a ton of prep, I’m sure the whole proces is exhausting and not that great for your health.",
    "Right?? I wish working while sick wasn’t normal. The flu is really bad this year",
    "She's so incredible people literally can't believe it. I love her so much--she's so unique and so cool, she's resetting the bounds of what's possible. Her blackness and her intentional performance of it is so beautiful. Same goes for her femininity and her sheer brilliance.\n\nJfc what a badass. Low key crush.",
    "I was in awe when I saw it! Doechii gives me chills. I’ve seen her tiny desk so many times now. So good.",
    "and she did it all with bronchitis!!!! I am all aboard the Doechii train, she’s a phenomenal talent and the girls who get it, get it",
    "That you Azalea Banks?",
    "I’m not even really a fan of Beyoncé and I would fight someone if they said she was lazy. lol",
    "Not to mention being in enclosed spaces with lots of crew/ staff, the press run, etc. stress and exposure to people and germs you usually are t exposed to.",
    "I understand her working while sick in this case lol. It’s the Grammys.",
    "I agree with everything you said 100%. And also high key crush over here lollll",
    "I understand but I don’t think it’s responsible",
    "You got downvoted for this, but I totally agree.",
    "Yeah I’m already well aware most people don’t care. I thought we learned in 2020 but I guess not",
    "Welcome to r/popculturechat! ☺️\n\nAs a proud BIPOC, LGBTQ+ & woman-dominated space, this sub is for [civil discussion only.](https://www.reddit.com/r/popculturechat/wiki/index/rules/civil-discussion-only/) If you don't know where to begin, start by participating in [our Sip & Spill Daily Discussion Threads!](https://www.reddit.com/r/popculturechat/search/?q=Sip%20%26%20Spill%20Discussion&restrict_sr=1&sr_nsfw=&include_over_18=1&sort=new)\n\n###No bullies, no bigotry. &#9994;&#127999;&#9994;&#127998;&#9994;&#127997;&#9994;&#127996;&#9994;&#127995;&#127987;&#65039;&#8205;&#127752;&#127987;&#65039;&#8205;&#9895;&#65039;\n\nPlease [read & respect our rules](https://www.reddit.com/r/popculturechat/wiki/index/rules/), [abide by Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette), and [check out our wiki](https://www.reddit.com/r/popculturechat/wiki/index/)! For any questions, [our modmail](https://www.reddit.com/message/compose?to=%2Fr%2Fpopculturechat) is always open.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/popculturechat) if you have any questions or concerns.*",
    "Best performance of the night! Incredible!",
    "She’s absolutely electric. i haven’t seen a rapper with choreo in awhile.",
    "She’s so fricking awesome",
    "Amazing performance. You can tell she's a theater kid",
    "mouth was hanging open the entire performance…she’s the real deal!",
    "So good",
    "I’m in love.",
    "Carrying around a giant wad of cash just for tipping must feel great.",
    "Notice she asks first - \"are you allowed to accept tips?\" \nThat clearly shows she does this regular. Lots of places in the UK don't allow you to accept tips, when working retail/hospitality/service jobs.. she wants to show her appreciation, but ensures she doesn't get them in trouble too. Pretty classy.",
    "Do you think she has pre-rolled 20s and 50s in her bag for tipping opportunities?",
    "I know people might think this is performative, but good for her. Too many wealthy celebrities are known for not tipping or barely tipping at all (I understand they’re for the event and it’s not obligated but still).",
    "She's always done stuff like this tbh\n\nI remember years ago she ran into some girls at central park who were fans and they told her they were going to chipotles so she handed them cash too",
    "Guys it’s not performative anymore if it’s done consistently over decades. lol\n\nShe literally tipped her crew a 100k. Like come on now.",
    "Taylor has been consistently praised as always respecting and paying the people around her extremely well. Since she was a teenager she has a track record of being generous and friendly to all staff. \n\nShe knows that’s not good enough for some people, as it’s still perceived as performative (*covert narcissism disguised as altruism*). But she continues to do it, consistently and also privately - where it’s not recorded.\n\nSo many rich or famous people are stingy little ego fucks who don’t tip or respect us peasants, and they just get called iconic rockstars or divas for asshole behavior. Taylor has polite manners to service workers and people still find a way to be BEC about it 🙄\n\nPerfection is the enemy of good enough and all that.",
    "Not the people getting pressed in the comments 💀💀\n\nI have relatives who live in the united states, and these hefty tips from celebs cover anything from a week's groceries to your standard wifi/frugal electricity bill. Stop shitting on people getting the bag.",
    "Isn’t she known for being incredibly generous with her money? And not publicising it? Like donating to go fund me’s and food banks etc? I know it’s becoming a trend to hate on Taylor but I say good for her!",
    "Good for her! If I were a billionaire, id be doing stuff like this too.",
    "She tipped even her truck drivers thousands extra each. I would do the same if I'd be a billionaire",
    "For people saying this is \"PR\" or staged, i'd say look at the context: There is an extensive history of stories about her doing things like this over the years, and we don't see videos every time. She did it very quickly as she was walking by, so it makes sense there isn't always footage of it. This time someone was already filming as celebrities walked by them, and got it on camera. Not everything needs to be a conspiracy, sometimes people just do nice things.",
    "i am sure everyone is going to act normal about this",
    "[removed]",
    "Love her or hate her, but the way it’s been widely reported how well she treats her crew and staff while on tour, I genuinely think she’s a decent person.",
    "I swear to god that Taylor could find a cure to every known cancer and people would still say it’s performative and that she’s only doing it because it’s a disease that affects her personally.\n\nIs being gracious to workers just basic human decency? Absolutely. But I’m sure the money and kindness was appreciated regardless and it’s not “performative” because someone who is constantly being filmed was caught being nice on camera. My lord.",
    "I am not a fan of hers for a million reasons, but I fuck with this heavily.\n\nI'm poor and I find a lot of joy in charity and I always wondered why you never saw the ultra rich doing more things like this.\n\nIf I was rich, it would make me so happy to be slipping $100s to people everywhere. I'd be like a Grandma giving you a hidden five dollar bill in front of your mom.",
    "I must say, she’s good like that. Generous",
    "She does a lot and doesn’t have to! She doesn’t get enough credit for her kind heart. She could keep all of that money and still have all the fans!",
    "I recently worked an event at a club. Like a social club. And I cannot tell you how many people came up to me and said thank you for keeping us safe. Thank you for being on the lookout. Really appreciate you. And even that was really nice because you think you’re just a fly on the wall, keeping the floors clean or keeping weirdos out of the VIP. But some degree it is  appreciated and that’s kind of nice.",
    "i’m honestly so over the taylor-hate-train. obv her artistry isn’t for everyone, but damn she seems to be a genuinely nice person. she doesn’t give off fake vibes either. taylor is consistent afaik.",
    "Women billionairs like taylor or MacKenzie Scott do this and men (and some pick me women brainwashed by patriarchy) buy islands full of children, white houses and nazis.\n\nYall will never be able to convince me that a matriarchy wouldnt be the superior social system",
    "As a long time fan what keeps her as my number one popstar is not just the great music and hard work but the fact that she has time and again proven to be a nice human. Sure, everyone in the limelight can falter on certain fronts but there are some really horrible famous people and I am glad she isn't one of them.",
    "Kudos to her - it’s nothing to her but could mean a lot to hospitality workers",
    "I may not like her music, but if I had her money I wish I could do the same",
    "Aww the workers sound so grateful. This made me happy",
    "There's no winning with Taylor Swift haters. She's a really cool and nice person.\n\n\n\nThe haters can fuck off.",
    "I’ve been a fan of her since the early days. She used to randomly give fans on Tumblr money whenever they mentioned they were struggling. She’s been incredibly generous since day one, well before anyone was looking at her to call it performative.",
    "Fun fact. I’ve never seen Trump tip anyone. Also one never seen him pay his bills.",
    "I honestly don’t understand people who are angry about this. Even IF it is performative, she’s still giving service workers hefty tips. Isn’t that better than not tipping?",
    "Jlo would never 😩",
    "Reminds me of Amandaland lol, \"anyone here like £20 notes?\"\n\nNice gesture though, I bet the haters hate it",
    "Some billionaire artist even refuse to pay their own workers, so it's nice to see a celebrity actually do visible real good with their money that skips the middle man of \"charities\" and just give back to the people you know aren't getting paid shit.",
    "Not a fan of her music but she’s a good person, very kind and generous!!",
    "Taylor’s just a kind person, she really does not deserve the hate.",
    "Class act. TYSM and a look in the eyes",
    "Not to mention for the fires she posted the organizations she donated to - 11 of them I believe I counted - and did not mention how much she donated. Just that those were the ones she chose and you could donate to them too if you felt like it and could. I love that.",
    "I think this is genuine, and I adore her for it.",
    "More people who are able to do that should.",
    "Here come all the TSwift complainers in 3..2..1",
    "Listen say what you will about Taylor Swift, but it says a lot of people even someone who is famous as her, if they are able to go the extra mile to tip so good for her.",
    "It would make my day to get a tip from her this is very sweet!",
    "I mean she did give major bonuses to the workers from her Eras tour so im not surprised. Perhaps it’s performative but at least they got tipped for their hard work at the event",
    "You know what, I didn’t really think anything of Taylor Swift either way a year or so back. I just had her down as this generation’s answer to Kylie Minogue and Britney Spears.\n\nHaving seen/learned a bit more, I have to say that I think she is a fantastic person and an absolutely brilliant role model not just for young girls, but for people as a whole.\n\nShe seems grounded, happy, does the right thing and just seems like a really good person.",
    "I know a lot of people will say she is just doing this for the camera but she is also generous to her staff and others in private. I think taking care of the people who take care of you is about the least a billionaire can do and too few of them do it.",
    "I swear, if someone made me rich, I would do that too.",
    "why do people dislike this woman",
    "I mean say what you want about her but she’s always been know for being generous. Even at the start of her career. I don’t think it’s performative, she gave huge bonuses to the people who worked on her tour and she donates to like almost every cause. And not small donation either. \n\nIt’s like the one thing about her that people should be allowed to criticize because she should be the example to follow not the exception to the rule. \n\nI had a friend work for J Lo a couple of years ago for some PR stuff and he said the vibe coming from her was that she thinks since she came from nothing and worked hard to get to this level and nobody handed her anything that people should work hard if they want something instead of asking people for help:money.",
    "Her head security guard moves with such grace. He’s fascinating to watch as he shadows her.",
    "ome thing I appreciate a lot about taylor is that she really values the industry she's in, but like, collectively. it's clearly not just the artists, but stage folks, tour truck drivers, security staff at venues, record store employees ,etc.\n\n\nwe know she values her team a lot (many have been with her for years), dancers and musicians, but it's very important to value less visible parts of the entertainment industry.\n\n\nand i don't care either way if she's photographed doing it or not, but maybe this makes another rich celeb go like \"hm i guess i should tip the staff at the venue\" because it had never crossed their mind. then the staff receives more tips and that's what actually matters",
    "Jesus, people in these commments are so ridiculous with your \"I don't like her but...\" \"her music sucks, but...\" \"I'm def not a Swiftie but...\"\n\nYou dont have to preface your compliment with a disclaimer so that \\*\\*god forbid\\*\\* no one accidentally thinks you might be a fan! You can just say something nice about someone. You won't die.",
    "I don't know why people hate her so much. She seems really generous and even in this video, everyone else walked by these hardworking people like they were invisible but she stopped and talked to them and showed some appreciation for them. I'm sure Taylor has her flaws, like every other human being, but she seems pretty generous and actually cares about the world around her. She went to that children's hospital around Christmas then sent them all gifts, she donates to food banks and other great causes. As wealthy celebrities go, I think she's alright.",
    "People need to understand that not everything is black and white. You can dislike her for some things and respect or appreciate other things she does. You can dislike part of her fandom and dance to her music.",
    "As someone who doesn't live somewhere with tipping culture other than at table service restaurants - how do you approach/address people to tip them in these sorts of situations, like what do you say?",
    "If I had that much money I would love to do the same. It’s a shame more don’t do this regularly. The easiest way to make someone’s day and it’s nothing to them.",
    "I will always respect her for this",
    "I worked in the service industry in NYC for over 15 years. Celebrities who are generous and kind have good reputations and the ones who are assholes are widely known as such. Swift has an excellent reputation. She’s the real deal",
    "I don’t love her but she always seems to be tipping people, whether in front of a camera or not. Can’t hate on that at all.",
    "Look, I despise her music, it’s not for me whatsoever. But almost everything I’ve heard about her doing, the way she carry’s herself in interviews or fan interactions, she seems to be one of the extremely rare 0.0000001% of ultra wealthy human beings that corruption and greed hasn’t taken ahold of yet and that’s good enough for me she’s one of, if not the only billionaire on the planet I’d gladly shake hands with and thank them for what they do.",
    "Not a \"swiftie\" but she's earned my respect, action speaks louder than words.",
    "People are calling it performative, but money is money. It's still a generous gesture.\n\nI still prefer performative kindness over the opposite. \n\nIf I find myself in a group of people who booh her more than they booh a greedy, stingy, toxic, vicious tyrant .. then I know I am in a group with stupid priorities.\n\nYes, I know that the audience at the sportsgame booed her because they're unhappy with which sports team she supports. Like I said; stupid priorities.",
    "I like her dress 👗",
    "One of the few who actually tips and pays her ppl!",
    "And the haters will find an issue with it somehow. She did it for attention. It was staged. She didn’t give enough. She was smug when she gave them the money. She treated them like a charity case. Am I missing any?",
    "Her entire public life is being sucked through a lens almost all the time. She doesn't choose whether it's performative or not.",
    "Money means nothing to her, but, she knows it means everything to everyone else. She is a wonderful human being",
    "She does this all the time. Usually not filmed. She is a sweetheart.",
    "She a real one. Meanwhile, Kanye is jerking off to concentration camp footage in the back alley after he got kicked out for low class and deplorable behavior lol",
    "Love her or hate her, she seems to be a genuinely kind person who wants to have a good time and enjoy her life.",
    "Ugh she's the worst! How dare she flaunt her money like that..... is what I would say if i was a mouth breather",
    "Shes annoying but what she did for her tour in bonuses, shes a legend.",
    "She does this everywhere all the time and so many other good things yet she gets boo’d and hated on. This country is in the upside down.",
    "Such a nice woman",
    "OMG I'm so glad they had a camera right there to catch all of this",
    "shes a good person idk why she gets so much hate. I mean her music is meh for me. But as a person shes seems cool.",
    "I love her and don’t understand how anyone could dislike her. She genuinely seems like such a lovely person.",
    "I love Taylor!! She’s the best!!!",
    "I am convinced people hate her over her fan base more than who she is because as someone who does not like her music she still Seems like an absolute sweetheart compared to other celebrities.",
    "I'm not a fan of Taylor, but I'm a big fan of workers being paid. Good on her, I hope other artists tip at events like this!",
    "![gif](giphy|AgPt9udT567spxbSHf)",
    "Her mama raised a very compassionate human being.",
    "W Taylor",
    "Our Queen continues to Queen. Love it.",
    "It was nice of her to also say “We appreciate you so much.” That goes a long way for someone to hear.",
    "I'm pretty indifferent to her, but I've consistently seen over the years that she is quite generous. So credit to her for that. She had the money in her hand too, so evidently she was always planning to hand it out.",
    "No but like….idk how she does it 😭😭 I’ve loved her since I was young, and my mom loves her bc she’s one of the few celebs who became famous as a child and never went through an “unhinged,” for lack of a better term, phase. \n\nYou see so so many celebs that end up addicted to drugs or severely depressed bc of the pressure, like literally 99% of humans would—and Taylor is somehow a lil insane in that she hasn’t gone through anything like that publicly, she has a solid reputation for being kind and charitable, is severely scrutinized for every move, hated by insecure men everywhere, booed at the Super Bowl, and she brushes it all off????? 😭😭😭\n\nTo be clear, this isn’t to deride anyone else bc I can PROMISE you id crash out week one of recurving a tenth as much scrutiny—and that’s even normal and human! It’s just insane what she’s had to go through and, yet, she hasn’t seemed to have lost herself with it",
    "not even 1% of her wealth but my Mother is very generous and even on her own pension she tips people who help her with any chores and for good meals at restaurants... one day I asked her why she tips that much and she told me that she knows the value of hardwork, skill and hospitality. She went on assert that it is her money that she uses for tipping and it should be none of our business :)",
    "Regardless of what's said about her, or even some people booing her, she gets it done. And sets a great example. Even if it is performative, which I don't think it is, it's a nice thing. We need more of that.",
    "clearly it's better to be an asshole so that when you do something nice people aren't trying to find ways to knock you down",
    "I do not generally care for her but somewhere along the line she was taught to be kind and tip service workers, so she is aces in my book. You cannot teach this.",
    "That’s so sweet of her. I’ve always heard she’s super generous to her staff/crew so this honestly doesn’t surprise me",
    "She can be performative while still doing something good. Intention does not lessen the impact. She’s always seemed to be a very generous woman",
    "I know a certain orange someone who doesn't even pay his bills.",
    "Her generosity is something I've always admired and greatly appreciated about her.",
    "Does Taylor have flaws and things she sold be criticised for? Yes. \n\nWas this a nice thing of her to do? Also yes.",
    "That's why billionaires have run campaigns to malign her image in right wingers minds",
    "I would think this was performative if this wasn’t actually what she does on a consistent basis in front of and behind the camera.",
    "Goals tbh",
    "As I kid, I used to daydream about having a giant wad of cash and then walking down the street and giving it away to all the homeless people I’d see on my way to school 😭",
    "![gif](giphy|987p6CfE8uzSg|downsized)",
    "I'd feel SO rich",
    "This is one of the primary reasons I want to be rich, to tip A LOT to people who deserve it",
    "I think that's a little unfair. Even at worst, she did a good thing here. I can't think of selfish reasons to do this. She's not responsible for the economic divide between people. And even benefitting from it, she still thinks it is important to recognize the people who do the work it takes to make her life possible. Famous and rich or not, she is still just some woman. And if I saw some woman do this, in any other scenario and if it was anyone else, I would think well of them. It must be nice having that money, but there are a lot worse ways I know she could be spending it than supporting working people. It's easy for rich people to donate large amounts to a charity and still be pieces of shit. I have yet to find someone who is a shitty person and also takes the time to thank and tip the person sweeping the floors after they leave.",
    "I'm not rich but palming a tip makes me feel that way!",
    "Some of these rich fucks don't even tip so good on her for that",
    "I don’t understand how anyone can find fault in this. Taylor has many other things to bitch about, but her kindness and generosity is a constant great thing about her! \n\nETA: sorry I didn’t mean to reply to you specifically",
    "There's a lot of videos of her doing this. It's super heartwarming.",
    "Technically a lot of places in the US don’t allow it either as far as retail and service jobs. However I’ve never had a manager actually care,  and I’ve had multiple tell me to just take them. End of the day the bottom level managers who actually know it happens, barely make more than us, and understand the struggle. So from my experience they’ve always turned a blind eye to it.",
    "And their are literal hate subs for this person..lol",
    "Ill forever remember this time my friends convinced me to go a state over to see a show at the last minute and the tickets were sold out when I got there (they had their tickets) once everyone was in the bouncer snuck me in without having to pay cause he felt bad.\n\nDude was obviously not allowed to accept tips so I slipped him the money I brought for my ticket during a handshake like a movie drug deal while thanking him.",
    "She hands out $100 bills, a few people have gotten tips from her and shared it on tiktok.",
    "An ultimate way to flex.\n\nWell, she does 100s too going by this one viral photo of her from that Chiefs game:\n\nhttps://preview.redd.it/xp5n3ab59oie1.png?width=1512&format=png&auto=webp&s=09a1aaf4c349473e5fc3f3861eb9b4edcd49661e",
    "I would if i was a billionaire, imagine being able to make people's day so easily. I can't believe more rich people aren't like this",
    "If I was that rich, I'd have a professional bill-roller on staff. And I'd tip them too.",
    "She probably has $100s at the ready in the same way I have dollar bills at the ready in case someone needs money on the subway. 🤷‍♀️",
    "She absolutely does. 100s I bet though.",
    "I'm a non-American & I have a question related to this. \n\nIn the UK our homeless people have complained about how difficult it is to get money from people these days. Barely anyone carries cash anymore, everything is paid via card or apps. Its that rare to need cash we get a surprise if we're told something is cash only & have to run to find a cash machine as it's not worth always having cash on us. \n\nIs it similar in the US? And have people in jobs like this clip where they rely on cash, found they are no longer receiving as much in tips due to lack of cash? \n\nI can see people in services jobs where card payments are already the norm may be doing OK as you can add a tip to your bill. And you can add a tip to an uberfood or justeat delivery. But what about people like in this clip, or the people in hotels who carry your bags, or bring your room service? \n\nOr is cash still very much a widely used thing in the US for this reason?",
    "She’s a famous billionaire lol. Ain’t no way she would tip that low. That would look bad. Most likely she’s tipping 100.",
    "I have a pre-roll of $2 bills I get from the bank to hand out to people on the subways and streets. Started doing it at the holiday and really enjoy it. My friend once said “I wonder if they think it’s fake money” and that gave me pause but I still love it lol",
    "Definitely a benjamin",
    "One of her podcast appearances she said she requests stock of $100s to give out.\n\nI'm not even a fan of her and call her out on other hypocrises, but there's photos of her with $100s too, so I think at her level that's pretty believable, I give her that.",
    "I’m gonna start keeping cash in my bag to tip people, that was a boss bitch move. Except I’m poor so it’ll be ones and fives instead of hundreds but still.",
    "Even if it’s performative, I doubt those workers are complaining about it.",
    "The exact sort of performatism where everyone wins, tbh. Let billionaires be pressured into handing out cash to people earning 50c an hour",
    "Like after seeing so many billionaires giving bare minimum after the fires, i support any kind of act of giving to people",
    "She's always been known for giving tips + bonuses to everyone who works for her though. It's not hard to just accept she's a caring person. People always have to create an ulterior motive/narrative with Taylor for some reason lol, maybe she's just.... nice?",
    "I’m not fan of Taylor but it’s really no winning tbh.  She does it in front of cameras or announces it and it’s “she’s so performative, they never do it secretly😒” but then if she doesn’t do it in front of cameras it’s “I’d like Taylor to do some charity for once🙄.” \n\nShe’s still a billionaire but idk people would complain when these workers still got paid by her.",
    "She always have been like this. She paid her band a better salary than everyone else",
    "The only ones who are performative, are the ones who complain online about it.",
    "Oh anyone who says it’s performative is bitching just to bitch.\n\nShe’s a billionaire and she’s just a singer, she’s not giving out bribes or handouts to wealthy corporations. If she wants to give back some of her wealth in the form of some $100 bills to working class people, I say let her. It costs her nothing but may be a huge deal to the recipient. \n\nAs long as it’s real money I say perform away!",
    "she can perform a few hundred into my bank account idc",
    "Agreed good for the workers they deserve it",
    "Yeah she can’t win either way, may as well be hated for doing the decent thing rather than not doing anything at all.",
    "I do stage rigging as a job and deconstructed the stage she performed at in Cardiff, Wales last year. I wasn’t even main crew but our catering was all paid for out of her pocket, and she donated £50k to charities that help fight poverty in that city, and every other city she performed at in the UK. \n\nSay what you want about the private jets she uses, legitimate criticism, but she puts her money where her mouth is at least, and looks after people. She’s got the money to do so and she does.\n\nStill don’t like her music, but she seems to be a better person than the internet makes her out to be",
    "People who may not necessarily get a lot of tips/earn a lot normally are getting free money. Regardless of what you think about Taylor, that’s cool! Redistribute more wealth!!",
    "Taylor has always done this. It’s not performative if you are always doing it and always making it a part of your brand. Like FFS someone can’t be an ethical CEO? What do people want? United dude instead cheating on his wife and killing people for profit? Whatever she gave them prob covered a day of food, a bill, gas for a week, and people have the nerve to call it performative when she’s been doing this for 15 years?",
    "its so counterproductive to argue about when people are doing the right thing (like giving money they dont have to)",
    "I think anyone who thinks it’s performative should just look at her long record of giving back. $100,000 to every truck driver, donations, tipping people. Not all “celebrities” were raised like assholes.\n\nEDIT: and if you still think all that is performative, I just think that means you’ve never had a boss or guest have respect t for you enough to give you a bonus/tip.",
    "She gave a portion of her was yours earnings to the truck drivers that drove her equipment and busses and things as a bonus. Some hit over $100k in bonuses. IDC what you think about her politics or her music. She’s a fucking sweetheart.",
    "Exactly! So what if it benefits her plus them and hurts no one!",
    "It's a win-win.  Charity is a win-win.  She gets to look like the good guy, they get a little extra to do what they want.  Nobody is hurt.  Love it.",
    "It’s honestly probably pretty hard for it not to be performative when literally everything you do is photographed or recorded - at that point I just start giving benefit of the doubt for all seemingly random acts of kindness.",
    "And you know what even if it's performative as long as she's doing something good and not holding it over people's heads it's all good. People are so worried about reasons not to be good instead of just doing good stuff and dealing with the consequences that don't matter at all",
    "Nah, the way she has money ready to go, asks them if they can accept tips and then discreetly hand them some money show this is part of her routine. Hate her or not, this is some classy shit to do.",
    "I live in Vegas and work in casinos. The most popular “celebrity who didn’t tip,” name who comes up? Michael Jordan. Billionaire.",
    "I accept 100% of performative tips, please and thank you lol",
    "Damned if you do, damned if you don’t. Not a fan of Taylor’s music, but we are often waaay too critical of this woman lol",
    "*Ahum* JLow.",
    "It should be encouraged. \"Oh its performative\" okay well... it's better than the performances of being a good person most celebrities do. \n\nLet's get rich people competing to be most charitable again, instead of building superyachts and destroying democracy",
    "She gave them chipotle money? Bro I swear to god if someone did that for me I would be so goddamn jolly about it",
    "I like the story where she gave someone her purse lmao. I forget if it was a fan or maybe a journalist but someone complimented her purse and she just emptied it and let them have it. \n\nAnd on her birthday at the children’s hospital when people dragged her for wearing an expensive outfit and she sent a little girl the same outfit a few days later because the little girl complimented it. \n\nOr the 10M she donated for victims of the LA fires. \n\nI will never understand the hate for this woman. She doesn’t have to do any of the things she does and is so overly criticized and ripped apart for no reason.",
    "it was the fan's birthday! she gave the girl $90 and asked if it was enough to cover it",
    "Omg the $90 for chipotle 😩😩😩 i think about that often.",
    "My friend went on tour with paramore when they opened for TS recently. Not even with Taylor’s team, and almost every other night she was getting goody bags and favors from Taylor, coming home (edit: to the hotel) to country-specific snacks and novelties…even some commemorative jewelry too. Shes always shown gratitude",
    "I remember that. I think it was one of the girls’ birthday too",
    "Looks like she was in a hurry too. But still stopped",
    "She gave her tour crew  atleast 55 million dollars in bonuses and donated to every stops food banks.",
    "Idc if it’s even performative, it’s nice and generous.  That extra tip makes a huge difference to someone. She feels good, they feel good.  Everyone is happy.",
    "I'm not exactly a fan of her music, but the overwhelming hate she gets just seems odd to me. \n\nShe seems like a genuinely nice person.",
    "More than 100K. She gave them 200M in bonuses all together",
    "It’s very telling that several of her band and her glam team have been with her since those early days.",
    "Even if it's performative it's still real money for real people, so why should we complain about it. They're still going to be happy no matter the reasons Taylor had for doing it.\n\nI don't really like her but there's nothing to complain about with her tipping people a lot.",
    "What I struggle with is people’s binary perception of celebrities as entirely good vs entirely evil. Taylor, like like the vast majority of people, does good things and bad things. She is nuanced. \n\nIt’s fine to frown upon her private jet usage while simultaneously appreciating her being generous to staff.",
    "How would she go about NOT tipping performatively, though? (Not actually asking you, personally, just the world at large.) Everywhere she goes, there are cameras. Is she supposed to apply elaborate disguises and double back into buildings like a secret agent losing an enemy tail? \"Sorry guys, I see paps, so no tips today!\" SMH",
    "My partner told me last night that Kristin Bell does a lot of charitable stuff that nobody knows about because she doesn't talk about it or take clips of it. I guess it was on Dax's podcast or something?",
    "I love her so much 🥹 I always remember reading some article long ago where a fan comes up to her during the interview and says it’s her birthday and Taylor gives her money and says birthday dinner’s on her or something lol\n\nThis has always made me feel like… damn I want to casually run into Taylor and get my palm greased",
    "I literally dont give a rats ass if its performative bc she helps people why does it even matter?",
    "She gave almost $200 million in bonuses to everyone on her Eras tour. I know for one person it was $100k.",
    "They could never make me hate Taylor. Occasionally a hateful comment makes me post a list of many of her amazing deeds she never publicized and I get downvoted into oblivion because “what about the private jet!!!” But she’s a GOOD person. The world is better because she’s in it.\n\nEdit: Annnnd now there’s so much hatred below this comment, grasping at straws and misinformation. I’ll never understand why some people don’t pour their hearts and energy into the things they love instead of the things they hate. This world would be a much better place if they did.",
    "My brother in law did security for her years back on multiple occasions. He said she was always very polite and considerate towards him and the rest of his detail.",
    "Yet people all over love to lump her in with every other billionaire. It always feels like misogyny. She seems nice and is actually talented, but people will rip her (and honestly most women) apart for every action or inaction.",
    "Classy and kind.",
    "I mean there's definitely other valid reasons to criticize her but this is one of the reasons why I'll always have some respect for her. She values people's work and what they do behind the scenes and even the little things they do that people don't even realize. I'm glad her employees and the people around her are appreciated",
    "I don’t understand the hate she gets. She’s existing, creating art and treating the people around her generously. She speaks out on issues that matter to her both as press releases and through her music. What more do people want?",
    "I'll support this type of narcissism any day. Lol",
    "I can't help but think it's part of why she's so successful. Being a good person to work with/for is key to success in many careers.",
    "Yeah I can’t be mad at this. She wasn’t filming herself, she has the ability to do so, and it made the workers happy especially when they’re forgotten about. I call her capitalist Barbie every time I see her and I’d still take the money and say thank you lol I’m broke.",
    "Is that the new American dream?",
    "She donated to the LA fires, and while she didn’t publicize how much, it’s rumored she gave $10 million.  During Covid she gave away smaller sums of money directly to fans (like $13,000 because she loves the number 13).  I believe she also paid for health insurance for the employees of a record store in Nashville during Covid. She gave her Eras tour truck drivers a $100,000 bonus each.  Those are just the things we know about.  She’s incredibly generous and it’s very heartwarming!",
    "I heard that she gave extremely generous donations to food banks in each stop on the eras tour.",
    "Billboard ran a story a few weeks ago of her donation history. I think it’s easy to forget how often she’s donated or given away money (I forgot about her giving money to Kesha’s legal defense). https://www.billboard.com/lists/taylor-swifts-charity-donations-gifts-timeline/october-2011-she-donates-70000-in-books-to-her-hometown-library/",
    "What has she done to justify the hate she gets?  Just being successful?",
    "Every city she visited on her tour she donated millions to local food banks and homeless shelters. And she gave all the truck drivers for her tour something like a $100k bonus. She’s incredibly generous.",
    "[deleted]",
    "People don't understand how massive this is! Truck drivers don't get bonus, like EVER. And she was handing them out 100k to EACH driver, for just 6 month touring! Several people are walking out of that Eras Tour as millionaires or half a millionaires, bet!",
    "I believe it was $100k each bonus. Life changing money.",
    "Plus this is her after party dress, so she’s definitely a few drinks deep by this point and probably not focused on scheming and plotting.",
    "Exactly. I understand she does this all the time… so how “performative” can it be if it’s a regular thing? Let her performative her ass all day long for these hard working folks…",
    "also let’s say even if it was for PR, i kinda don’t care if taylor swift gets good PR for doing good things",
    "They can never be normal about a single Taylor swift related thing",
    "True. \n\nAnd she knows this 100%.\n\nSo it’s great she gives anyway, knowing she would get flack either way, at least here some deserving people get a little extra money.",
    "I like that she doesn't give a shit and does it anyway.",
    ">Doesn't give at all: cheap-ass billionaire\n\nFair lol",
    ">I swear to god that Taylor could find a cure to every known cancer and people would still say it’s performative and that she’s only doing it because it’s a disease that affects her personally.\n\n\nHow selfish. She's leaving all those oncologists out of work.",
    "Bruh it isn’t just this, she has donated a ton of money to random fans throughout the years and never said anything about it and people still think she is a demon and only doing that shit for good publicity even tho she never advertised it. It’s never enough!!!  ",
    "Same. Maybe I don't like certain things she does, but I've admired her charity work and heard she's a good tipper.",
    "Anytime I end up at a fancy event I always thank everyone working bc low-key I feel like I don’t belong there lmao and I identify more with the staff than anyone else because I grew up super poor. So while everyone is talking about skiing and where they summered and shit I’m like “uhhh yeah I grew up in a trailer park and when I visited the “homeland” I lived in a grass hut???” lol ",
    "I’ve never seen a clip of her being rude or stand-offish with anyone she deals with. It doesn’t seem to have gone to her head.",
    "This. She’s also really generous especially with young fans. \n\nThere’s a great clip of her getting papped walking into dinner or something, and this young voice says her name. She immediately stops and goes over to give the kid a hug and chat.",
    "Me too. She shows genuine respect to others, whether they are service people, other artists, her team or her fans. There are so many examples of this and just one that directly affected me and everyone that went to Eras - she started at the specified time, every night, unless there was a *force majeure* totally out of her control. This shows respect for other people’s time and energy.\n\nThat along with all the charities she has supported (mostly silently), her behaviour to her team and all of these random acts of kindness, make me proud to call myself a fan.",
    "Haters gonna hate hate hate hate hate",
    "If Jlo saw, she’d rush over to snatch those tips away.",
    "I friggin loved Amandaland 😆.",
    "She gave those tips out in the same way my gran used to slip me a fiver. ",
    "Sexism",
    "The way he turned on a dime. He’s use to Taylor doubling back 💀",
    "His name is Drew too which makes “Drew walks by me” in Tear Drops on my Guitar a much funnier lyric.",
    "In this video she says \"are you guys allowed to take tips\" as she approaches which i think is the appropriate way",
    "but also employers paying living wages",
    "I used to work in a restaurant that would let me take leftover food after my shift to hand out to homeless people. The looks on their faces when I dropped off a bag of warm food was sometimes better than the paycheck.\n\nEdit: Not leftover like from someone’s half eaten plate. Just stuff from the kitchen that would have been thrown out otherwise.",
    "I carry around $5 bills to pass out to the homeless. One guy, who was begging by the freeway, was stunned when I gave it to him and said “wow, that’s a lot of money.” I guess it is when the most you get is a dollar or two at a time.",
    "That is how most people think until we are forced to fend for ourselves as adults. It's human nature to care for each other. We shouldn't idolize those that do, we should ostracize those that don't.",
    "My little brothers do this with their allowance. It takes them months just to save up a dollar, and the whole time they're doing chores I can hear them getting all excited and talking about what they're going to buy with all the money they've saved. But the second we leave the house and they see a homeless person at an intersection they immediately give it away.",
    "As a kid, I was broke as hell, but my great grandparents had money. They would often send me to school with a 20 for the week for lunch.\nThe way I would buy EVERYONE everything that Monday and starve the rest of the week.\nIt felt so damn good to be able to pay for things for other people, people whose parents paid for school lunch quarterly and brought treats for the rest of the class. I often dream of winning the lottery to be able to do this with any/everyone I see struggling.",
    "Did you find another way to help people?",
    "I've never understood why more rich people don't just do this. \n\nLike giving things to other people just feels so good",
    "I was a bartender and server for most of my adult life and I dream of being rich just to leave giant tips at restaurants.",
    "yeah, this is not surprising at all. She donates almost a million dollars to animal shelters in nearly EVERY city she goes to. She gave her truckers 100k, and let me tell you, there are A LOT of them. She has a huge travelling circus and they are all well cared for. She probably does more than any artist of her fame and popularity",
    "Yeah... this comment right here is where I'm at.  Personally, I do not like her music.. never have.  I really don't get the appeal.  But she's doing something very kind that MOST people at her level don't do.   I'm sure there are plenty of problems people can have with her for various reasons, but stfu about her doing acts of kindness.  Jeez.",
    "You can complain about a lot of what Taylor does and especially the use of private jets and such, but at the same time she’s running a multi billion dollar business which does usually require the use of jets. \n\nShe also tipped the crew of her tour a fuck ton. She’s gotten unbelievably rich(er) in the past 4 years and it seems she at the very least tries to give back.",
    "Some of the responses to your comment are absolutely wild. Some people really cannot see straight through their hatred of her yikes.",
    "She has always come across as genuinely kind, to me.",
    "She also seems to be incredibly gracious and well spoken in public.\n\nI don't see her making tweets that go viral and get mocked relentlessly, we don't see her even frown being booed at the superbowl! \n\nI've always appreciated that she's smart enough not to feed the media trolls",
    "Have you met the right?",
    "what is ETA short for in this context lol jw",
    "There is an entire subreddit dedicated to hating Taylor Swift. Internet is a weird place.",
    "> Taylor has many other things to bitch about\n\nEven most of that is weak.",
    "Yes. There is no need to be completely polar about everything. Praise the good stuff a person does even if you think they’re bad, point out the bad stuff a person does even if you think they’re good.",
    "Uggghh feel like I've read so much bad about her, but I'm thinking it's just jealousy? I'm betting someone will spin this as calculated. Anyway, she seems kind :)",
    "I'm pretty solidly indifferent to her overall (not meant as a bad thing), but I even don't understand all the hate either. I get randomly suggested Swift hate subs sometimes and it's just bizarre how many there are!",
    "People are stupid. \n\nI’m unsure why everyone has so much hate. I’m not a swifty, but that’s a fucking class act right there. She didn’t have to, but she did. \n\nShe hit everyone there too with that cash. Good on her.",
    "Yep just yesterday I asked the guy at Walmart changing my tires if I could tip me and said he would get fired but thank you.",
    "That is such a cool move. When I worked jobs that were tipped, I remember the feeling I felt when someone tipped me really generously. I can’t wait to be able to afford to do that same.",
    "Just to put a point on this: If you have a billion dollars, tipping someone $100 is giving away the same percentage of your net worth as someone who has $100,000 giving away literally one penny.\n\nJust a reminder that the only reason other billionaires don't do this constantly is that they can't be bothered. Taylor Swift can be bothered, at least some of the time. Kudos to her.",
    "What a boss.",
    "lived in LA, and a friend of a coworker was a bartender at a super well known celeb bar/restaurant. she LOVED whenever taylor came in because it essentially ensured she wasn’t going home with less than $1k (they split tips so it would be divided amongst bartenders, busboys, hosts, waiters, etc). \n\ni know taylor gets a lot of shit but no one on this earth can ever accuse her of being stingy",
    "this picture kills me 😭 reminds me of grandma slipping you money when parents aren't looking",
    "Lmaaao I have never seen this, thank you so much",
    "Seriously my favorite picture of her",
    "Me on payday",
    "What I love about this is she specifically carries money on her for this purpose. People this rich with handlers and stuff often don’t pay for anything themselves, they have someone who carries their wallet for them. Hell, I’m middle class and I never have cash on me unless it’s for a specific purpose.",
    "Not the kind of person that should've got booed at the superbowl. We as a country have completely lost the plot.",
    "I'm not a fan of her and some of the things she does, but this is a pretty classy move and I can respect that she seems to respect the people that got and keep her where she is. \n\nAlso, just insane to imagine walking around with a few grand in my pocket just for tips for the day. Like keys, wallet, phone.... hmmm im forgetting something... oh shit forgot my fat stack of hundreds for tipping.",
    "It would make me so happy. If I ever somehow become wealthy I’m going to tip everyone",
    "Most billionaires become billionaires by being severely mentally ill. Their brains don’t work like the rest of us.",
    "[deleted]",
    "“Is that person hired to just roll joints for you?” “No, those are the rolled wads of cash I give out just to help people out or for tips or whatever. THAT’S my joint roller over there.”",
    "I once met a woman who had a professional joint roller on staff. Just one way she wasted daddy’s money. She was, as you might imagine, not well. ",
    "Dang. Nice!",
    "I think it’s partly generational and maybe cultural/regional. I never carry cash. But I dated a guy from rural Georgia who always had “walkin’ around money” in his wallet. My dad definitely carries cash too. \n\nIf I know I’m going to have to do cash tips I’ll go to an ATM or get cash back. Also sometimes when you buy something off Marketplace/craigslist the seller prefers cash.",
    "In London many homeless (in central London anyway) have the card machines so you can tap and pay with Apple Pay. ☺️💵",
    "A lot of hotels have started offering tipping QR codes for this purpose.  Same thing at nail and hair salons where you are often not able to add a tip on your credit card.",
    "US is heading towards a cashless society like everywhere else but they are years behind Canada and most of  Europe in that regard. Debit card payments, etransfers (bank to bank, not Venmo) and tap payment are all relatively recent to the US. Actually I’m not sure if e transfers have caught on yet.",
    "For several years I never had cash on me. Lately though I always do. Lots of small local businesses have started adding a surcharge for paying with a card, so I get cash if I’m going there and usually take out a little extra for a cushion. So the trend may be shifting a bit if this is happening in lots of places.",
    "I don’t know. I served David Beckham at the restaurant I worked for once, and he did tip us £50, which is decent but not excessive. I never felt like he should have given more based on wealth. \n\nI appreciated even more that he was pleasant and nice to staff, which is definitely not a given for someone that famous.",
    "Performative money is still money 😆.",
    "Let the girl perform all she wants!",
    "More celebrities and wealthy people should tip preformatively. I never heard anyone say. Wow how awful, I just got tipped performatively. What’s everyone so upset about. Besides, girl always has a camera on her is most her public life not going to be considered performative in order to keep her public image?",
    "It's not the workers who are complaining usually",
    "Exactly! I'd be damn grateful if a celeb wants to be performative by giving me some cash.",
    "A truck driver on her tours wife posted on social media all the drivers got $100,000 thank you.",
    "I don't think it's performative because it's literally nothing to her and also her body language isn't showing off a single thing",
    "Because every accusation is a confession with these shitbags. They're horrible people and can't fathom somebody with good parents was raised a decent person. She's under a crazy amount of pressure, should have had some kind of heel turn by now. But no, maybe she's just fine.",
    "Right? People make her out to be diabolical but I think she’s genuinely a nice and caring person. she’s generous, and thoughtful of the people around her.",
    "The worst is when people say things like, “only $500?! She’s a billionaire!”",
    "I don't know what more people want from her, tbh. I mean, come on. She donated to food banks in every city of her tour ffs. Just because she isn't giving away every penny doesn't make it any less nice when she does do something (which is OFTEN).",
    "Given she’s followed by cameras and phone cameras I don’t think she could do that quietly",
    "I’m not a Taylor fan either- but she does a ton of charity. She visits Children’s hospitals all over the world when she tours, she fills food pantries in cities she’s touring in, I’ve heard of her donating to animal charities in cities she tours, etc.  \n\nPeople love to hate people, especially when they are jealous.",
    "seriously, she's held to a much different standard than her peers, everything she does is wrong to someone. i've listened to her stuff casually but there's really no denying that she's generous and takes care of people when others wouldn't even think to do that.",
    "Louder for the people in the back!",
    "I saw a comment the other day calling her a Trump supporter. She literally endorsed his opponent! Some people are just haters and won’t let a silly thing like reality stop them.",
    "People only want good deeds to be done secretly but to find out from others who tell everyone essentially. Someone could be the most generous and charitable person secretly (and happy for it to be kept secret) and you’d never know but people will judge them because they’ve not been “outed” by anyone yet.",
    "Yeah, my cousin works for artists setting up the stages - he actually missed the opportunity to do ERAS and he was pissed because the pay was better than any of the other tours he’s worked on. And we’re talking very big names. She also gives good bonuses. ",
    "And she’s had some of the same band members since she started out! Amos and Paul for sure. Says a lot of her character and how she treats her band.",
    "I want a neon sign that’s says “whining about Taylor Swift online is not activism”",
    "She’s only valued at a billion because that’s how much her masters are worth & the value of her homes & properties and her companies. Not that it makes a difference, she’s still insanely rich, but the money she actually has is not a billion lol",
    "Yeah I don't like her music either but everything I've seen about her leads me to believe she seems to be a decent human.\n\nHowever I don't think billionaires exist but I don't think she is evil for her wealth considering who you can compare her too.\n\nI also don't understand much of the hate she gets either.",
    "I don’t personally care too much about whether or not it’s performative because we have actual billionaires buying the White House so like at least it’s a net positive for the people she’s “performatively” giving money to",
    "Rich people used to build parks and schools and libraries for the public, it would be amazing to go back to that kind of rich people behavior!",
    "Performative cash is still cash",
    "She actually gave them more than Chipotle money and told them to go some where nice to eat dinner.",
    "Fan for life fr.",
    "It was Geraldine Viswanathan, the actress (who was in Drive Away Dolls with Margaret Qualley, and happened to be with her in Electric Lady Studios when Taylor showed up).",
    "I started to listen to Taylor’s music last year after not really being a fan for like 15 years. And the hate she gets has made me understand the song Shake It Off. Yes, I know the song is repetitive and the lyrics are simple. But I can’t help but sing it in my head every time a thread like this one comes up. People who are determined to hate her will find a reason to complain about her no matter what she does. It must be so exhausting to have people pick apart every single thing you do. She has no choice to but to shake it off, because internalizing that constant, undeserved hatred would destroy a person.",
    "I think she gave her all the cash she had and told her not to go to chipotle and go somewhere a little nicer for her bday lol",
    "Yeah her security guy who stops with her is like “FFS this again, we gotta go”",
    "She did another set of bonuses at the end of the tour in 2024, bringing the total to $200 million",
    "Sure and I agree with that sentiment. But I still stand by saying it’s not performative. I think generally in American culture it’s a crutch and defensive reaction to call out charity as performative but even beyond that deeper cultural issue - if something is a habit done consistently over time it ceases to be performative.",
    "Yeah I meant 100k each, thanks for clarifying though.",
    "People who can keep friends for decades are decent people in my book. It's a really quick way to tell",
    "The fact she’s stayed relevant in the industry for so many years in general is telling to me. People always wanna paint her to be this monster but like if she was so awful she would not have gone this far in her career.",
    "I remember an old interview she did with Letterman, she was pretty young, and mentioned health insurance/benefits for her tour staff, and he was surprised that she offered that, and she was surprised that he was surprised.\n\nI know, billionaires bad and all, but I think she takes care of her people and seems to be courteous to event staff too. And I know the Eras tour was making large food pantry donations in each city. It's not nothing. We can argue the ethics of being a billionaire or her carbon footprint or whatever, but those things are a net good.",
    "That’s what annoys me, when people complain seeing other people give any form of help. “Performative”, “they can afford to give more”, etc etc. Help is help, and some people are just bitter and sad.",
    "exactly like these people are there for money and money makes the world go round unfortunately so “performative” or not at the end of the day it’s making a real difference in someone’s life ",
    "I've noticed that people absolutely hate nuance. They deeply desire everything to be black and white. I don't know if it's youth/immaturity (bc that is something you learn as you age) or what but it's kind of wild. The world never was and never will be black and white and neither will any single thing in it. The world exists exclusively in shades of grey. People online *strongly* resist this fact it's nuts",
    "And it also should be noted her private jet usage does not even register in the charts of top private jet celeb flights. Even during her tour. \n\nShe was a scapegoat for that, because her name gets more engagement than for example Celine Dion or Beyoncé, who were actually in the top 10. The actual top guy? Can’t remember his name. Cause no one brings it up, cause no one knows - cause it wasn’t a headline to use his name. \n\nIt made better headlines to go after her, more clicks, more traffic, more ad views, better memes. Some people are salivating for any reason to jump on the hate train and the media fed them (the hate subs are extreme evidence of how desperate these folk are for a crumb of those crackers). \n\nBut yet no one ever brings up that those other celebs must also be criticized for their jets or whatever other potential wrong they’ve done in every post praising them. It may happen to an extent - after some news hits or something - but it’s not as pervasive. \n\nIt is a curiously Taylor thing, that people have to say “I’m not a fan but” “I don’t like her but” “this was good but”. \n\nOf course she’s not a saint. Everyone is nuanced. But it’s the way people have selective standards that’s funny. Adding a moral and carbon footprint check to the end of every compliment. \n\n\nLike have at it, but give that energy for everyone. Hold every celeb to these standards. Direct the accusations to the right people. \n\nAnyway, I’m just giving thumbs up to anyone being polite to service staff 👍 god knows normal people can’t even manage a thank you half the time",
    "100%. I'm not her target demo, i find her overall fame and persona a tad exhausting, but from everything i know of her, she is clearly on the good person side of the scales. So what's to hate?\n\nShe's not for me, that's fine. Not everything is. I wish her well.",
    "Yep. That’s why it’s *bitch eating crackers*. Doesn’t matter which way anything is done, quietly or loudly, she’s always just over there eating her fucking crackers.",
    "I think this is true. She got stuck in Florida during a hurricane once and instead of hunkering down with the other rich people she went to a nursing home and volunteered, keeping them entertained by singing, helping to serve food, etc etc",
    "I don’t care about her music, but she’s a great role model for any young woman.",
    "Yeah I agree. I personally don’t like her but I have zero negative to say about this. Regardless of her motives, as someone who used to be in the service industry, this would’ve made my day for sure.",
    "Always have been the American dream. Service Workers depends on tips",
    "And while I hate to defend the 1% needlessly, a lot of her net worth is tied up in the value of her masters; that she’s never going to want to sell. She probably doesn’t have a billion dollars in liquid cash which some people seem to wilfully ignore. I’m sure she has more money in her checking account than most of us could earn in 10 lifetimes, but people also need to conceptualise how many people the Taylor Swift™ brand employs and supports too. Hundreds? Thousands? Security, assistants, house staff, managers, her family, drivers, band members, etc, and we’ve heard from her staff that she pays well and has better benefits. \n\nYou have to be greedy to get the amount she has, and I’m always for adequate taxation of the insanely rich, but people thinking celebs have millions and billions in liquid cash always irks me.",
    "Not just the truck drivers, right? Didn’t she end up giving several million in total because she gave everyone from the tour a massive bonus?",
    "she also donated to hurricane helene, which is a lot more than a lot of celebs and rich people can say. appalachia pretty much got ignored",
    "She gave out a total of \\~$197,000,000 in bonuses for people who worked on the Eras tour.  Bonuses, to be clear, not contractual pay.",
    "Yes, she donated to our Second Harvester's Food Bank in NOLA. The archdiocese of NOLA is now trying to take money from it to pay for sex abuse lawsuits. Yay religion!",
    "Whoa buddy, relax. No need to brag about being a thousandaire 😫",
    "Idk personally all my best schemes and plots are when I’m drunk.",
    "Taylor shaped hole in people's ethics",
    "everytime taylor donates/gives money i know the comments will be fully of hate like-",
    "The fact that people have tried to make this kind of hate happen is so so silly. Like what is she supposed to do to combat the (unfound) performative accusations? Stop giving unless she gets people to sign NDAs to never mention it and intentionally make the world believe that she's uncharitable when it does seem to come naturally to her? That's weird AF. Some of things she does is like, human decency (she tips waiters! she's cleaning up other peoples' trash from the suite herself!), but even holding a door for an old lady is probably \"performative\" to these people if someone gets a photo of it.\n\nThis \"criticism\" isn't anything she needs to concern herself with because it seems to really only apply to her anyway.",
    "Agree",
    "I don’t think there’s ever been a single story of someone claiming she was rude to them. Over a 20 year career that’s extremely impressive.",
    "So happy you got to go to the tour! I also noticed this last year that she has hardly ever cancelled shows compared to other artists - none due to her own problems I think. She has the same backup singers and band for so many years, all her dancers praise her, I hardly hear anything bad from anyone who has interacted with her; all the hate I do read is speculative and projection. The only thing we can see her improve upon is being more climate conscious.",
    "Lmaooooo I just pictured JLo walking through afterward snatching those tips 😂",
    "Why not both? After my dad died, I stayed in a hotel for two weeks while I got things sorted out. He had left wads of money around the house and instead of taking it to the bank, I just tipped every hotel employee I saw, every day. It just felt so nice to be able to say thank you to the people who were helping me out during such a rough time. I am Italian and I watched my dad hand out wads of cash my whole life and it felt good to do it myself. Maintain my opinion that people who don’t tip do not know what real joy feels like.",
    "I was a dishwasher in high school. I would eat off of people's plates. Almost 40 now and still healthy. Well, I think so anyway, I don't go to the doctor",
    "Whoa, dollar or two…Mr. Moneybags over here. Change is probably closer.",
    "$5 is a lot of money lol coming from someone is is not homeless but always struggling with money",
    "I usually don’t carry cash, but when I do and someone else is in need, I give it all to them. My philosophy is that they obviously need it more than I do at the moment, and I rarely have more than $30 anyway, so I’d rather give it to them vs. separating or saying something callous about getting change for them. At least I can help them now, because I may not be able to in the future.",
    "She also donates to food banks in every city she performs.",
    "She didnt give her truckers 100k she gave all of her roadies 100k. Thats about 200 people if not more lol",
    "Exactly.  I remember when she donated 100,000 to the Djs family who got shot at the chiefs parade after their Super Bowl win last year and people were so nasty saying she should’ve donated more and I also read she donated 10 million to the people in LA for the wildfires.  She is a very kind and giving person apparently because she could’ve done nothing.",
    "Yeah she was in town a few months ago and the hype was insane. Like, government getting involved and tons of news coverage and fans lined up before the sun came out to get merch.\n\nNow I'm a 37 year old dude, I have virtually no interest in Taylor Swift, but I couldn't believe the amount of people my age that were bothered by it.\n\nLike, even if you're not a fan, it's undeniable how much business she was bringing into town. And the stuff she's promoting are values like be nice to each other and loyal to good friends.\n\nWhy anybody is bothered by it, I just don't know.",
    "My buddy Is a stage hand for some huge venues in Denver. He has worked shows that were headlined by Taylor Swift, pink, and other big name artist. Pink didn’t allow the stagehands and other workers too even look her away. She even requested at times for no one else be in the room with her.",
    "She also has lowered that jet use over the last two years while other celebrities have increased their use and don’t get the same blowback or even brought into the private jet conversation much. Travis Scott comes to mind.",
    "Can you imagine the craziness if she actually went to an airport and flew commercial.",
    "And she… buys the carbon credits for it. She obviously isn’t in a position to feasibly NOT fly private but she offsets it. At the same time what’s the other option? She just NOT support climate change and stuff? It’s like telling someone who supports climate change and advocated for legislative changes and tries to do what they feasibly can to help to stop driving to work.\n\nAwareness and acceptance are important and that’s how she can best help.",
    "lol I had to unfollow the thread 😂 wild bc I thought I was a Taylor hater but ig not lol",
    "I don't understand how people hate her.\n\nI've heard some of her songs and like a few of them, not a fan by any means.\n\nBut hate her?  Has she done something controversial that I missed?",
    "Also that crazy sub that’s dedicated to hating her",
    "\"Edit to add\"",
    "Edited to add",
    "Only one? Weak.",
    "Right? I’m broke and I’m a good tipper. Nothing could stop me if I had money! You get a tip and you get a tip…",
    "I've seen people go, \"yeah, but that's nothing to her\" because she's so rich. And I think, plenty of rich people are stingy af, so if she was, it'd be nothing to her to NOT tip. She's well known to be generous. I'm not a Swiftie, but I think it's cool that she takes care of her own staff and staff at these venues. Plus I read that her tour made huge food pantry donations at each stop for Eras, which I think is great. I would love to be able to afford to be really generous.\n\nI put myself through college with tips from a restaurant job. I've never been rich, but I always try to tip as generously as I can because I know what it's like to depend on that income.",
    "Exactly. I worked restaurants for a long time and I remember what a difference even just 2 to 5 dollars over 25% would make for my day and so when I’m tipping I remember that those couple extra bucks probably aren’t going to break my bank but they’re gonna make my server’s day better.",
    "i worked at a restaurant where this one guy would come in and give $20 to every single person he interacted with. i was just a hostess and it would seriously make the whole night. ive always wanted to be rich enough to do that",
    "When I made more money I used to overtip all the time even tho I could have used that money to pay down student loans. I just felt so guilty for making six figures after working a lot of low paying retail jobs for a lot of my early 20s 😭. ",
    "My granny would slip me a 20 spot and tell me, “go buy yerself a stick a’ gum” every time. I choose to imagine Taylor saying this as well",
    "thats exactly what i was thinking, shes probably handing out hard candies too",
    "I’m 42. My grandma is 89. She still does this! 😃",
    "•Now don’t spend it all in one place. 🤗• a grandma probably",
    "Yeah my dad (who I don’t talk to) is super rich and always told us “You don’t stay rich by sharing.” Always bugged me as a kid. He’d lecture us over breakfast about how he wasn’t going to leave us anything when he died, so we’d better not expect it. It wasn’t until I was older that I realized the irony; he inherited most of his fortune.",
    "Snoop has/had a joint roller guy",
    "Cue my father not understanding why I never have “back up cash” in my wallet.",
    "I keep a secret $20 in my wallet for emergencies. It isn't included in my cash count.",
    "I spent 6 months living in Philadelphia a decade ago and couldn’t believe how behind the times with financial technology they were! We were long into having chip cards and even tap by then and I was shocked at first having to hand someone my credit card and never have a chip",
    "Seems he remembers what it's like to be an average bloke starting out.",
    "I’ll perform for money.\n\n![gif](giphy|HOsRixUmhVcZ2)",
    "I would like to humbly request some performative money. Anyone looking to improve their reputation by paying off a nobody’s mortgage? Call me. ",
    "My tipping was always performative. It’s how I always get good service and extra drinks slung my way.",
    "Exactly. I’m not going to fault her for doing this no matter the reason and it’s also nice that she went and did it herself.",
    "Here’s the thing about performative money: \n\nIn capitalism, the only form of power is money. Giving people money is literally empowering them. The reason is unimportant. \n\nIn capitalism, the absence of power (money)? Eventually, that is violence.",
    "*\"Wow how awful, I just got tipped performatively.\"*\n\nI can't possibly take this generous tip - it wasn't heartfelt!",
    "I’m pretty sure it was everyone in her tour (that travels to every venue) got 6 figure bonuses",
    "❤️❤️Elon musk and Meta just rip thousands of their loyal employees livelihood’s\nAway from them after years of service",
    "I remember when the story originally came out they calculated how many months of extra income the tips would come out to and it was quite substantial.",
    "She's so fast and slick with it, she's clearly done it a long time.\n\nTipping is FUN. Every year at the holidays,  my kid and I order some cheap food delivery and tip $100. It's fun for US to do that.",
    "I've always hated that take. It might be a drop in the bucket for Taylor, but I think she understands the difference a few hundred dollars can make to someone who isn't a billionaire.",
    "People don’t understand that net worth isn’t what you have in your account. Too many dumb fcks on this internet thing",
    "That always annoys me so much. Yeah she wouldn’t notice if that amount disappears from her account, but to me that would be huge sum of money to get and would change a few things in my life.",
    "People also confuse net worth with cash in the bank. Obviously many billionaires abuse the system by leveraging their debt to pull shit like avoiding taxes BUT it doesn't change my point that a large amount of people think Taylor has a billion sitting in her chequing account.",
    "And people only knew because some of the food banks publicly thanked her. She also donated what’s most likely 10 million dollars to organizations helping with the LA fires recently.",
    "Nothing she does would make some people happy.\n\nJust the fact that Trump 'doesn't like her!' makes it so that she can't do ANYTHING right to a chunk of cult members.",
    "She quietly donated 25k to a cat rescue I work with.",
    "she literally does. so many stories came out after the tour of how she had secretly donated to shelters and other organizations in each city",
    "Yeah, about the only valid criticisms one can have for her are that she exploits her fans by releasing 1000 variants of her albums and that she flies private. The former is a standard industry practice at this point. As for the latter... sure, she travels too much. But I don't think people realize that if she wants to travel, she almost HAS to fly private. A car isn't always fast enough and wouldn't get her to Europe or Asia. Plus, someone of her fame level would shut down an airport if she flew commercial. There's ways of mitigating this but I think she's just too famous.",
    "And once they’re “outed” people call it performative as though it no longer counts for anything. Just a PR move, and of *course* the info was “leaked.”",
    "YES 💀 I’ll take one too. I always see these online activists say things like “well she only donated .01% of her wealth, that’s nothing for a billionaire.” Ok sis, are you donating .01% of your wealth anytime soon?",
    "Exactly! Everything is kind of performative except for charity given in secret. Taylor is awesome for this",
    "They still do, or at least they sponsor them. That’s why you see people’s names on buildings or wings or buildings. \n\nAll that is a tax write-off in the US though, so then they get out of paying taxes.",
    "Yeah I remember that. I think she gave them a couple hundred bucks",
    "Thank you!! One of my favorite wholesome Taylor stories but I couldn’t remember who it was 🥰",
    "Shake It Off is a fun song and I’ll never understand the hate. People love “Hit Me Baby One More Time” or “Sk8er Boi” (as do I) and both have equally silly lyrics. They are pop songs, not Shakespearean sonnets.",
    "Lol this is what I thought too, like “Taylor the car is waiting…”",
    "Wow I remember hearing about that but I forgot. That’s a ton of money",
    "Agreed. I'm a fan of Harry Styles and he's had the exact same line up since he went solo. He even set up his drummer and guitarist who are now married and Harry is godfather to their child. He says that he's just the front man for the best band.",
    "To their credit, both Taylor and Travis still have people in their respective entourages who they have been friends with since high school.",
    "And honestly kinda goes the other way for me, too. I’ve noticed people who can’t keep or maintain friendships are (more often than not) not good people",
    "Yeah, not a knock at TS but there are plenty of celebs with very longstanding, steady careers that are horrible people.",
    "That’s not a factor to judge someone being a good person at all. Plenty of celebrities with long careers are established to be awful. Not saying anything about TS either way, just that logic in general.",
    "I remember a lot of people talking about how she gave a bunch of money away during the pandemic. It was never really published and the only reason anyone knew about it was because the people being helped came out and talked about how she gave them money. I’m sure there were others who never publicly talked about it. \n\nLike yes she is very rich and can afford to give “more” but the fact that she does shit like that makes her a complete outlier. ",
    "She could literally have someone on her payroll whose sole job was to handle tipping and folks would be like “what she can’t do it herself? She needs someone else to tip the peasants? She could tip more if she wasn’t paying that person” like omg give it a rest.",
    "Which is so silly, because she *also* does and gives more than just this",
    "Yeah, I'm studying environmental related stuff in my masters and my friends legit prefer taking buses and trains over flights and eat vegan or vegetarian (including me). And I'm pretty much a swiftie and my environmentalist friends barely go into hate rants about her private jets when I say anything about her.\n\nIf you ask them they'd obviously say taking a private jet like that is selfish (so do I) but yeah they seem to enjoy her music (and humor me at karaoke) and her haters online seem a bit unhinged to me...",
    "It’s an internet thing, everything is dramatised and dumbed down for the vast majority of the population to find it interesting.",
    "Till this day I have yet to see people drag Jay Z, Travis Scott and Kim Kardashian for their jet usage and Jay Z was like in the top 5. Taylor barely made top 30.",
    "Did you see that Vince Neil's (Motley Crue) plane crashed into another private plane at an airport the other day ... and the other plane belonged to actor Vince Vaughn? Neither one of these celebrities seems to be \"private jet\" rich and never gets talked about. A lot of people are doing what Taylor does but she gets targeted. Even the Kardashians are worse.",
    "God I HATE the private jet discourse so much because even if someone flies a jet all the time, THE FOSSIL FUEL COMPANIES HAVE BEEN FUCKING UP THE ENVIRONMENT FOR LITERALLY 100 YEARS. And that doesn’t even include coal mining or coal burning plants. \n\nYes they could stand to use their jets less but the amount of people using private jets like that is barely a drop in the bucket of how much climate damage big corporations have done over the past few hundred years. ",
    "also like, she's a popstar, not an activist, a legislator or a CEO of a global commodities company. of course she, like all of us, does wrong shit and it's catapulted by her wealth, but i'm not usually looking at taylor swift to check whether her actions are more or less problematic when we have literal government takeovers, people burning forests to raise cattle and nestle contaminating water streams.",
    "Good take",
    "Apparently she opens her mouth too much and has the body of a washboard are some of the legitimate reasons given as to why she deserves to be dragged on social media.",
    "I truly adore that saying.",
    "😭😭😭 this is so freaking sweet and even would've considered unnecessary of the average person - who does that while stuck in a city during a hurricane?? My point is, even *normal* people wouldn't do something like that! It goes to show how big her heart is and what a generous spirit she has. Wow, this story just totally made my day. I've always liked Kristin Bell but this just confirms for me why I felt drawn to her. What a human.",
    "wow this is great.",
    "This drives me nuts too. I think last time the music she owns was valued around $500 million. She gives a lot of money away and she has been paying her crew generously for years. She gives them full benefits and healthcare and has since she was a teenager. I know there’s to snark on her about, but her generosity is not one.",
    "\\*whispers\\* I think it is smart that she employs her family instead of just handing them money. They work for her and do important stuff at that like her brother managers her catalogue, but they also get a nicer life than anyone can imagine.",
    "Yeah, close to $200 million in bonuses went to her team",
    "Overall $196M.",
    "I think so. I remember hearing about her dancers getting a big bonus",
    "Yeah, it was around $50k for each person on the crew, from techs, roadies, stylist, etc. My brother is a professional tour tech for a band and knows a couple of people who were on the Eras crew. What a lot of people don’t realize is that the people who work behind the scenes for touring bands/musicians are essentially independent contractors, so they only get paid when they’re on the road and have to find other gigs to fill the gaps if the band they usually work for is not currently touring. Some bands keep some of their crew on retainer and pay them an annual salary so they’re available when needed for touring, but that’s not the norm for the workers outside of the specialized tech roles. I’m sure those bonuses were a huge deal for that crew.",
    "Omg this is so fucked.",
    "Five Taylor shaped holes in the ethics fence \n\n\n\n\nIykyk lmao ",
    "Never forget that the snark sub locked the thread about her visit to the hospital in Missouri and pinned a comment about how expensive her outfit was lmao ",
    "Based on her comments in the Time Person of the Year interview and her openness in TTPD lyrics, I genuinely think she really doesn’t care about public opinion anymore. She realised long ago (snake gate mainly but from many incidents), that you can’t control if people will gossip, talk shit and like you or hate you, so you might as well do what you want. \n\nThe only thing that will last is the music she makes. In ten or twenty years no one will give a shit what people were saying on Reddit or Instagram.",
    "I was thinking what if she got one her bodyguards to hand out tips. A full time employee just dedicated to hand out tips under the radar.\n\nBut then i realized how fucking ridiculous that notion is. If tay wants to give she should just give.\n\nAnd the us should stop normalizing not giving a wage you can live on so you’re reliant on strangers’ generosity.",
    "https://i.redd.it/jopi63u3bsie1.gif",
    "that's nice but I'm sure people who live paycheck to paycheck would also love to tip so they can feel \"what real joy feels like\". \n\nhanding out wads of cash requires the privilege of having wads of cash to give.",
    "I’m sorry to hear you’re struggling. I’ve been there when I was badly in debt, it’s so tough. Hope you’re able to get financial stability soon. ❤️",
    "I think I got shelters and food banks mixed up",
    "She did that in Japan in 2012 when she wasn’t even as famous and she shut down the airport, people’s flights were delayed because of her there. See article about it [here](https://m.economictimes.com/magazines/panache/taylor-swift-mobbed-by-fans-delays-flights-at-japan-airport/articleshow/47147634.cms)",
    "For which she would probably be solely blamed, no less. And I bet a paycheck at least someone would say she should have known better and gone private instead.",
    "Didn’t even think about it. Would make everyone else’s day a lot worse",
    "RIOTS!!",
    "She voted for Harris for one. MAGA didn't like that.",
    "That OTHEE gossip site is basically an unofficial Taylor hate subreddit too lol",
    "I always keep my tips in the 20-25% range but the night I get to tip $100 on a $100 bill will be a good night.",
    "it would actually be insane if i could tip like a real rich person LOL im already giving 30%+ most times",
    "Waiting tables is an emotional rollercoaster. Having customers decide your wage is ultimately a messed up system, so it’s nice when there are people out there making lemonade out of those lemons.",
    "Aw, I hope you adjusted your guilt eventually! We all do better when we all do better.",
    "Her being a giant cat lover has me imagining her giving $100s to cats saying \"go buy yourself a can of fancy feast\"",
    "back in the day my grandma would give me a 25 guilder bill (old dutch money) and said go buy yourself some ice cream haha. ice cream is like 2,50 granny DAMN THANK YOU",
    "that's so sweet 😭",
    "i can hear my fathers voice in my head telling me \"you should always carry cash\" 😩 meanwhile i always get rid of it as soon as possible",
    "\"Hello my baby, hello my darling, hello my ragtime gal!\"",
    "![gif](giphy|v4aN9JGFL62dO|downsized)",
    "This gif 🤣",
    "*I'm your private dancer*, *a* dancer for mone...oh wait",
    "Same. I like being visibly seen as kind and generous 🤷‍♀️",
    "Extra weed at the weed store too",
    "Shes also not showing how much she gives, which would be a big part of the performance ",
    "I know her truckers got $100,000 thank you bonuses at the end of the tour. Ones wife posted on social media and screenshot hit the sub.",
    "people always have something to say. if they were receiving that money themselves they wouldnt be bitching and moaning",
    "She donated 5 million to Florida too in the aftermath of the hurricane",
    "I like to think that rich altruistic people are just laying around in bed on their phones like “ohh cute” and casually dropping $25k on some cats and “ok sure cool” and adding $30k to music education, like me drunk shopping for candles and coffee mugs",
    "She paid one of my colleague's back rent so they didn't lose their house in winter.",
    "Also, just her attending football games has brought an additional $1 billion to the NFL per Forbes. Not that it’s a charity but all the subsidiaries, little guys, etc.  are making money because of her.",
    "She did it on the down meow?",
    "When she paid for Kesha's legal fees and once the info leaked was criticized for not posting a freaking hashtag 🙄",
    "She never once has been named for taking out a Covid loan like Tim Brady and Kanye West. Wonder if she did.",
    "that's not really how tax write-offs work.  What happens is that they don't pay taxes on the money they donate (up to 50% of their income).  Because Taylor has had so much income this year, she actually needs to make huge donations (if she wants the tax credit on it).  \n\nAlso, tipping workers is not a donation, and she can't deduct it.  In fact, she likely has to pay the gift tax on it in addition to normal income taxes. (in the US, the giver of a gift has to pay taxes instead of the reciever. A tip can be payment for services, but if you're giving $100 tips.. the IRS is not going to be happy with you).",
    "They mentioned off camera they felt like getting Five Guys.",
    "It's the Bruce Springsteen way, and, I think, central to a longterm career. You are spending so much of your life with your band. Might as well have them be people, you grow to love and who loves you.",
    ">He even set up his drummer and guitarist who are now married and Harry is godfather to their child.\n\nThis is adorable.",
    "Thats a dope ass story to tell their kids. ",
    "I honestly think that the level of fame that Harry and Taylor have never would’ve happened without them being decently good people. Both of them clearly treat those around them with respect and it serves them well.",
    "My heart!",
    "That’s such a good way for him to frame it, as performing wise essentially what’s the difference between a band with a singer and a solo star who has a band with the same members always playing behind him. (Obviously with a solo star the band behind him don’t contribute to writing the songs and the creative direction)",
    "Oh my goodness, Harry Styles is honestly great. I didn’t get into One Direction, only really heard their music if I was with friends who liked them. I didn’t dislike them, I just didn’t get into their music. Once Harry Styles went solo though I realized he is a damn lyricist! Like he’s really good, I like his music a lot. \n\nThere was one time a friend told me to look up a song of his when I mentioned liking his music a lot now. She told me not to watch the music video though, told me it would probably make me cry cause a fish is in emotional distress. I’m a sensitive one and if I see another being in emotional pain it will make me cry. I made the mistake of watching the music video and cried over a CGI fish being upset. She was definitely right to tell me to avoid the music video lol.",
    "People on reddit confuse being annoying and overexposed with actually being a bad person.",
    "Even her exes' girlfriends/wives love her. Taylor Lautner, Calvin Harris, Joe Jonas.",
    "To me it’s more about the fact her team and band have been with her the majority of her career. And close relationships with other musicians for decades too. I just don’t feel they would be if she wasn’t treating people nicely. Of course she could still make music if she was shitty.",
    "She also gave out a ton of bonuses to crew members during the Eras tour. People reported just shy of 200 million ([link](https://people.com/taylor-swift-gave-eras-tour-crew-usd197-million-in-bonuses-exclusive-8758216)). There's also a CNN article saying that truck drivers got a bonus of $100k, so that gives us an idea of what those bonuses looked like for everyone ([link](https://www.cnn.com/2023/08/02/business/taylor-swift-100000-life-changing-bonus-truck-crew/index.html)).\n\nI will always agree that there is no ethical billionaire, but the way she gives out money like this makes me think she really understands that her wealth is built in the backs of average people.",
    "I feel exhausted for the people who hate her.",
    "Remember when Travis Scott and Kylie Jenner posted on instagram with the caption \"Your jet or mine?\" lol.",
    "God thank you. I've always thought it would be a logistical nightmare for big name celebs like her to fly commercial. Corporations love placing the blame on individuals to distract from who the real problem is",
    "Here’s a short [article](https://www.cnn.com/2017/09/11/entertainment/kristen-bell-hurricane-irma/index.html) about it. I had my details a little off - she went to a middle school that was being used as a shelter and the nursing home residents had been evacuated to her hotel but she still went and entertained them too. There’s a lot of YouTube clips of her singing with residents and kids ❤️",
    "It wasn’t a slight at all! It’s so nice they work and spend so much time together, especially with both her parents having high flying careers, it’s not like they’re not well equipped in a business sense. I’m just saying it’s easy to forget that all the money she earns doesn’t go in to her pocket, it goes in to the pockets of *everyone* that depends on her for their salary! And it’s nice her family aren’t getting hand outs and are really working together.",
    "That is bonkers. Honestly knowing this has shamed me from ever talking smack about her music ever again. More power to her.",
    "Oh, it's a disaster. I believe Gregory Aymond (Bishop) fired the woman in charge of SHFB bc she wasn't budging on releasing funds to help pay the sex abuse lawsuits. This woman has done nothing but amazing things for our city since Katrina. And this sick fuck ruined everything. All to support some child rapists. The whole city is pissed about it.",
    "unhinged 😭\n\nand didn’t taylor send the same outfit to a little girl from that hospital?",
    "but then they will complain saying she doesn’t tip so her bodyguards have to so no wining",
    "Not to mention- if everyone had a liveable wage, then these millionaires wouldn't have as much money to carry around a wad of cash for tipping! /s",
    "Thank you angel ❣️ appreciate you and your kind words so so much",
    "Nope she donates to both. She also pays her dancers and musicians an actual salary even when they are not touring according to things said by those dancers. Not a fan of her music but as a mom to younger girls I'm bombarded with Taylor Swift info 😂😂",
    "With how punctual the Japanese are, I'm sure the mere mention of Taylor Swift makes Japanese transportation authorities sweat.",
    "MAGA traditionally doesn't like woman with a voice.",
    "I bartended in college and one Friday night an anesthesiologist came in for his birthday and tipped me $100 on his $200 bill. Chump change for him, but I had just paid $400 for textbooks that week and was worried about paying my rent. I still remember it over 15 years later.",
    "It’s been a decade since I waited tables, but I still remember every single table that left a really generous tip. Getting to do that for others now is my favorite.",
    "I like to do this around Christmas bc I can’t afford to do it year round so it’s something I try to plan for. It may have been a social media thing at one point, I can’t remember, but my husband and I agree to “tip the bill” when we go out to eat around the holidays.",
    "Ya gotta give em the ol razzle dazzle!",
    "All I can think of is the alien at the diner in Spaceballs",
    "Remember when he was the most embarrassing president we had. 😭",
    "wait is this gif real i desperately need more information",
    "![gif](giphy|l2JJDMwsCYEkS6ksU|downsized)",
    "I love that you wrote this.",
    "This is 100% what I would do if I was filthy rich.",
    "Based on the number of people commenting the random acts of charity Taylor Swift does, it seems like she is in fact doing exactly what you said haha",
    "Her tour brought in a TON of money where ever she played bc of the influx of people staying in hotels, eating out, using car/transport services, etc. ",
    "Wow, she did? Didn’t know that. That’s not chump change.",
    "PPP loans are public info (or at least were until a few weeks ago), so we deff would know by now",
    "Tips are not considered a gift so she would not have to pay taxes. Same when she pays her employees bonuses those are not gifts. Now when she just gifts people money there is a limit you can gift to a person each year before it is taxable. So if she gifts her mom money it is not taxable unless it is above $15,000.",
    "Yes, I wasn’t referring to the tips as a tax write-off or a donation. I was referring to the donations made for capital project expenditures (like building a library).",
    "their kids have harry style as their godfather",
    "I just saw an unhinged comment on this very post about how she’s part of some hit list, so ya I think private jets are pretty much her only option at this point.",
    "Oh I wasn't taking it as a slight. I think it is smart in the sense that people with money sometimes think they need to support their families instead of it becoming mutual.",
    "She did!!! ",
    "I'm like...actively not a fan of Taylor's music but Taylor Derangement Syndrome is so ridiculous like ?????? She's just a pop singer???????",
    "Oh, wow, even better! Oh definitely, her music isn't for everyone, but she's a model professional who knows a lot of money and supports a lot of people",
    "Make sure to do it with some pizzazz!!!\n\nhttps://i.redd.it/ehsd2jzlepie1.gif",
    "The “good” old days ig…\n\nETA: I like the lady in the green dress cracking up",
    "Right?! While I'm a big swiftie, I would hate if she were on my commercial flight because of the commotion it would likely cause.",
    "\"Will a Fosse neck do it?\"",
    "i love this. wonder what that dude who wrote that stupid think piece is thinking now. t",
    "What an amazing and generous donation! That’s the stuff we like to see, has Chappell addressed the whole nail thing situation with members of her team? I’d hate to think she would be okay with other artists getting paid in exposure!",
    "I’m curious to see if he says anything more about it. He looked like such an idiot after his last post.",
    "The stylist did and it was not good. She said it was her and she still does it today, which doesn't work for anyone doubting the email or saying it's NBD because it was a whole year ago.\n\nhttps://www.reddit.com/r/LAinfluencersnark/s/lrsZBLECbY\n\nChappell hasn't addressed it though.\n\nETA ffs, here come the downvotes. It's amazing how people want to fawn over her for calling people out and giving money to struggling artists (which is a good thing, and yay for her) but if someone calls *her* out for *her* shitty behavior, like someone a person still on her team asked for free work from and has doubled down on that, oh no, let's not be so mean to Chappell, she's a queen who only ever does queen stuff.",
    "he posted something on top of the opinion piece he wrote?",
    "Exactly what I was talking about, I saw the way the stylist responded and couldn’t believe what I was reading. It was very nasty and very “I suffered, so you all after me has to suffer as well” like how about we lift each other up when we get to positions of power?",
    "yes he replied and basically said that without his article critiquing her there wouldn't be as much attention on the issue. and went on to say that she should feel bad for shaming a public educator when she makes more money than elementary school teachers. (Hes a professor at NYU and married to some VP at a media company IIRC).",
    "Yeah he whined and cried on his social media.",
    "The first female-fronted band EVER to win best rock album 🥳",
    "this album is so good. actually, this is the first album of theirs I bought. I was give or take with them before, but loved This Is Why!",
    "Hayley is still as relevant as ever. An icon",
    "Not me thinking I can pull off bangs again (after literally just finishing growing them out after 2 long years)",
    "I saw Paramore live last August before Taylor Swift and they even did Mistery Business. They were so cool and even more people were singing then I expected.",
    "Their last 3 albums are so good, hard to.pull a sequence like this. \nHayley is one of the best singer songwriters.\n\nThis is why really deserved the Grammy,  t is so hard for female lead bands to be taken seriously.",
    "I loved After the Laughter. This one...not as much.",
    "This album has not one but TWO ADHD anthems and I feel like they were written for me personally.",
    "Me too in July and I cried so bad, people here didn’t sing that much but Paramore was a blast",
    "Welcome to r/popculturechat! ☺️\n\nAs a proud BIPOC, LGBTQ+ & woman-dominated space, this sub is for [civil discussion only.](https://www.reddit.com/r/popculturechat/wiki/index/rules/civil-discussion-only/) If you don't know where to begin, start by participating in [our Sip & Spill Daily Discussion Threads!](https://www.reddit.com/r/popculturechat/search/?q=Sip%20%26%20Spill%20Discussion&restrict_sr=1&sr_nsfw=&include_over_18=1&sort=new)\n\n###No bullies, no bigotry. &#9994;&#127999;&#9994;&#127998;&#9994;&#127997;&#9994;&#127996;&#9994;&#127995;&#127987;&#65039;&#8205;&#127752;&#127987;&#65039;&#8205;&#9895;&#65039;\n\nPlease [read & respect our rules](https://www.reddit.com/r/popculturechat/wiki/index/rules/), [abide by Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette), and [check out our wiki](https://www.reddit.com/r/popculturechat/wiki/index/)! For any questions, [our modmail](https://www.reddit.com/message/compose?to=%2Fr%2Fpopculturechat) is always open.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/popculturechat) if you have any questions or concerns.*",
    "I'm so tired of these people. I cannot wait for the day that the GOP is a footnote in history books.",
    "![gif](giphy|l2SqhRIwLk8my3HcA)\n\nIt hasn’t even been a month, can we please please please have a break? I’m so tired of this shit y’all.",
    "These miserable people know that their beliefs and way of life are dying out and they are throwing a tantrum out of frustration. Let them make fools out of themselves. Obviously stay standing up against them, but it won’t last. Anger is loud and messy, but not sustainable. It’s tiring being an ignorant asshat.",
    "\"DEI CAUSED THE FLOODS, THERES FAMMINE BECAUSE OF DEI, DEI OFFED HAMARABE\"",
    "Keep crying GOP",
    "they literally only think white men are good at anything. if anyone else succeeds, they think they're a diversity hire.\n\ni wish they could stop using the acronym to hide what they're against. i want them to be clear. i want them to say with their chest that they are opposed to diversity, equity, and inclusion.",
    "how stupid do you have to be to think mrs. beyonce giselle knowles-carter, one of the most influential and talented artists of the last 25+ years and the artist with the most grammys of all time is a DEI awardee? \n\nthese people want to say a slur so bad",
    "![gif](giphy|qcKnA89YDid5DvIROl)\n\nHe sounds like a complete moron, according to these fascist any accomplishment by a POC is due to DEI, as if people were not achieving success or accolades long before these morons discovered the terms DEI and woke.",
    "Guys, it's better to just ignore them when they say something like this. They want attention to raise their national recognition",
    "We all know exactly what word the Congressman is actually calling Beyonce when they use \"DEI\" instead.",
    "![gif](giphy|DFNd1yVyRjmF2)\n\nGood lord these people are exhausting.",
    "I for one am shocked a gop congressman would say this. Shocked",
    "Going to the link to see if it’s your state’s embarrassing representative or someone else’s. 🤦🏻‍♀️ not me this time.",
    "She is a talented, successful woman and a person of colour, their two “favourite” groups to dunk on alongside queer people and immigrants.",
    "Welcome to r/popculturechat! ☺️\n\nAs a proud BIPOC, LGBTQ+ & woman-dominated space, this sub is for [civil discussion only.](https://www.reddit.com/r/popculturechat/wiki/index/rules/civil-discussion-only/) If you don't know where to begin, start by participating in [our Sip & Spill Daily Discussion Threads!](https://www.reddit.com/r/popculturechat/search/?q=Sip%20%26%20Spill%20Discussion&restrict_sr=1&sr_nsfw=&include_over_18=1&sort=new)\n\n###No bullies, no bigotry. &#9994;&#127999;&#9994;&#127998;&#9994;&#127997;&#9994;&#127996;&#9994;&#127995;&#127987;&#65039;&#8205;&#127752;&#127987;&#65039;&#8205;&#9895;&#65039;\n\nPlease [read & respect our rules](https://www.reddit.com/r/popculturechat/wiki/index/rules/), [abide by Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette), and [check out our wiki](https://www.reddit.com/r/popculturechat/wiki/index/)! For any questions, [our modmail](https://www.reddit.com/message/compose?to=%2Fr%2Fpopculturechat) is always open.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/popculturechat) if you have any questions or concerns.*",
    "This is awesome but where are these donations actually going to? ",
    "I mean, cool, but the point of Chappell's speech was that the large record companies should be supporting their artists better with things like health insurance. This is the equivalent of employees pooling their sick time for a coworker with cancer - while admirable, the real issue is that the company should just be doing better by the employee with cancer.",
    "very brat",
    "Y’all absolutely suck lol\n\n‘It’s not enough’ ‘Ugh they are just doing it for clout’ ‘Ummmm I want the full accounts of the charity it’s going to!’ \n\nAt least they are doing something. And $75k to charity is not nothing! It will help people in need of healthcare and that is objectively a good thing. But everyone’s horribly lofty expectations and snark ruins shit like this. Stfu and be happy that an important organisation is $75k better off, and that that organisation will help people, either through direct action or vital advocacy and lobbying. Jesus.",
    "so brat",
    "Love that hopefully Olivia hops onto this since she’s always donating and this is a great cause",
    "This is going to become virtue signaling, isn't it?",
    "wow i wonder if everyone will stop hating on chappell and now start hating all the other celebs speaking out & donating",
    "All of them only doing it for the clout.  $25k is nothing to these people",
    "But fuck free healthcare for all amirite?",
    "The Human Fund",
    "I searched but i also couldn't find where. I hope it goes somewhere good.",
    "Exactly. There’s $75,000 on the table now. How does that get to those in need asap?",
    "They're going here: https://backline.care\n\nAnd so far there's been $246,006 raised.",
    "The rest is petty but I don't think it's illogical to wonder where the money is going. People can be curious how it'll all work without shitting on people donating. Are they donating to their label, what?",
    "I personally am not upset when celebrities donate in exchange for publicity, I'm sure most want to support the cause, and I think there's something to be said about it being public encouraging other artists with a lot of wealth to do the same. That said, I don't think we owe the wealthy gratitude when they redistribute their wealth in a way that our tax system should already be doing, especially when they *also* materially benefit from it more than the money they are giving.\n\nPhilanthropy is a very important cog in the machine of capitalism. As part of a whole, it helps convince society that extreme wealth is acceptable, and that's worth being generally skeptical of. If nothing else, I think it's fine if people are snarky about it.",
    "It’s also very good free advertising for the charity!",
    "Thank you for posting this.",
    "It already is. \n\nI’m not sure why it hasn’t been posted here and have seen people say the posts keep getting denied, but Chappell’s stylist went on a rant the past couple of days after Chappell and her team wanted to pay a small nail artist in exposure. \n\nNail artist called her team out, stylist doubled down saying no one’s too good to work for free because *she* works for free and since she had to struggle to make it in the industry, everyone else should too.\n\nEta: guess some artists deserve healthcare while others should try paying for groceries and rent with exposure 🤷",
    "Living your values has always been virtue signaling.",
    "Chappell Roan was at an event for artists where she advocated for people in that industry. It's a lot easier for her to use her influence to (hopefully) make change within the industry, as opposed to trying to convince politicians to make changes across the country. Think about what you're saying here.",
    "https://preview.redd.it/p16qnp7xr4ie1.png?width=809&format=png&auto=webp&s=f128828df6b3c25fa587048022271a6ed0f59f94",
    "![gif](giphy|fTOf61JwFD0c0|downsized)",
    "😂 ",
    "I’m so confused because it’s not like there is a charity dedicated to this cause. ",
    "Most likely MusiCares, which is the Grammys charitable wing and provides multiple forms of health care (mental, dental, hearing loss, etc) for professionals in the music industry. They also just gave out $2000 on average for industry folks impacted by the wildfire, no strings attached.",
    "The nail artist has more currently on their Instagram story because other people have been reaching out with similar experiences. \n\nApparently, a designer also loaned Chappell’s stylist £1,000 worth of clothes for her tour. But the stylist never returned them or compensated the designer.",
    "ohhh yikes, i heard about this secondhand but people have been trying to distance chappell from the situation and said it was just her team doing this. i'm so tired of people pulling the \"i had it hard so everyone else should struggle too\" bullshit.\n\ni go back and forth with chappell, i do feel like her heart is in the right place but her team seems very mismanaged and this is not a good look at all. hopefully she rectifies it, there's so much exploitation of smaller creators in the industry and i would think as someone who worked for years to get where she is, she would know what it's like to be in that position.",
    "She is advocating for a <1% and you defend her think about that",
    "A quick google search shows that there is: https://musicares.org",
    "The artists struggling to make a career in music are not the <1%. They are the artists who are subcontractors on labels so get 0 healthcare. This isn’t for the likes of olivia rodrigo and harry styles lol. This is for artist 876 on the label roster who has 1M spotify streams, lives in LA in a houseshare and has 0 healthcare insurance.",
    "She's advocating for the have-nots in her industry, since she's been in that position before. Do you think the average Governor or House Representative cares what she thinks about universal healthcare? That's a fight that's much bigger than her.",
    "And healthcare for all is worse how. Don’t be parasocial, it’s embarrassing",
    "She was given screen time, an audience at home and irl, and a mic. And the best she could say was free healthcare bc I rhyme.",
    "I 100% believe in healthcare for all, of course I do. But I think you are wilfully missing the point. Struggling broke artists need health insurance, that’s what chappell was speaking out on.",
    "There are over 300 million Americans who should be advocating for universal healthcare, and you're focused on one person who spoke up for artists that don't have her name recognition. Interesting take.",
    "and maybe she’ll do it next time??? lol damn. you guys are so fake progressive",
    "She ain’t gonna fuck u",
    "👍",
    "Welcome to r/popculturechat! ☺️\n\nAs a proud BIPOC, LGBTQ+ & woman-dominated space, this sub is for [civil discussion only.](https://www.reddit.com/r/popculturechat/wiki/index/rules/civil-discussion-only/) If you don't know where to begin, start by participating in [our Sip & Spill Daily Discussion Threads!](https://www.reddit.com/r/popculturechat/search/?q=Sip%20%26%20Spill%20Discussion&restrict_sr=1&sr_nsfw=&include_over_18=1&sort=new)\n\n###No bullies, no bigotry. &#9994;&#127999;&#9994;&#127998;&#9994;&#127997;&#9994;&#127996;&#9994;&#127995;&#127987;&#65039;&#8205;&#127752;&#127987;&#65039;&#8205;&#9895;&#65039;\n\nPlease [read & respect our rules](https://www.reddit.com/r/popculturechat/wiki/index/rules/), [abide by Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette), and [check out our wiki](https://www.reddit.com/r/popculturechat/wiki/index/)! For any questions, [our modmail](https://www.reddit.com/message/compose?to=%2Fr%2Fpopculturechat) is always open.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/popculturechat) if you have any questions or concerns.*",
    "The fact that the label executive responded the way he did tells me what she said NEEDED to be said. GOOD FOR HER. \n\nAnd fuck that guy. Lmao",
    "honestly, this is a better response than i expected",
    "In her next slides she also posted several smaller artists which I thought was cool, I intend to check them out!",
    "Chappell of all people knows that a man won’t back up the claims he made\n\nhttps://preview.redd.it/c16z2zrwcqhe1.jpeg?width=1170&format=pjpg&auto=webp&s=843013e787c505749913218f324f6050f2cb70af",
    "Record labels and media companies are run by sensitive rich privileged pieces of sh*t who don’t like being called out.",
    "His article was insufferable. Good for her.",
    "this is totally unrelated but does anyone know where Chappell got her bonnet from??",
    "she is teaching the industry that she’s NOT gonna play friendly and she’s gonna UNAPOLOGETICALLY hold you accountable for EVERYTHING you say. queen.",
    "god i love her",
    "And this is why I love Chappell. So many people drag her for not being “media trained” when really she’s just outspoken and doesn’t let people disrespect her.\n\nThis was a great response and I love how it’s shady in a classy way",
    "They could never make me hate you xx",
    "We love a messy queen.",
    "I love when women call out men on their bullshit and then end them, ny favourite genre ngl",
    "Brilliant move by Chappell. And he looks like the bootlicker he is. Open your wallet, Jeff!",
    "The difference in comments here vs. r/popculture is crazy. That sub is a cesspool.",
    "Off topic but from these comments alone I can tell a lot of y’all are under 26 years old…none of y’all have ever had to enroll in insurance before clearly",
    "[deleted]",
    "Oh I LOVE this",
    "This goes hard",
    "Can someone clarify something for me? Wasn't her speech about losing healthcare after being dropped by her label? I understand that's definitely tough, but isn't that what every American deal with? If I lose my job, I also don't have health insurance. I can pay for COBRA at some wackdoodle cost, but I assume that works for music artists, too?\n\n\nThis is just another reason why we need universal healthcare, though. ",
    "too bad we'll never get universal healthcare, but I think this is the best thing she did with this situation ",
    "Shes so fucking cool.  Every time I see someone post about how she needs media training I die a little inside, shes great.  She should be free to do what her heart says.",
    "Oh that guy would not part with a cent. ",
    "Every time I read anything about her, I love her a little more.\n\nI wish more artists were like Chappell. She always stands for what she believes in and doesn't care who likes it or not. \n\nNot only does she make great, authentic music, but she is such a fantastic person.",
    "The leopard print bonnet is the appropriate attire for standing on bidness. I respect it.",
    "get em!!!!",
    "Yes. What a queen.",
    "\n  So I guess I wonder, does he have a point? Nowhere does this executive say this is an issue he cares about? I guess if he did he would be a hypocrite, but he’s just an asshole who is showing exactly who he is.",
    "This is why I love her she is never afraid to speak her mind!!",
    "Why doesn’t she respond to the nail tech that called her out for asking for free nails??",
    "can she pay her nail techs first?",
    "Calling his bluff…I am a proud Stan.",
    "It's a nice offer, but it would have been better if her people allegedly were willing to pay for custom nails in more than exposure pay.",
    "STAN CHAPPELL",
    "What about struggling nail stylists ",
    "I love her so much. The label execs hate her for a reason, and it’s a reason that should have us all on her side.",
    "good.",
    "Girl dinner: Chappell’s version",
    "She did do something about it?? Standing on the Grammys stage asking labels to pay their artists and provide healthcare is literally doing something about it. \n\nShe didn’t post an Instagram story & then say nothing ever again.\n\nShe is not a label?? Why would she be paying for and providing artists she hasn’t signed health care? She asked for labels to pay their artists, not people with money to pay random artists. Maybe I am confused but his response is dumb af either way.",
    "Wish I could agree with her on this one(because she's mroally right about artists recieving more healthcare) but after the nail tech story that came out,I find it very hard to believe she actually practices what she preaches",
    "A step in the right direction for Chappell’s typically messy social media responses.",
    "Her nail drama ruined this for me. You’ll give $25K to struggling artists, but you won’t pay for your custom nails for the grammys? The hypocrisy…\n\nEdit to say: idk why I’m being downvoted lol. The emails have been proven to be from real people on her team and this was just days before her speech at the grammys. Just asking her to practice what she preaches if she’s going to try and create some positive change.",
    "I might get cancelled for this but her speech was indeed wildly misinformed. \nLike seriously. Artists are not \"employees\" of the label - thank god. They do not receive a \"wage\". They are bound by a contract and in most cases they are paid through advances, touring revenues, royalties etc. And yeah like every other independent worker and freelancer, they have to cover for their own health insurance. I am working in this way too by the way, like many many many people who are not artists.\n\nIf she wanted to be radical, she could go up there advocating for universal health care. But that's a very VERY different thing...\n\nAnd honestly I couldnt care less about watching a f*cking celebrity appropriating the kind of language of a wage-earner to gain proletariat cred with a Grammy in hand. Jesus...",
    "Maybe people will stop shitting on her now.",
    "I don't mind this response but it is kinda funny that she followed up by posting several artists \"who deserve more support\" and linked a few who are already seem very much established..? Like they don't have the clout she does, and it's a nice thing to do, but it just kinda fumbled the whole concept for me lol \n\nAlso what about the nail tech controversy? \n\nStill love her music and the good she does ❤️",
    "Hoping that all of her Grmy friends match her donation and publicise it, and shame the industry into doing the same.\n\nIce Bucket Challenge 2025 redux",
    "unrelated but good god i want chappell’s skin care routine",
    "she hit em with the “link and build” lmfaooo",
    "QUEEN! 👸",
    "You can bet she shit herself from excitement that this dumbass put out this article and took attention away from the nail thing.",
    "Sometimes her messiness and lack of media training pans out. It worked this time.",
    "Hypocritical for someone that doesnt want to pay her nail artist",
    "Everything I know about this woman is against my will…",
    "She stole her entire aesthetic from the drag scene but wouldn’t defend those people leading up to the election. When it’s about her bottom line though, she’s really brave.",
    "Oh fuck her",
    "Why doesn’t she just do it?",
    "Wish Kendrick would unleash on his ass but it's like beating a rabid dog.",
    "Okay this is a much better double down than we have previously seen from her 👏",
    "Or she could just make the donation without having it be a match",
    "25k? Lol REALLY HELPFUL",
    "I just wanna see her pay her nail techs",
    "why does she consistently act her brain isn’t fully developed",
    "ayo her pupils ???",
    "I kinda hate her",
    "That he had the audacity to publish this publicly is a cry for help from the gods.",
    "See if I'm gonna see a celeb double down this is the kind of shit I wanna see ngl",
    "this kinda gagged me. \n\nI mean I was already on her side, but it’s so sassy and “kiss kiss chateau marmont bunny”",
    "Yeah, especially considering some of her other guffaws. This is def a W for Ms. Roan (and struggling artists).",
    "[deleted]",
    "Someone made another post on this! Definitely worth checking out! Highlighted artists: Hemlocke Springs, Devon Again, Sarah Kinsley, Baby Storme.",
    "Lmao. Perfect.",
    "And who honestly aren’t there because of any talent, but get to dictate the lives of the actually talented",
    "[looks like this one for under $10 :)](https://www.beautyofnewyork.com/products/red-by-kiss-hqxx-silky-stylez-x-keyshia-cole-wide-edge-silky-bonnet-super-jumbo?variant=44723731857685&country=US&currency=USD&utm_medium=product_sync&utm_source=google&utm_content=sag_organic&utm_campaign=sag_organic&gad_source=1&gbraid=0AAAAAD8Y-6OhtwK1BqxjgdUYbOH9hSNqK&gclid=Cj0KCQiA-5a9BhCBARIsACwMkJ5YEFvH7tT1Q8XWlIT0v6rXepfarzaye2E8DHHM4pnpxailFJcqaLkaAg7aEALw_wcB)",
    "i need to get my daughter one lol i’m struggling hard as a straight hair all my life mom with a child who has type B curls, the morning bed heads are INSANEEEE!",
    "I would also like to know.",
    "Last year I started advocating for myself and my boundaries within my family and spent several months not talking to my sisters, one of which we still don’t talk. People can’t stand it when you have integrity lol",
    "i don’t understand why people give a fuck if someone is media trained lol. why would i want someone to be fake?",
    "They gonna try though.",
    "She’s problematic. Her management contacted a nail artist wanting multiple sets of very elaborate press on nails for eXpoSuRe instead of actual payment",
    "This is direct, assertive, respectful and self-assured. We love an evolving character 💕\n\n![gif](giphy|AgPt9udT567spxbSHf)",
    "This ain’t messy tho",
    "That place is so insanely misogynistic. I had to mute it because it was getting depressing reading the stuff people say about women. I saw someone call her a hag and anyone who was like, \"yeah that's fucking misogynistic\" was downvoted and told to calm down.",
    "Yup lol I have “good” insurance. I injured my toenail while exercising and saw my dermatologist today, who prescribed a cream. I went to pick it up from my pharmacy and they sort of shifted around nervously telling me it was $1,000. One thousand dollars for a toenail cream. I told them I’ll keep my fucked up toe and left. Our system is so beyond repair, I’d kill to be a carefree teenager again.",
    "Or they're lucky enough to live somewhere with free healthcare 😭.",
    "Yeah is she going to address that orrrrrrr",
    "This is such a reach.",
    "It’s not a good look if she doesn’t",
    "I don’t think artists even get healthcare when they’re with a label because they’re considered contract workers? I could be wrong though.",
    "Yes every American does have to deal with this, but that doesn’t make it right. Healthcare should never be tied to employment, it effectively turns employees into slaves. Do you have any idea how many Americans are working miserable jobs every day because they need their medical insurance? \n\nA huge artist speaking out about a major problem with our system is a big deal, and trying to make it out like “welp so doesn’t everyone else” it’s extremely reductive to the message at hand, which is that healthcare should not be tied to our employment, especially when that employment isn’t guaranteed.",
    "I think she’s saying that they DON’T have even that option. Labels likely don’t offer any kind of healthcare coverage at all to artists whose work they depend on to make all that money. There are working class artists who aren’t being properly compensated for their time or their art because they don’t have health insurance through their employer (the labels). I consider my “benefits package” part of my pay and artists working for labels should have similar benefits from the companies they make money for. \n\nAnd yes, we need universal healthcare. 100%.",
    "Just because you guys normalized it in the USA it doesn't mean it's ethical or should just be accepted. I'm from EU, doesn't matter if I lose a job because the government provides insurance in that case, because they know it's cheaper to do that than to have a population with declining health that isn't being addressed or treated.\n\nIMHO every industry and your government need to be called out and pressured on this, not just the music industry.",
    "It was about how labels should provide health insurance in their contracts to artists and other benefits.",
    "My state provides free healthcare to those who don’t make a lot or don’t work at all. Whole time I’ve been unemployed, I’ve had health care luckily. Wish every state did this.",
    "Yeah I liked the overall message of her speech but I’d argue we should be madder at the US government for preventing its citizens from accessing healthcare and forcing us to rely on insurance to survive. Its horrific that our ability to receive medical care is tied to our ability to work",
    "Exactly her point…",
    "I'm seeing something similar in publishing and there are some new authors calling out publishers for not paying a livable wage. But most writers never were making much money from it. The myth/allure of the \"struggling artist\" exists for a reason. They were living out of their vans, working at bars, writing books/music on the side waiting to make it big. (Before that, they were sponsored by rich people.)\n\nBut it's so much harder to be that kind of artist today. Nobody can afford to go live alone in a cabin for a year to write the next great american novel or self fund their own tour. That's the real issue and it's not an industry problem, that's an overall cost of living problem. \n\nIt's good that young people today are more political and care more about things like universal healthcare and speak up about these things. But there's also a disconnect because with social media today anyone can be famous, and they all expect to be able to make money off their side hustle/ tik toks/ self published book/ garage band. It never worked like that, and it actually can't work like that. Not everyone can be a full-time artist. This isn't a dig on Chappell, but I'm just not sure who she means when she talks about emerging artists and how the industry is supposed to support every up and coming musician who maybe has a future hit.",
    "If i see any of these PR LARPers who are so sage about media training in one of those threads waxing nostalgic for messy feuds and candid comments of the 90s and early aughts I'm reaching through the internet to kick there asses.\n\n It always smells like fake concern trolling because they dislike todays popstars for less palatable reasons to me lol",
    "She’s really not. She has freezing cold takes every time she opens her mouth, also a massive hypocrite and very “woe is me” which is like the opposite of cool",
    "He really doesn't. \n\nAlthough, it would be hilarious if he did indeed match Chapell Roan on that 25k.",
    "Yeah what’s going on with that? I heard about it but no update \n\nEdit: to be clear I’m a Chappell fan and I’m not looking for reasons to be mad. Just genuinely curious if she’ll address it",
    "You mean exposure is not enough payment????? /s",
    "It’s better to pay for fake nails than donate $50k to support struggling new artists? What planet are you on?",
    "It’s weird how obsessed people are with tearing this woman down with the smallest little sins. \n\nIt’s kind of like she has to be a hypocrite in some way so you can feel better about all the ways in which you’re a hypocrite 🤔",
    "The email was from May 2024, not days before her speech",
    "What happened?",
    "Don't worry about the downvotes. Anyone who mentions the nails is on a voting see saw between stans and everyone else.",
    "You got downvoted but this comment is so real lol",
    "If you're on a pop culture subreddit or have some reason for a pop culture subreddit to be in your feed, you're going to hear about what's going on in pop culture.",
    "I went from liking her to not liking her to kinda liking her to loving her. It’s been a ride.",
    "Isn't he a former record executive?",
    "He’s not a journalist, he’s an industry executive.",
    "He’s not a journalist",
    "saw hemlocke springs at a festival last year and she was so good! 🥳♥️",
    "Yep I listen to hemlocke springs because of Chappell, cannot recommend more 👌👌",
    "Baby storme weaponizing her race in disingenuous ways\n\nCalled target racist for not letting her film a music video inside w no permit \n\nLook up “baby storme target” and decide for yourself but iirc she came off awful in that situation and is not somebody to highlight \n\n*did kinda dig city is a graveyard thou",
    "ahh thank you 💜",
    "right…then when she gets media trained it’ll be “she’s so inauthentic and fake”.",
    "It’s just a passive aggressive way of criticizing what someone says. People think it sounds smarter and it excuses them from having to have a defensible critique. \n\nAs a former PR professional, I find it hilarious what people criticize in this vein.",
    "If Renee Rapp talking about how much she hates Buddy is wrong, I don't want her to be right.",
    "One; the person who allegedly reached out was not her management. It was a designer's assistant, so that should be reflected by the designer and their team; not Chappell. \n\nTwo: the email was the scammiest thing I've read and they didn't even spell her name correctly. I'm more inclined to believe it was an attempt to scam free nails.",
    "i’m sure you’ve never done anything in your life that could be considered “problematic” huh",
    "And you’ll bring this up on posts of her for all time now. She asked. Or maybe she didn’t, part of her old management team did. But here is the thing. they ASKED. They didn’t steal designs, or promised to pay and then ghost. Doesn’t hurt to ASK. Sheesh. She literally was unknown a year ago, but go off.",
    "Right? I was like, \"ok this is a bit different from how she usually responds.\" Queen shit either way. ",
    "It's queen though.",
    "It was a compliment.",
    "Holy shit, they just have hate-ons for her.",
    "They’ve been downvoting me like crazy in there. The post about Halsey defending her was even worse.",
    "Are we really still falling for those things? A year old story that is just coming out now that the industry needs to knock her down a peg? Is there anyone as lucky as these record execs with the timing of this controversy?",
    "Was a year ago and she has a new management team",
    "Probably will if it’s brought up in an interview but it’s kinda hard to respond to one shot things like that in a meaningful way.",
    "[deleted]",
    "No one will care if she doesn’t except chronically online people lol",
    "Artists signed to major labels are members of SAG-AFTRA (if they are vocalists like Chappelle) and can get SAG-AFTRA insurance.  It costs $167 per month.  They keep their membership when the are dropped, but have to qualify with earning (27k of covered earnings) which is very difficult if they aren't signed.\n\nThere was just an article in billboard where one of the heads of SAG-AFTRA talked about going up to Chappelle at the Grammys and telling her \"you know, umm... you already had insurance.\"  https://www.billboard.com/pro/chappell-roan-grammy-speech-artist-healthcare-experts-respond/. (you can just turn off javascript to read the article).\n\nIt's very possible she wasn't even aware.  Very obviously the article criticizing her wasn't aware... because he would have said something if he was!",
    "Do they not have something similar to what actors do with sag-aftra?",
    "I think their point is her proposed solution didn't address anything she was talking about. It seemed like something she thoughtlessly threw out cause healthcare is good without thinking about the fact ESC as the primary vehicle for healthcare IS THE ENTIRE FUCKING PROBLEM \n\n\n ",
    "Someone commented that she would have qualified for SAG-AFTRA health insurance for $167/mo. ",
    "What state is this? I feel like socialized Healthcare would work on a state level more than a country level.",
    "This is literally what the last 4.5 years of conversation have been. Chappell seems well intentioned but really ignorant. It misses the direction we're moving and also it doesn't even address the problems she was talking about.\n\n\nI wouldn't care as much (I genuinely don't expect artists to be super into policy details) if it wasn't for how many young people clearly think she's more informed than she is. She has the spirit but there's a lot of refinement needed and it's troubling to me if people are genuinely seeing her as an influential and important voice in these convos \n\n\nI liked lady Gaga a lot but I did not see Gaga as a political sage. ",
    "it’s definitely concern trolling lol and even though I say that I also find myself falling into this trap sometimes. I don’t even know why????! I guess some attempt to justify a dislike or something?  It’s crazy how little I understand my own brain 😩",
    "How is she a hypocrite?",
    "Right I guess my point is he never cares and so\nDid exactly what someone who doesn’t care would do-  nothing. Her speech was great, but if she cares so much I expect to see that Same effort she’s talking about",
    "i think they mean it’s better for her to practice what she preaches before she gets “called out” (this dude is an evil asshole so i’m with her on this one) by someone. because if she can pay $25k for struggling new artists, she could have easily paid for the nails she and her team were trying to secure from the nail artist, instead of trying to obtain them for free.",
    "Planet capitalism of course /s",
    "Well I could easily flip that around and say it's weird how stans love her because she fights for the underdog and calls out scummy behavior, but whenever her behavior is less than stellar, it's \"LEAVE HER ALONE, WHY ARE YOU SO OBSESSED, PEOPLE MAKE MISTAKES!!\", *refusing* to hold her to the same standard.",
    "Okay lol still shitty to ask for free nails? My point stands.",
    "A nail artist posted emails from one of Chappell's people from last year asking for a custom set to be made in two days (insane) and offering exposure pay in return. That person is still on her team, and her fans' justification has been \"the email isn't real, and even if it is, Chappell probably doesn't know about it so there's no problem\", more or less.",
    "Omg Churlish hi!!!! 🥰 long time no speak! And noted okay lol I didn’t think what I was posting was so controversial, but good to know the internet is so divided. I’m also a stan 😅 but I think artists deserve pay regardless of their status or craft so I’m going to die on this hill",
    "Chappell bumped her a few months ago too and hemlocke springs is stilllllll in my regular rotation…… she’s ur favourite artist’s favourite artist’s favourite artist",
    "Every pop girl is allowed to be a little crazy tho, it’s how the art gets made",
    "Haven’t seen this! Good info to look into thank you for the context 🙏",
    "In terms of scandals, this doesn’t bother me at all LOL still obnoxious though",
    "While I agree it’s not the end of the world, the email was real - the women who initially posted followed up with a screen recordings showing the email addresses of the people who sent it to her were the same emails addresses that still currently on the designer and design assistants public business instagram accts.",
    "Sure I did, but I’m not wealthy and wanting free hand drawn nails. She is rich and art needs to be paid for too, like hers. Fantastic singer but bad management that makes her look entitled",
    "It’s also literally how every single other thing in that industry gets done, the fact that that particular artist didn’t want to engage doesn’t make it ~EViL~",
    "Messy is often not a compliment and \"we love a\" is usually backhanded so that's why people didn't see it that way.",
    "Oh tea. See I read that it was her new management team bc the person who reached out for the nails was cited in the Grammys",
    "[deleted]",
    "Girl calm down you don’t double reply on Reddit demanding an answer faster. Weird behavior",
    "That’s okay I guess? Just a bit hypocritical when she talks about being fair to artists when her team doesn’t even wanna pay another artist for her nails but her crazy stans don’t care lol",
    "She said that she lost health insurance after being dropped by her record label though, during Covid.  So  what you're saying about SAG-AFTRA likely not covering her due to the min earnings qualifier is likely quite relevant here:\n\n*\"I got signed so young—I got signed as a minor. When I got dropped, I had zero job experience under my belt, and like most people, I had… quite a difficult time finding a job in the pandemic and [could not] afford insurance. It was devastating to feel so committed to my art and feel so betrayed by the system and dehumanized. If my label had prioritized it, I could have been provided care for a company I was giving everything to. Record labels need to treat their artists as valuable employees with a livable wage and health insurance and protection.”*",
    "Yes, but only if she joined SAG-AFTRA, which requires an initiation fee of $3000, plus $232 in base fees, plus 1.5% of earnings (and then plus the $187/mo). That’s out of reach for a lot of struggling artists who would rather take their chances on not needing medical care.\n\nhttps://www.sagaftra.org/membership-benefits/steps-join",
    "Also she just turned 26 last year so she could have been on her parents’ insurance while between labels. She was eligible until she turned 26. Admittedly that isn’t a choice for older artists but it would have been for her",
    "Omg hahahaha",
    "Based on another comment, yes they do",
    "She also mentioned “livable wages” and it’s important to pay attention how the narrative has dropped that part completely and pivoted to ways she technically coulda maybe had health insurance through union agreements with enrollment fees and subsidiary buy in \n\nThe main focus should be : labor deserves fair wages and protections at the expense of executive profits , not “ah well SAG-AFTRA could have, technically…”",
    "It's wild that even though she's one of the only mainstream artists talking about this stuff that publicly yet it's still not good enough for some. Sure she could have proposed ways to fix things, but it was a GRAMMYS speech.",
    "Also, and to be clear I LOVE her music and really am a fan, but what I’m confused about is it’s a good point that no one should pay out of pocket for insurance but if for now we do there’s a lot of people who several hundred a month is a lot more to them than a celebrity. Unless I’m missing something",
    "Yes, but only if she joined SAG-AFTRA, which requires an initiation fee of $3000, plus $232 in base fees, plus 1.5% of earnings (and then plus the $187/mo). That’s out of reach for a lot of struggling artists who would rather take their chances on not needing medical care.\n\nhttps://www.sagaftra.org/membership-benefits/steps-join",
    "I was actually just discussing with my husband and wondering if musicians have access to a union like SAG. This answers that. Interesting. Thank you.\n\nI will say, that for some people $167/month might as well be a million. As a young, struggling artist she may have had to choose between food/shelter and health insurance. I know that growing up my mom had to make some tough choices like that just to keep the lights on as a struggling single mother. \n\nAll that being said, I don’t know Chappell’s personal story or exactly what choices she faced but I know she took an opportunity to speak up for others and bring attention to an issue I hadn’t really thought about before. I appreciate that and I hope she chooses to donate whether this record exec does or not.",
    "This is the issue every time she talks about this kind of thing. I love her music, and I think her heart is in the right place (most of the time) but she (and a lot of celebrities honestly) just need to be so careful that they know what they’re talking about. ",
    "Cancels shows in Europe with 2 days warning, tells fans she doesn’t “owe them anything”. Cries online about the controversy that creates and then turns around and tells fans she loves them. \n\nSupports LGBTQ but then goes off on some bullshit rant about Kamala and the Dems and the idiotic “both sides” argument. \n\nSays artists should receive healthcare in her Grammy speech. Which now looks like she just has a personal grievance because doesn’t actually care about the issue, she just wants to be petty. She doesn’t WANT her label to give her healthcare, because then she doesn’t technically own her music because she’d be an employee of a company. Just like the rest of us. Nobody on her team, the people supporting her, are getting healthcare btw. \n\nAsks for free shit from people (nail techs) supporting musicians. Oh okay, so you want people to be supported and given healthcare but you don’t want to support people supporting you?? \n\nShe literally speed ran her way to rich elite status, and gives off the vibe that we are all peasants below her and should listen to whatever she says as gospel",
    "I think this is more challenging the complacency of the records/music industry executives rather than anything else.\n\nThe label executive does not have a point. You can't hide behind \"I'm already a villain/a-hole, so morals don't mean anything to me\" \n\nAlthough, I could see an \"Oh? I'll go do that. And I'm also going to donate to a nail company to mock you.\"",
    "And to be clear she is still working with the person who asked for to pay in exposure from her team.  This post was this last weekend at the Grammys.\n\nhttps://preview.redd.it/jithm4u1aqhe1.jpeg?width=828&format=pjpg&auto=webp&s=9d9339bdd72d2cfe676e0575fa14fa3a18cdbf46",
    "That's what I was getting at, yes. It's all well and good to make hypothetical offers of giving away money, but it's not great when the nail incident recently came out where her team wanted a custom set in two days and offered exposure pay for very real (last minute) work.",
    "But she wasn’t even the one who asked for free nails? It was supposedly her manager (or whoever Alexandria is), although the email looked fake as hell. We don’t even know that chappell is aware of that whole exchange. And plus, she didn’t get massively popular until AFTER that situation went down (it was May 2024), so I def believe that she didn’t have an extra $25k to throw around back then like she does now.",
    "Also pay for art instead of using AI",
    "We’re all about to be asking for free nails after President Shitpants destroys the middle class 🙃",
    "Ah, ok. Thank you for that!",
    "![gif](giphy|fX5cZemSfX1cMZYuUJ)",
    "Based on personal experience and what I've seen from others; I'm still hesitant to say the email was real. In this day and age, it's really easy to spoof an email address and make it seem legit.\n\nI think it was last year that some small business on TikTok was super excited about some huge Influencer reaching out to get jewelry made for an award show; only for the Influencer to comment on the video and say that they had never reached out and didn't know what the person was talking about.\n\nTurned out, it was a scammer who had a phishing email. It looked legit and was identical to the Influencer's actual email. But it wasn't actually them.\n\nAnd the comments were full of other businesses sharing their own experiences— people claiming they were associated with a celebrity/model/influencer asking for free things and promising promo that never came.",
    "Where did we get the notion that Chappell is rich? She went viral not even a year ago after a decade of not having any recognition. All of her money is probably going straight to her label & concerts; there’s not even the slightest chance she’s rich",
    "She has a new management team.",
    "okay? i just think we need to retire the label “problematic” because at this point it barely means shit. okay, she’s problematic. who the fuck isn’t? literally everyone in the world has done things that aren’t morally ideal. what exactly are we meant to do with that information? boycott her?",
    "This was from last spring. She was on the rise but definitely not rich.",
    "[deleted]",
    "I don’t really follow her social media. Only follow a fan account that posts funny videos she’s made on the past. I find it best to not be invested in any artist’s personal lives because I end up liking them less. With Djs, they’re pretentious and creepy. With pop stars, they’re annoying theatre kids. I find it’s best to separate the art from the artist",
    "I don’t stan anyone I just find it hilarious how quickly people are to tear a woman down who calls out exploitative practices. Refusing benefits and worker rights to thousands of people is not the same as trying to get free nails but yall need her to be a hypocrite so you can buy your SHEIN hauls without feeling bad about it I guess.",
    "Why do you think a year old story from her old management team - that misspells her name - is showing up now that she has spoken about something that pisses off executives? Some of you are so easy to manipulate.",
    "Yeah... I think that's what happened.  In fact... I wonder if the reason she's doing background vocals on Sour was because Dan Nigro was trying to get her covered employment so she could qualify for insurance.\n\nThe real issue is that she got dropped in 2020.  This both was horrible for her... it was also a really really stupid decision!  Atlantic lost a ton of money on her.  Island has made a fortune!  This is the year of breakout artists.  And yet... all these artists were \"in development' for a really long time.  Charli XCX was signed (to asylum) in 2010... she had it the easiest because she has written over the years a number of unbelievably big hits for other artists (I love it, and Senorita).  Sabrina Carpenter was first signed (to Hollywood Records) in 2015. Chappelle was signed to atlantic in 2015.  Gracie Abrams was signed in either late 2018 or early 2019.  So all of these artists have been working for years for record labels, making very little money (Charli did the best), and suddenly 10 years later they break out.  Both Sabrina and Chappelle have been on two different labels!  If this is how long it takes to break out, this isn't sustainable.",
    "i'm not sure that's true.  Just looking at the SAG-AFTRA benefits page, it seems that artists on label rosters automatically qualify.  I do know that labels pay a ton of money to the musicians unions in Union Exploitation Charges (several points on every record), plus a fee for every new artist on their roster.  These charges sometimes come up in record deals (artists on distro deals are often required to pay them instead of the labels)\n\nThe deal the labels have with the unions is quite different than the deal for motion pictures...",
    "Depending on what kind of insurance her parents even have and if they could afford to cover her as an add on. Many of my friends parents dropped them early to save money and said it was on them to find a job with insurance.",
    "I work as a professional musician and honestly, music is a bit of a weird one for this. You get signed as a contractor, which gives you the ability to maintain some ownership over your music, and benefit more significantly if you succeed. \n\nIf musicians become employees, they will then have the same rights to their IP as an Apple engineer would have over the apps they built while they were working at Apple (none). \n\nAdditionally, the vast majority of musicians who sign record contracts are not going to be profitable investments. It’s very much a shotgun game where you go broad and hope to hit with one or two. So if labels had to start paying all of their artists $40k/ year or whatever, they would basically have to stop signing people (my first advance was something like 1000£).\n\nIf you got dropped from a contract where you were paid a small advance, you’re not going to get signed to one where you have to be paid many times more for a longer period of time, with the funds not being tied to any performance metrics. \n\nBasically, a pretty huge amount of want-to-be entertainers don’t really provide any real value to society, so treating them like factory workers, whose wage is tied to their real output doesn’t really make sense.",
    "Yeah I mean my continuous issue with Chappell is while I probably agree with 90% of her politics, she makes a lot of poorly phrased political statements. People will not soundbite your intentions, plan accordingly (that's why most artists keep it vague and to rehearsed lines) \n\n\nAnd I do care a LOT about this one. ESC is not the way, it's literally the problem. Don't throw ESC out there if you do not substantially and meaningfully ESC. And I cannot think of an industry where that makes less sense. \n\n\nYour statement is 1000x better. She should have said that lol \n\n\nAnd I really wouldn't care that much if she wasn't continually propped up as having better more concise speech than she does. People say she is 100% correct and it's like.....well her heart is in the right place. They say she doesn't miss and it's like.....she's always in the neighborhood. They say she's a socialist queen.....this is literally the exact opposite of socialism, this is actually a distinctly private market capitalist solution. \n\n\nI just need people to stop getting so much of their policy rhetoric from a pop star. If this is meaningfully shaping the conversation, then we're fucked. I don't need musicians to be super into the details. But if the majority of online progressives don't see the incoherence with pushing for ESC in 2025 as a respond to the large scale unemployment of the pandemic..... we're fucking doomed as a nation. ",
    "That is very true, but the conversations surrounding the healthcare and health insurance industries need to continue to happen no matter who is talking about it, we need to keep talking about it because talking becomes actions. This is a right we must fight for so any and every conversation about it needs to happen and celebrities talking about it is important because the media will actually report on it, they aren’t going to report on all the people complaining online about it. \n\nI think it’s also important to note that Chappell may be super famous, a few years ago, she wasn’t… so she probably doesn’t have as much money as people thinks she does. Sure she makes a lot put she also has to pay a lot of people out of that AND cover her own healthcare. \n\nAlso, if celebrities are complaining about healthcare then you know it’s getting to be a huge issue. \n\nEither way all these conversations about it are what eventually leads to change.. so the criticism is a bit counterproductive.",
    "Someone just listed the SAG entrance stuff and honestly it's better than what a lot of people deal with. Especially since union dues and health insurance are tax deductible. I'm willing to bet 2020 Chappell was making more than my mom and apparently had a way better insurance offer than my mom could get. \n\n\n\n\nIdk I do think her overall story is a good one. Ife gotten emotional at it before....but the way she's politicizing it feels out of touch and sour. Like this *is* fairly common stuff, and to frame this as anything other than a call to better collective bargaining seems disconnected. You think your employer is just gonna stip being a dick if you ask nicely? Pay your union dues and get organizing like the rest of us ma'am",
    "I didn’t even think of initiation fees and dues and such. Entirely out of reach for young struggling artists.",
    "How much was her signing deal for? Because it's really hard for me to feel bad someone chose not to pay union dues and is upset they don't get the benefits of unionization.\n\n\n3000 is not an unusual deductible amount, and that is presumably a one time fee rather than annual..\n\n\nIt seems like we've just circles back to her maybe not understanding the landscape for the fact ESC is  not only not the solutions, it's like 2/3 of the problem ",
    "There are actually two unions.  Vocalists are represented by SAG-AFTRA, instrumentalists by American Federation of Musicians (AFM).  Some artists are members of both.  SAG-AFTRA has better benefits.  Artists signed to major labels automatically become eligible for benefits.  This is not true for artists on indie labels.",
    "She's completely correct about Kamala Harris and the rest of the Dems, I don't think she made an idiotic argument at all.  You honestly just seem very mad.",
    "I don’t think it is a good point, and it makes him look extra slimy, but these scum have never been in art to promote it with honesty or take care of artists.\n   As her star continues to rise and her platform\nDoes, she can continue to use her platform her tons of ways that aren’t financial- I just wouldn’t be surprised that a scumbag used this excuse.\n Again his point is “I have always and will always be trash” it doesn’t make it right, I just don’t think we can solely rely on these folks to change",
    "We don’t know that she wasn’t aware, either. What we do know is that she is *heavily* involved in curating all her looks. She works with her team rather than letting them work for her. So it’s a very real possibility that she knew what was going on as well.",
    "I think people are saying that if you are demanding an entire industry changes the way it compensates artists, it looks bad if your small team is trying to get completely free labor out of people who are trying to just get by.",
    "Could I trouble you for an egg in this troubling time? I'll repay you with exposure to my 3 Bluesky followers.",
    "Ok, she literally provided proof but sure, rather than look at that just talk about your anecdotal experiences  instead lol",
    "This is what I'm wondering.  After paying all of her team , I wonder what she's actually worth 🤔",
    "The comment that responded to you telling you that it wasn't messy has more upvotes and now you are being backhanded again which makes me think your comment was actually backhanded. ",
    "You guys are quick to defend her EVERY move which is weird. I can be happy that she addressed healthcare for artists and support that while at the same time question why she is asking another artist for free work. Every artist should be treated fairly and should be paid for their work. At the end of the day, it’s about that. People are quick to yell “you’re tearing a woman down” without understanding that it’s a valid criticism of another human being. Doesn’t mean she’s a bad person but this is for sure easy to address",
    "Okay conspiracy theorist lol. And the person who sent the email is still on her team. The nail artist is obviously responding to her Grammy speech. It’s cool that CR advocates for healthcare and treating artists fairly but she should also do the same. Obviously it’s possible she wasn’t aware of it but anything her team does is a reflection of her and it would’ve been easy to address",
    "[deleted]",
    "Qualifying is not the same as joining. Qualifying means you’re eligible to join, but you then still need to actually join.\n\nPerhaps you can negotiate with your label to include the fees in your contract? But I doubt a newly signed artist would have that kind of bargaining power.",
    "Also her parents live in Missouri.  She did move back with them for a while",
    "Yeah that happened to me. My parents dropped me at 19 because my dad’s job refused to cover us at all so my dad would have had to pay out of pocket.",
    "Her mom is a veterinarian and her dad is an RN so I would imagine they could handle the cost tbh",
    "I think it's well intentioned but I think people need to recognize the details are everything. Just say \"healthcare is a human right\" or something vague about how keeping people locked out of healthcare is unacceptable. \n\n\nESC works for middle to high earners really well. The higher up the income ladder you go, the better deal it becomes. The power you go, the shittier it gets. Right now theres this huge Medicaid gap where a lot of people are not able to get Medicaid, but cannot get an actual real fucking plan they can use, because the costs are astronomical. \n\n\nTHAT is the core problem. Insurance works really good for rich people, we have a safety net for absolutely poverty, and we are fucking over the lower class workers. That precise segment is who the ESC primarily fails. \n\n\nESC isnt the solutions. It's literally like 2/3 of the problem.\n\n\nAnd it espeically showed what a bad system is during the pandemic when we saw people getting laid off en masse and realized \"oh wow it's also just really stupid to tie these things together for other reasons as well\". \n\n\nIt wouldn't help artist like Chappell. They are getting fucked over. They do lack basic security. But ESC is ...it's nothing in practice. It's cost inaccessible, it would increase the rate at which they get dropped, and they all still would have found themselves with no money and no prospects and no insurance in 2020. That's the problem. Is we keep doubling down on ESC like you can bootstrap your way out of insurability and it's just not true. Employers will never do it willingly. It makes the employees too expensive to offer good insurance, cause they're also getting shafted by insurance. \n\n\nIt's a really complex tangled web of fucked upness and it's really important to emphasize over and over and over that ESC does not actually meaningfully help poor people. Most cannot actually see their doctor if they're insured at all. A huge chunk who are technically offered go without so they can buy luxuries like food and a car which gets them to their shitty job ",
    "you'd be surprised.  Chapelle was 5 years into her record contract in 2020...  she had sold essentially zero music (one, not popular ep).  She probably saw precisely zero income from Atlantic, after her advance, and despite rumors that they spend their advance on fancy cars and champaign, most artists do actually use their advance to pay their recording costs.",
    "Thank you. I’m glad to have learned something new today.",
    "she’s completely correct and ur completely correct and this person is very mad 🫡 keep iconing in these comments like they love to hate her for not endorsing kamala due to her waffling on a genocide. the queer community stands with other marginalized communities historically and today, and as a lesbian myself she represents our community amazingly 🍉🏳️‍🌈",
    "Trump is about to make being transgender illegal LMAO. He just banned them from women’s sports. He signed an executive order that said “women are biologically female, men are biologically male”. Effectively getting rid of any protections for trans people. \n\nThe dems and Kamala support trans and gay rights and have for a while now. How can you support trans and gay rights while also demonizing those that want to protect you??\n\nJust shows you birds of a feather flock together. She’s a hypocrite and you are too LOL",
    "If the email was even real.",
    "I’m curious to see if Chappell will comment on Nailgate at all 👀",
    "My chickens died of bird flu 🥲",
    "Okay, did you miss the part how that's not exactly proof? The girl posted the screen-recording of Taylor Swift liking the Joe Alwyn post— it was proven to be faked.\n\nI don't doubt she got the email. My hesitation is that it was actually from the assistant and not someone pretending to be her to scam free stuff. Phishing scams are the most common scam. God forbid I withhold judgement until there's something that's actually definitive.",
    "Certainly not much that’s for sure 😭",
    "I'm just wondering, how do you know that person is still on her team?  Because that email is from last years grammys and that management team was completely fired.",
    "very little.  And they have huge expenses...  a prospective pop star can't you know... decide to get a cheap haircut.",
    "That really depends. I know a few vets who have told me that people in the field don’t make nearly as much money as you think, and as someone who works I health care, you would shocked by how shitty and expensive the insurance can be.",
    "She should have used the $3000 to join the union is my point. That should literally be the first thing you do. Unsigned artists hustle for studio time. I known this for a fact. And they'd jump for the chance to join a professional union. \n\n\nIt just really seems like we keep circling around the same \"universal healthcare because ESC is stupid\". Where if you insist on an industry specific talking point, it's higher pay and the union. Not ESC. \n\n\nShe wouldn't have been able to afford ESC if she can't afford union dues. Again, the union insurance is a lot better than a lot of ESC plans. \n\n\nIf she's gonna keep delving into nuanced political issues, she should be ready for nuanced political pushback analysis. Otherwise just say \"fuck the industry, healthcare is a human right\". I am entirely fine with artists keeping it vague. ",
    "Kamala Harris be like \"I'd do anything to be president: except stop bombing Palestinians\"",
    "Yes, and the Democrats constantly talk about how badly they want to work with Republicans. They do not do a good job fighting for rights, and they haven't.  Part of fighting for minority rights would be doing something about Donald Trump and the other fascists, they had 4 whole years of justice department control and they didn't.  They didn't expand voting rights, they allowed Gaza to be bombed to nothing.  Why are we in here pretending like they don't set the tables for the fascists to eat at?",
    "Email looked very real. Not sure if someone with that much to lose (her business) would lie about a celebrity like Chappell with fans who would ignore any faults to attack someone calling out their favorite artist.",
    "Rip\n\nSomething something birds aren't real?",
    "The email wasn’t sent from her management team. The email was sent by her stylists assistant who CR still works with",
    "You don't get those benefits unless you're working though, and by \"working\" they mean making money.   Someone further upthread said you had to make 27k yearly income as a recording artist to qualify for union insurance.\n\nI have a friend working in film, not quite the same, but similar.  You don't just \"get\" benefits - you have to work your ass off to make hours to qualify for the union, and if something happens to interrupt those hours/earnings qualifying you.... you get dropped.  So the union support is still mostly predicated on the stability of your career, it's not a safety net in the way you're thinking for many smaller artists.\n\nYou don't know if she paid into the union or not either, I'm guessing.\n\nIt's just frustrating when artists talk about problems in the art industry everyone is ready to come out and share that things are harder outside of the art world without acknowledging that all of this works in a very different way.  And tbh it ends up sounding like \"artists should just get real jobs\" a lot of the time.\n\nThere are ways to improve this - older seasoned artists with high income could pay more in dues, record labels could be required to pay into unions so artists could have more stable coverage, and in that way once you qualify you wouldn't be dropped as a newer or lower income artist when tines get rough.",
    "Dems aren’t perfect and yes they are in bed with corporate interests just like the republicans. But there is a time and place to have that discussion. Not 1 month before a major presidential election. \n\nIt comes off as HYPOCRITICAL when you demonize one party for not doing something 100% the way you want when overall they support you, when the other party is literally openly saying they are going to remove your rights.",
    "Why wouldn’t she just ask to be paid for them? She had a choice and she said no, which is fine, and everybody moved on. It doesn’t seem weird to you that she would wait until 8 months later to come out and post the story online? For what, exposure?",
    "The chickens are just props for the liberal media!!!",
    "That's not what it says at all.\n\nIt literally just says it's sent by someone claiming (without proof) they're part of her team.\n\nYou're just making things up weirdly.",
    "I didn't say that. I said if she's gonna make a VERY specific demand which doubles down on the way healthcare is broke while public policy advocates are pushing in the exact opposite direction, then kind of need a coherent explanation\n\n\nDoes she think if she's bringing in no money they're gonna pay $500/month in her behalf? If she wants to be an employee, they're gonna fire her even sooner. That's just the reality of labor..if you're not bringing in money, if you're red in the books, they cut you. That IS every industry including the \"real\" jobs. I'm not putting art as lesser than real jobs. I'm questioning if Chappell has actually meaningfully thought about what she just asked for. Because it doesn't make sense to me\n\n\n\n\nIt seems like they just need higher pay. Probably like a union version of COBRA. I don't understand the thought process of ESC would have helped her \n\n\nIf you can't afford the union dues, you can't afford ESC deductibles. If you arent bringing in enough to qualify for the union .....you're not making enough to qualify for your label paying your insurance premiums. It just seems like *at best* a lateral move, probably a net negative. And wasn't what she should have asked for. \n\n\n(Which was more money and universal healthcare or like expanded Medicaid, getting the union to lower the threshold so there isn't a gap between Medicaid and insurance, etc)\n\n\n\n\nI just don't think artists should ask for very specific things unless they actually have thought through that specific thing. And considering how left she is and how exploitative she understands the industry is and the fact she was presumably in poverty ....I'm not understanding how she arrived as ESC\n\n\nThe entire problem is that healthcare tired to labor doesn't make sense, and Medicaid limits are way too fucking low so people cannot reasonably buy in. So there's a huge gap. It's *not* unique to her industry, and I think ESC seems really poor suited to the industry *because* they're not typical employees ",
    "I don't think you even know what hypocritical means",
    "Well, she simply shouldn’t have had to ask to be paid for her work. It’s a given. And no, it doesn’t surprise me. Again, Chappell’s fans can be ravenous. So I can understand attempting to move on and then seeing the person who essentially tried to obtain stuff from you for free, during the rise of her career, speaking up about paying artists would be triggering enough to make them come forward. Cause and effect.",
    "listen, i agree that we don't know whether the email is real or whether chappell even knew about it. \n\nthat being said. no person should \\*ask\\* to be paid for the work they do. they provide a service, the people who receive that service should automatically be ready to pay for it.",
    "it was proven via screen recording the email was real. ppl saying it was only brought up after the grammys for clout are deliberately ignoring the context. the nail tech only came forward after chappell went on stage and whined about how her label wasn’t compensating her and other artists fairly. its extremely hypocritical for her and her fans to rally behind compensation for artists but then ignore and put down smaller artists when they ask for compensation from her.",
    "lol what!? Okay lol. There’s actual video proof of it. Y’all are just weird stans",
    "She's addressing a completely different kind of work than employment where you work for someone and are their outright employee.\n\nThe arts and artists really function on very different forms of employment and reimbursement and it's very difficult to compare if you haven't worked in that area, and that's why \"just get real employment\" = ends up sounding like just saying artists should just, like, not work in arts if they want better conditions.\n\nI don't just mean music, like theatre, fine arts, etc, all use employment and funding models that tend to stray from the \"x company employs me and I do what they say in exchange for y\", which makes complete sense if you think about the type of work done.  \n\nSaying just get a job that's a \"normal\" job - okay, but artists deserve to be able to ask for better working conditions as well, even if you don't understand how how that kind of work is often done or don't value it.  I've been an independent artist and I've been in STEM and it's foolish to think that arts don't matter and artists should just get \"real\" jobs if they want stability, art is essential to a healthy society.  And no, the US is not healthy right now, and I will always disagree with people who think asking for more and better is the problem.",
    "it was proven via screen recording the email was real. its also funny bc with how terminally online chappell is shes more than likely seen this and is choosing to ignore it so she can stay on her high horse.",
    "Welcome to r/popculturechat! ☺️\n\nAs a proud BIPOC, LGBTQ+ & woman-dominated space, this sub is for [civil discussion only.](https://www.reddit.com/r/popculturechat/wiki/index/rules/civil-discussion-only/) If you don't know where to begin, start by participating in [our Sip & Spill Daily Discussion Threads!](https://www.reddit.com/r/popculturechat/search/?q=Sip%20%26%20Spill%20Discussion&restrict_sr=1&sr_nsfw=&include_over_18=1&sort=new)\n\n###No bullies, no bigotry. &#9994;&#127999;&#9994;&#127998;&#9994;&#127997;&#9994;&#127996;&#9994;&#127995;&#127987;&#65039;&#8205;&#127752;&#127987;&#65039;&#8205;&#9895;&#65039;\n\nPlease [read & respect our rules](https://www.reddit.com/r/popculturechat/wiki/index/rules/), [abide by Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette), and [check out our wiki](https://www.reddit.com/r/popculturechat/wiki/index/)! For any questions, [our modmail](https://www.reddit.com/message/compose?to=%2Fr%2Fpopculturechat) is always open.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/popculturechat) if you have any questions or concerns.*",
    "as expected, the man behind the [article](https://www.hollywoodreporter.com/news/music-news/chappell-roan-grammys-speech-misguided-1236128051/) is a former music executive of major labels like Atlantic Records",
    "I was scrolling too fast and thought the headline read \"Halsey calls out Paul Hollywood..\" and had to come and do a double take to see what the fucking tea is.",
    "https://i.redd.it/qbw90zglzkhe1.gif",
    "Just because I haven't seen it mentioned here and not everyone may know, Halsey is chronically ill and also a leukemia survivor. I don't know her finances or insurance situation obviously, but that kind of healthcare situation can make even a rich person worry about money on top of like, trying not to die.",
    "If Halsey has 0 stans Im dead.\n\nLove when women stand up for women.",
    "Theyll never make me hate you halsey",
    "I didn’t and won’t read the article so I can’t comment on that. But man, I loved Chappell’s speech. I’ve seen criticism that she should’ve spoken about healthcare for all, not just in the music industry. But I don’t think that would have been as effective. \n\nAs it was, she addressed a problem within her industry to a room full of people who have the power to change it.",
    "his whole argument in the article was so stupid and tone deaf. he was basically like “that’s the nature and structure of the business, get over it” and it’s like yeah that’s the whole problem",
    "I’m always going to be a Halsey stan, I’m glad she’s not toeing the line on this. Hope the article only has the effect of putting more people in Chappell’s side. Bootlicker indeed.",
    "There's a channel on YouTube, Daniel Wall. He does long sit-down interviews with song writers and producers. Pretty much all of the writers and producers can speak to this. They've all struggled early in their careers. Being signed doesn't mean anything. You get a space to live, allowance, and maybe funds for your development. They don't make much on sales and streams. Publishing rights is their big ticket.",
    "THEY COULD NEVER MAKE ME HATE HALSEY",
    "yeah, the THR article combined with multiple exposé’s on chapell suddenly coming out today,  read as a deeply transparent and cloying propaganda campaign.  Apparently it is SO out of bounds for anyone to demand execs (who have multi million dollar packages) give health care to their workers, that it necessitates a smear campaign in response. ",
    "Good on Halsey. That article is literally just a poorly written hit piece. \n\n>Have you ever tried to get your expenses reimbursed from a major label? Yet somehow you want them in charge of health-care claims?\n\nDoes the author even understand how health care works in the US? Employers aren’t in charge of health care claims for their employees, they just cover part of the insurance premiums. \n\nThere are pros and cons for artists being contractors verses employees of a record label. And that’s actually an interesting conversation to have. This article brought up none of those points though. It was literally just nonsense.",
    "Nice to see some solidarity especially in the face of a former exec trying to undermine any sense of solidarity between artists. That article pissed me right off!",
    "![gif](giphy|xTiN0ye8BRaXVcPMmA)",
    "Halsey will ALWAYS stand on business!!!!",
    "Boot licking behavior!! She's so right",
    "I love her so much 🩷",
    "![gif](giphy|kPHBjnWpTtuDf3LC50)",
    "If anything, this article proves Chappell’s point of contention and frustration with the music industry perfectly lol",
    "Always giving me more reasons to stan",
    "The Hollywood Reporter also posted today on Instagram about a movie that Ben Affleck was directing. It read like AI got drunk and wrote it. I'm not sure what they are doing over there.",
    "Halsey always knows the right thing to say",
    "Chappell is kinda Halsey’s little sis in this regard so it checks out that Halsey is speaking up",
    "[deleted]",
    "What is it with this old boys club?  They hate all LGBTQ people, they feel threatened by their existence.  What if her speech makes a difference (and it only takes ONE record company to do it)offers healthcare to its artists?  Then you have someone who was vulnerable enough to stand up in person to a live audience and pose the question.  That means she made the industry think and act on it and we just can’t have some talented lesbian singer do that…. Fuck that guy!",
    "Damn! Halsey took his fucking lunch money, lmao.",
    "YEAH QUEEN!",
    "Halsey having bootlicker in her vocabulary 😍😍",
    "Halsey rarely has a bad take and her last album was great imo",
    "Good. I read that article and immediately caught onto a bitter undercurrent that had me running to check the source. The author's bias is plain as day and underlines Chappell's point: too many musical artists -- like many employees in Hollywood -- get no medical benefits or protection. They're reaped for their profits by the studios and agents, but get practically no protection unless they make it big. Yet another reason the US needs universal healthcare. One day.",
    "His whole article is embarrassing and just shows his hand: he realized he had to compromise everything human to stay in the game. It’s clear he thinks making a billion dollars is peak success. \n\nETA: there are very specific people who will try to convince you that words don’t matter. ",
    "Beautiful. It was a garbage article, and Chappell gave a beautiful speech.",
    "THR is absolute garbage and I've blocked them on most SNS because I can't stand the stuff they put out. absolute hacks.",
    "I suggest going to the putrid guest columnists LinkedIn Page and laughing at him like I did! That's the forum to REALLY get under their skin these days!",
    "Halsey is no woman, she's a god.",
    "“Boot licking behavior” 💀\n\nAs if I couldn’t love her more",
    "Love Halsey!",
    "Good for her.",
    "First of all, what an eloquent fucking takedown. She's amazing for this. \n\n\nSecond, I keep saying it, but I love seeing artists stick up for each other. We really are stronger together, and I'm glad artists like Chappell and Halsey are doing just that. \n\n\nThird, Badlands was my shit when I was a teenager. I wore out my headphones listening to it. After all these years, Halsey's still kicking ass. Love to see it. ",
    "Remember when streaming was touted as *the* way for indie artists to finally break free from record lablels, but 99.9999% of the artists you know about signed their rights away anyhow?\n\n  \nPepperidge Farm remembers.",
    "HR is trashy these days! Posting negative articles about Meghan and Harry and behaving like a tabloid. Super weird.",
    "Jeff’s a fuckwad. 🤮",
    "Ok well worded clapback!!",
    "\"No one wants to work any more \"🙄🙄🙄\n\nEdit - I'm making fun of the record exec. Halsey and Chappell are awesome.",
    "If you want to profit off of someone else's body, basic living needs should be met.\n\nI mean, one either agrees *everyone* should have basic needs met or you don't agree with it. \n\nIt's not an industry issue and the people making the most money in the industry, literally winning awards, complaining about such a thing  (when their needs were met because they're a privileged middle-class American) should be criticized. \n\n🤷🏼‍♀️🤷🏼‍♀️",
    "I adore Halsey and this just cements it",
    "What a snowflake this guy is!",
    "I wish these people would focus on something affecting regular people instead of things that only affect them and serve to make them feel like victims.",
    "Chappell has some very catchy songs but it wouldn’t surprise me if she’s a truly horrible person behind the scenes. There’s no smoke without fire and there’s been too many stories about her at this point. \n\nIt’s like she’s went the other way and used her singing career as a launchpad into becoming instagram famous before burning out her career in a flash.",
    "Reporter was right. i really DONT care what halsey has to say.",
    "Lol at the irony of her typing out a seething tantrum while calling out someone else's seething tantrum.\n\nLol reddit, always downvoting the truth because it hurts\n\n\nIsn't chappelle the lady talking about paying people a deserved wage but tried to get free nails for \"exposure\"?",
    "If Chappell things that there's a way to run a label according to her values, I bet there will be literally thousands of people waiting to get on her guaranteed payroll. If not, it's just performative like always.",
    "Did nobody find it odd that Chappell was calling for more of the same United Healthcare work-place provided crap health insurance we all loathe? Now we're in sub sub arguments about a speech condoning a known bad idea? Talk about moving the Overton Window to another dimension.",
    "Will always love Halsey!",
    "Someone needs to explain to her what an opinion piece is",
    "I've never met a fan of Halsey's who wasn't completely insufferable. That fake nice witchy type that thinks rocks have energy or whatever lmao",
    "As a side note did the Grammys completely snub her this year?",
    "Not a fan of Halsey, but I will welcome any oppurtunity to drag Taylor.",
    "[removed]",
    "![gif](giphy|l1BgRxfW6Yl2Dbymc)",
    "That article reeked of label, when I read it I was surprised that someone dared to be so tone-deaf. It makes sense now.\n\n![gif](giphy|dPkQk7aiwL8DC)",
    "Naturally he penned the most hysterical response to a woman publicly speaking truth to power. What a loser.",
    "Also Hollywood reporter is owned by the billionaire penske family which is right wing. They will always defend the capital owning class. They provided this platform for this exec.",
    "Of course he has ties to Atlantic",
    "You know, when the whole Taylor swift trying to buy back her Masters thing happened and then people were defending record labels I’m like… you realize record labels are actual scum, right?",
    "And a homophobic Zionist \n\nhttps://preview.redd.it/x2k44kq5xkhe1.png?width=1298&format=png&auto=webp&s=cb56c6b449d4cb52ffc72b548036c515e56122b1",
    "He dated one of my best friends. Not my fave.",
    "He was laid off in 2006.   He’s worked mostly in artist management since then.  He’s not like some label insider.  Maybe this was some label hit job…. But I doubt it.\n\nThe labels do not care if you hate them!  Do you know what label Halsey is on?  Do you know what label Chapelle is on?  The labels aren’t the important brands… the artists are.",
    "\"the man\" told me all I need to know",
    "I think people that are ripping their nail stylists off their fair pay is in no position to whine about not labels mistreating her as an employee lol",
    "![gif](giphy|OjrcZp4fXMHBryKoXZ)",
    "That was me earlier when I saw the headline that Demi Lovato and Andrew Garfield were an item. Like ok, that's cool, what's the big deal. Then I realized it was Demi MOORE lmao.",
    "lol I WISH there was a drama cross-over between GBBO and other pop culture lol.",
    "Unrelated but his name reminded me of this video of Trixie Mattel thirsting over him Paul https://youtu.be/WfqKTmSFclY?si=TSYnNA9F0VmSns4b",
    "There’s a Zionist push to discredit Chappell. There’s this music industry ass hat, there’s the nail person. It’s so great they are scared that the new artist of the year is anti genocide",
    "[removed]",
    "Girl same, been a Stan since I was 13 and listened to New Americana for the first time. Like that’s my girl and I’m happy there’s women in the industry defending and supporting each other right now. It makes me so happy that the girls are getting along not matter how the media tries spinning it 👏👏👏",
    "I don’t really like Halseys music but I thought she popped off with this one",
    "I thought Halsey is non binary? Not a woman. But yeah, hals has always been awesome in standing up for women and marginalised folks.",
    "They truly could not",
    "I fucking love them too",
    "Same, I LOVED her speech. And agree that going for a healthcare for all approach wouldn't have been effective as tying it to her personal experience.",
    "no but see this assistant she may or may not have known about allegedly asked for free nails on late notice that were declined a year ago so chappell is obviously an evil hypocrite, we must drag her!",
    "When you sign with a label you are basically a sub-contractor. They put out the money for you to record your album, they market you and give you money to live. If you don't hit it big, you get dropped. Her speech isn't going to do a darn thing because this has been happening to music artists since record labels have existed. If we had national healthcare, this wouldn't be an issue for anyone.",
    "[deleted]",
    "Except her approach was shaming the labels and the labels literally couldn't care less because everyone has known their evil since like, the 1960s\n\n\n\n\nIf she wants to make more industry specific complaints, it would be about the low pay of signed artists and/or unionizing (where the union could offer a group plan, similar to what actors do) \n\n\nIf it's about healthcare, then it really does need to be about the system broadly because artists are basically independent contractors and wouldn't actually want to change that.  So the issue is they don't get paid  to weather through rough spots, and also individual plans for self employed people are *super* expensive. You can deduct it for tax purposes but that doesn't help people who are living hand to mouth, which is most artists who haven't broken through yet.",
    "Record labels used to let you live off merch sales too.  Not anymore.  ",
    "Exactly. It’s when people speak up about the sick game of inhumanity within the structure that all the top vultures and aspiring vultures come out to try and discredit you by claiming naivety. ",
    "What exposes? I’ve only seen a positive article about this issue in Variety?",
    "If it's so easy to do I'm sure we'll see Chappel start her own label with guaranteed salaries and healthcare for everyone.",
    "Everyone in Hollywood is still an employee… just not of the major studios.  That’s why Blake lively can sue wayfarer pictures for sexual harassment.\n\nMusic doesn’t work like that… everyone is independent. Chapelle isn’t an employee of umg, and she isn’t working for hire.  She even happens to own her masters.  ",
    ">Historically, star actors used to be employed and taken care of by major studios.\n\nListen I get what you're saying but the studio system was pretty much legalized slavery and not that much better either",
    "You don’t think that someone can have unmet needs and win awards? Or that people who previously didn’t have their needs met that now do can’t speak up for people in their past position? ",
    "Are you guys bots or something? This amount of hate for someone who hasn’t done anything even close to seriously problematic seems manufactured af.",
    "This hahaha",
    "Given what you just said... kinda looks like the problem is you",
    "The Great Impersonator will be eligible for 2026.",
    "No. She won Best New Artist and performed.",
    "Right. I also was confused...but as it released post oct 1 2024 - likely 2026 will see her in nominations",
    "Super helpful input — thanks so much for sharing.",
    "Yes because that’s the most important thing in this equation, not a former music exec trying to put her in her place, and trying to use the trade mags to hold up the old guard. Personal feelings? Far more important!",
    "So edgy",
    "A nobodies gif?!  Screaming crying throwing up I loved this show!",
    "I like this gif, what is it from?",
    "\"Hysterical\" is right, I saw the headlines and didn't even bother",
    "The way I and others said this before and got downvoted for saying as much. Someday people will realize that these companies are selling a message, not always the truth.",
    "How do you explain the anti-Trump articles published by Rolling Stone, Deadline, or [this article from The Hollywood Reporter](https://www.hollywoodreporter.com/lists/best-anti-fascist-films/) today? All owned by the same company.",
    "> Pronoun humpers rejoice!\n\nI gotta admit, every once in a while bigots manage to surprise me with their turns of phrase.",
    "The fuck is this word salad",
    "Oh this dude,  I remember reading somewhere he called a girl group \"pedo bait\"",
    "What a fucking tool",
    "Can you tell us more?",
    "FWIW Chappell was initially signed to Atlantic before they dropped her, so there may be validity to calling the article personal. I’m sure some of Jeff’s former colleagues are salty she was able to find success with a different label.",
    "People working at labels care very much if you hate them because their personhood is not associated with the brand status of the company they work for.",
    "he's a stuffy prick is the point",
    "What’s this in reference too?",
    "And she was correct",
    "Pretty fucking weird to say that getting cancer and endometriosis is the price of her choosing to be an artist. \n\nIn other, more civilized countries you can have Healthcare AND be an independent contractor or artist. They don't have to be mutually exclusive, it's just our CEO overlords who choose to make it that way.",
    "No it's a real big America problem. The rest of the developed world have some sort of free healthcare.",
    "My god. I have no words for what a callous post this is.",
    "What are you even insinuating here? That her cancer and lupus are “the price” for her working in the arts? \n\nThat is the dumbest take I’ve seen in a while. \nWhat is wrong with you?",
    "This is so vile wtf is wrong with you",
    "Did you just call leukemia \"the price\" of her success? What is actually wrong with you?",
    "the point is that people shouldn’t have to sacrifice healthcare to pursue the arts. you lack the imagination for a better world.",
    "😨",
    "Joining the fanclub! Badlands is one of the most important albums of my life and seeing Halsy live last summer was such a dream come true.",
    "Agreed when I first heard Control I am like this woman is incredible I love her voice.\n\nI am so glad were seeing more instances of women defending women. We need each others backs!",
    "I swear to god these ppl would hear about her asking a restaurant to leave the pickles off something and start foaming at the mouth with rage",
    "Hopefully I don't get downvoted for this but I find it really weird that the artist is only speaking up NOW, after a grammy win but also after that speech that apparently hit an industry nerve... Like, as an artist, if I felt slighted and angry by a celebrity I definitely wouldn't just hold onto that for a year? Why not go off about it asap? If she was afraid of backlash it wouldnt make sense to wait until the celebrity won a grammy. Maybe she is telling the truth, but its just strange. I'm not trying to discredit the artist, because I don't know what happened and I never will because I literally wasn't there, but I'm just saying the timing feels odd.",
    "To me it sounded like the nail salon wanted that free publicity and attention.",
    "I’m am definitely for national healthcare, so I hope you don’t think I was arguing against it. But I think addressing a room full of music execs saying “healthcare for all” allows them to nod their heads and agree that yes, in theory, that sure would be nice. Her speech may not change things, but it addresses the correct people and identifies a specific issue they are in fact responsible for and can change. They absolutely can offer healthcare when they sign an artist and choose not to.",
    "We should absolutely all have healthcare in this country but until we do the people making billions should be providing to the people they employ even as sub contractors",
    "[deleted]",
    "I hear you and agree. Powerful companies could lobby for a national healthcare system and I think that would actually help us get one. So in a way if she keeps calling them out in a public way, but the solution is a government one, she's at least getting powerful people potentially interested in helping get us there.",
    "Yeah, they’re basically freelancers. They’re not their employees and many labor laws don’t apply to them.",
    ">If we had national healthcare\n\nWho's \"we\"? You can't reference systems in a specific country without saying which country you're talking about. Or are you assuming everybody online is from one country?",
    "I think it can be a little of both. I haven’t always loved Chappell’s takes on things and it wouldn’t surprise me to find her activism is performative. I just don’t always think that matters. I don’t care what someone’s motives are as much as what they’re able to accomplish.\n\nAnd in this case, I’m just happy she didn’t go up there and make some general speech about a national or global issue. She identified an issue within that community specifically. Whether or not she’s a hypocrite in that moment doesn’t matter to me as much as there’s now a public record of an artist addressing the need for healthcare in the industry. \n\nAnd honestly, if people want to use her words against her going forward to hold her accountable, I’m all for that. I’m just happy it was said.",
    "What’s wrong with her style choices? ",
    "you’re so right and it being hard to do is such a brilliant, airtight argument against positive change! ",
    "I think a lot of them like to pretend to be relatable when their reality has always been quite different.",
    "One minute we’re complaining that celebrities don’t do enough then someone speaks out and it’s a problem because she’s “too rich” to speak on things. No wonder Chapell’s constantly crashing out, can’t win with people.",
    "Isn’t she always going off on ig lmao or ranting??? I always see people say she needs her phone taken away 😭😭.",
    "Sorry not a bot, not sure how to prove it 😂\n\nI definitely don’t hate her, I just won’t be surprised when more stories come up in future about her detailing some shitty behaviour",
    "Here: 🪨",
    "OP might’ve been talking about Chappell but I’m sure Grammys will snub Halsey for TGI. They didn’t even nominate Without Me when it was one of the biggest songs of the year",
    "a phenomenal movie called “Doubt”. 2008. Streep, Philip Seymour Hoffman, and Viola Davis.",
    "I can't decide if it's my new band name or my new porn name!",
    "When will people finally understand that pronouns have always existed and if you’ve ever “humped,” anyone, they (pronoun) have also been a “pronoun humper.”",
    "Like monkeys typing Shakespeare",
    "He thought quite highly of himself, ran with a crowd of industry bros who were also icky, and ultimately dogged my friend (they didn't date seriously but she clearly wanted something serious, and he knew that, but he was only interested in fucking her and strung her along). This was 20+ years ago. \n\nHe worked with some very close friends when he started writing, years later, and they said he'd improved and grown up a bit...but they didn't really care for him. We had a laugh - at his expense - at this situation.",
    "He left in 2006.  That’s a long time ago.  Most of the people who were involved in Chapelle at Atlantic are probably gone… the label was restructured and a ton of people fired in early 2024.  They might be salty…. But… chapelles on island!  Why would they care?",
    "unemployed stuffy prick!",
    "A nail stylist claims that Chapelle’s team asked for some  comped nail sets in exchange for exposure.  The stylist said no.   It’s a big nothing ",
    "Its old news from early 2024 and the nail stylist is just seeking clout and resurfacing this after chappell’s win. All artists have teams that help them request and obtain some form of brand sponsorship and this is no different. Also, no one is forcing this nail stylist to provide anything if she does not want to.",
    "while whining about how a voluntary label contract she hustled for and wanted didn’t give her free insurance she was screwing her own employees out of pay",
    "That’s not her price silly. *Paying for it herself is*. That’s the bargain she struck joining the industry and it’s one she would take 10/10 times rather then be a normal schmuck like us.",
    "That’s subsidizes people trying to get into the entertainment industry?",
    "Belligerently American.",
    "Stars are independent contractors just like me. Who have to pay for some of their own health insurance. I’m sorry this is news to you lol",
    "No. *the payment of the treatment is her responsibility*. \n\nShe made the choices to get where she is today and she would never take them back to have health insurance but be like one of us “normal” workers.",
    "It’s not lol\n\nIdk if you’ve ever heard of independent contractors but that’s more or less what Halsey and most musicians are. They pay for their own insurance. \n\nIdk why you’re acting like she’s above those rules. Or entitled to special treatment.",
    "No the price is literally paying for the treatment",
    "The world isn’t run on cowboys astronauts actors and musicians. We need people to make your fast food. To pick up your garbage. To scrub your toilets. To fix your cars. To work in your factories. \n\nThose people deserve help paying for healthcare, not free, but help. People who work in the arts in Hollywood live good, exotic glamorous lives and chapel roan would never in a million years choose a steady job with insurance over going to the vanity fair after party. \n\nThe silent majority is not obligated to pay for her insurance while she tries to make it in the industry. It’s obscene to even argue it.",
    "Wait that nail thing was from over a year ago?",
    "It may have been of promise for herlsef, she did say on the speech that she said to herself that if she ever won a grammy she would say that.",
    "Exactly. She talked about a very actionable problem - clear problem with a defined solution that would be fairly easy to solve. She said it directly to the people who have the power to make that choice. \n\nIt’s far more effective than generalities….something our Dems could learn about.",
    "Music execs aren't going to offer healthcare because artists aren't employees and no artist would agree to an actual employment contract. It would probably just exacerbate how swiftly and unceremoniously they drop artists tbh \n\n\nShe should put industry pressure on her peers to form a union which has a group health plan and collectively negotiates for minimum contract standards like what actors do. Labels execs cant be shamed into behaving better cause they're literally overwhelmingly evil people at the top. But artists might be able to be peer pressured ",
    "All major label artists are unionized.  Vocalists by SAG-AFTRA, instrumentalists by AFM.  It doesn’t do then any good",
    "I thought that was obvious.",
    "The context of this \\*entire\\* conversation is about American healthcare.\n\nOr are you assuming everybody online has to clarify every single comment they make, even when it’s extremely obvious to anyone not looking to be offended?",
    "her stylist allegedly tried to pay a nail technician (? i’m not sure if that’s the correct term for the occupation?) in ‘exposure’ about a year ago, right before chappell went viral.",
    "Super briefly, a story broke recently (I want to say yesterday?) that her stylist had asked nail artists to send nail sets for Chappell to wear on stage. Only compensation was “exposure”.\n\nThe incident happened long ago but it looks like she has the same team now, and it left a bad taste in peoples’ mouths, especially coming from someone who often speaks on fair compensation for artists.\n\nChappell’s message is still 💯 imo, but the hypocrisy isn’t a good look.",
    "It's always easy to tell other people what to do with their money. It's hard to actually do it yourself.",
    "I think everyone is guilty of this by default. And yes, many celebs are this because of profits. I disagree that chappel is this (right now), and I do think it’s unfair to label her as this just because some other pop stars use relatability as a parasocial marketing strategy. \n\nBut getting up at a podium and standing up for human decency during a time when people are recognizing your work with an award is nothing to scoff at. Wish more people would do it instead of plugging their next album or even thanking god. It gets people talking at minimum. Hopefully it gets people thinking. And possibly, enacting change. If anything, an artist who has been working for a long time without accolades or buttloads of money who finds themself suddenly with a microphone in a room full of the most “important” (ie wealthy) people of their industry? That could do something. If anything she’s fallen out of grace with the academy. So I don’t see it as performative at this point. ",
    "Poor poor thing. Is there a go fund me?",
    "Well the article is asking her to actually DO something about it instead of just talking about it. I don't think it's a big ask. Plenty of celebrities talk and commiserate. Less actually work for change and even better, others simply take action without the need for accolades.",
    "Porn band, untapped market.",
    "Both! For every ticket you sell, they get one week free of your Only fans of the same name!",
    "Pronoun Humpers - band name, Humpers Rejoice - porn name",
    "I can say with 100% assurance that the lady who signed and then dropped Chappell still works there.\n\nedit: as for whether she’s salty? last year she was saying she didn’t regret dropping Chappell. the lady is also a bit of a bitch so idk I hope she’s salty now lol. \n\nmy friends dad works for her. she’s his boss. and the poster is right about the restructuring, my friends dad was actually impacted and moved to a different position.",
    "Nah it’s a big something coming from ms. r/im14andthisisdeep",
    "My brother in christ she was not speaking for herself. She was speaking on behalf of all creatives, including those at the bottom of the entertainment food chain.",
    "The whole point is that it shouldn't be that way. Are you saying you are happy that health insurance is tied to employment contracts? That's a very bold and bootlicker stance of you. \n\nOr are you just an internet contrarion who likes to rile ppl up with dog shit, ice cold takes?",
    "It subsidises anyone who has been a taxpayer in the country and their dependants etc. Tourists need travel insurance etc but yeah. \n\nHow broken you poor americans really are. 🥺",
    "Healthcare should be, and in many countries is a fundamental human right. Access to it should not be dependent on what job you hold or if you hold any job.",
    "Even in a 9-5 job with health insurance you are subsidizing healthcare for everyone in your group...",
    "It’s not news to anyone. They’re saying it *shouldn’t* be that way, not that it isn’t. Every single developed country on the planet provides healthcare, aside from one.",
    "A lot of us don't think one's access to health insurance should be tied to the industry one chooses to work in. Why do you think it should be that way?",
    "Why is healthcare “special treatment” for anybody, including celebrities?",
    "Fair pay and health care is special treatment, what will these mollycoddled divas demand next? MY GOD",
    "In most developed countries she wouldn't have to pay out of her own pocket.  Universal healthcare would cover it and if she HAD health insurance which many people in other developed countries have even with universal healthcare then she could CHOOSE to go private... but would be safe in the fact that all the years of her working and contributing to society meant she would be covered and she would be able to get better and back to work and contributing to society again.",
    "most countries have universal healthcare. those places have musicians, toilet-scrubbers and all types of workers. there’s nothing wrong with chappell roan, a big artist, raising concerns about smaller artists not being able to afford healthcare. if you don’t value art or think we can strive for a higher standard of living across the board, then i can’t help you.",
    "I meant the nail artist, not Chappell.",
    "Yess. That's what makes it a good ass speech. She made it relevant to the situation and made her points clear. ",
    "Except it was generalities.  She wants healthcare from somebody who isn't her employer(by design).  She didn't go into MFA, so....?",
    "Then you engage the system to actually do you good. Asking label leadership on an stage isn't gonna do shit. They know what they're doing. They do not care. Rally your fellow artists to push for labor reform through collective bargaining. Everything else is theater.\n\n\n\n\nThere's unions that don't earn their keep. UFCW is pretty infamous for this.  Usually through disengagement of membership -- either through high turnovers or encouraging a \"fuck you, got mine\" culture. \n\n\nIt still becomes a question of artist led collective bargaining. The execs are comfortable being the bad guys and the fellow big name artist are let off the hook because it's not their fault, they're not the bad guys. The system festers like it has for decades. \n\n\nWhat specifically does she even want? Label provided coverage wouldn't have addressed the gap she and many other artists faced. Does she want severance built into contracts? It harder to drop artists? Catastrophe insurance? Longer windows of non productivity if they get insurance through SAG? A union that actually meaningfully represents the fairly unique needs and aspects of the music industry (which are not reflective of the radio ecosystem from 80 years ago)?",
    "it was.",
    "Not even her stylist; one of her stylist's assistants.",
    "It feels kinda disingenuous to phrase something that happened a year ago like that",
    "It’s going to take port strikes level of protest to get any of this moving. Like to where the artists and I mean big names and people in droves to protest the labels for them to consider it.\n\nThe port strikes struck fear that if they didn’t get paid, ain’t nobody getting goods or money.\n\nThe reason I say this is that if the Luigi mangione situation jump started the conversation….it fizzled out quickly despite sending the message.",
    "It's gotta be metal though right? The guttural sounds of gargling on a dick.",
    "\"Wanna get together and bump pronouns?\"",
    "She just watched an artist she dropped win bna.  And A&Rs get points on records(usually 1%). Chapelle has done already sonething like 12 million in revenue, so… yeah that’s 100k down the drain.  More.  I’m sure she’s very salty (though if her first name is emily, she's probably not that salty)",
    "Didn’t she say “*I* felt used?” It felt more like whining about how hard she had it becoming a world famous, pop star not about blue collar workers paying for treatment. And, once again, I’ve been in the same boat as her. \n\nI’ve paid for my health insurance because the pay I was getting made being an independent contractor more lucrative. I also had medications to take that cost an arm and leg out of pocket. \n\nBut I knew I’d made my choice so I wasn’t whining on social media about how I felt used by the construction company I worked for didn’t pay me super high wages **and** free insurance. \n\nWhy is she held to different standard?",
    "And that’s wrong. The working people of the world aren’t put her to subsidize fucking art majors with their tax money. \n\nDo you not see how this causes resentment among the unlucky Americans? The ones who don’t have the time luxury or opportunity to pursue their dreams? We’re supposed to stay behind and be the runway for the *artists* of the world to take off on?  \n\nSomebody gotta scrub the toilets. \n\nAlso, I disagree. No govt healthcare plan should be used to help people trying to make it big in the music or entertainment industry.",
    "fun fact: in brazil it's free for foreigners too, which is very useful, especially around the holiday season, due to the heat/potential food related issues",
    "[removed]",
    "Because the world isn’t your piggy bank. The majority of Americans who make the hard but necessary choice to join the workforce and pay their taxes shouldn’t have to subsidize free insurance for the people that just want to work in low paying, low benefit jobs like the arts. \n\nIt’s the people who *choose* to work in that industry who bear the cost and responsibility for handling their healthcare. Same as the blue collar workers or low wage workers.",
    "Yes she would lol\n\nAnd she’d have wait lists. Oh actually no she wouldn’t cause she’s a rich celebrity so they’d probably skip her to the front of the line. \n\nI’m sure you’d say that was fair too right?",
    "Is she paying for her teams insurance? I’m sure she got assistants and makeup artists and stylists. \n\nMaybe she should put her money where her mouth is?",
    "Oh ok",
    "I don’t remember her name and I need to find out lol",
    "\"I told myself if I ever won a Grammy and I got to stand up here in front of the most powerful people in music, I would demand that labels and the industry profiting millions of dollars off of artists would offer a livable wage, and healthcare especially, to developing artists\"\n\n\"It was so devastating to feel so committed to my art and feel so betrayed by the system and so dehumanized to not have help.\"\n\n\"Labels, we got you, but do you got us?\"\n\n\nMaybe you should be whinging about it on social media? That's how change happens? By having these conversations and saying actually no this isn't fair.",
    "As if people trying to make it big don’t usually have another job (or jobs) to stay afloat, usually in the service industry where they aren’t covered by insurance either.",
    "Big artists like Halsey and Chapell Roan also pay taxes. \n\nSmall indie artists who haven’t made it also have to pay taxes. \n\nEveryone (aside from like corporate billionaire ceos apparently) has to pay taxes. \n\nNobody is subsidizing anybody else.",
    "No actually we are there to subsizide fucking art majors.\n\nGuess what we listen to on the way to our jobs: fucking art majors, guess what's on the radio playing over the supermarket speakers for those shopping or working? ... fucking art majors.\n\nCreative people pursuing their dreams and making music, movies, tv shows, books etc! They are making things that entertain us and they deserve to have healthcare and feel safe and supported to express themselves into their art so we can enjoy it? \n\nHelping people pay for a blood test or medication is not \"helping people make it big in the industry\", it's being a decent human being.",
    "I'm on paid annual leave from my job in a country that gives me 4 weeks paid annual leave and 10 days paid sick leave by law per year... so I've got all day to reply to your comments, but you aren't replying to me...  did i say something to upset your fractured idea of the american dream? 🥺🥺\n\nEdit just to rub it in: I've got a four day weekend cos we had a public holiday yesterday, which is a paid day off for everyone scenario. If you happen to work on a public holiday here, you get time and a half and a day in lieu (day off to take at a later day).",
    "26/27 OECD countries do provide healthcare to musicians.",
    "Bootlicking behavior. Healthcare should be a right. Who knows if we’ll ever get it.",
    "that's literally how society works. people who walk everywhere still have to pay taxes that go towards streets. people without kids have to pay taxes that go towards schools. get over it.",
    "wow you’re far gone huh?",
    "Well they’re currently subsidizing bombs so, yeah they should.",
    "Oh you’re just a straight evil person too I get it now.",
    "Let me get that small violin for you to learn how to play and break into the music industry with.",
    "yuck",
    "Everything has waitlists, even private or American healthcare. \n\nShe would be assessed and prioritised based on the severity of her condition.\n\nThat isn't quite the gotcha you think it is.",
    "Maybe you can Google that and find out the answers for yourself 🤷‍♀️",
    "the person I'm thinking about signed Charli, so she's probably fine.  Best not to name names.",
    "You’re saying an entertainer like Halsey contributes more to society so she deserves more in terms of pay then, say, a nurse?",
    "The truth is, your amount of paid leave is also common in the US, but it's tied to your job and not the government. You can have a great job with great benefits, even unlimited paid/sick leave (Not that it works out to be a real benefit. Many people end up taking less time off if it's \"unlimited\"). \n\nBut there are also people who work just as hard in jobs that don't provide any benefits because they're contractors or have multiple part-time jobs. This inequality is built into the system when you make benefits contingent on employment.\n\n It also makes it harder to leave your job or even attempt to be an entrepreneur or artist. It's built to keep you in the rat race and fighting for scraps like the comment you're replying to.",
    "He is lost yea.",
    "[removed]",
    "I said nothing about how much pay someone deserves and who deserves what over one particular person or which contribution to society is \"more worthy\" of healthcare.\n\nBut while we are here, they both deserve it equally.... one may pay more tax than the other, but it all goes into the same pot. \n\nMy tax covers healthcare..  I haven't needed to go to a doctor or use health services this year... it's not like I'm demanding the government give me my money back....  it goes into a healthcare budget which the goverment allocates to hospitals etc to help people who are sick and need those services now and then if in the future I need those services my care is covered from the same pot.",
    "I’m a nurse in Canada where my tax dollars subsidize everyone’s healthcare. Artists, college kids, stay at home parents, homeless people on the streets. I will gladly pay that every time because all humans deserve healthcare. \n\nThe amount I pay into taxes for free healthcare is not the main thing keeping me from achieving Halsey’s level of income lol",
    "No one's saying she deserves more pay than a nurse, but the art she creates makes a ton of money for the record labels she works for. \n\nDo you think the record labels should just steal all the money and leave her with less than a nurse because \"That's all she deserves\"? Why does the record label deserve more than a nurse? \n\nNurses deserve way more pay but people who do work that creates lots of money will always earn more because that's the nature of money",
    "Yeah, and that's really shitty. It shouldn't depend on if you get a good boss or not.  A lot of places here offer extra leave too, including where I work.  But yeah that's the minimum required by law for a full time worker. \n\nWe have alot of contractors too but they are still covered by our health system. They need to make sure that what they're getting paid covers allowing for holidays, taxes, etc.  and contracting is predominately used by professionals in either trades or the govt. So big enough money, not a struggling musician. \n\nThe system in my country is by no means perfect but it certainly doesn't feel as rigged and warped as the American system (yet, the rot is spreading - we've got a dropkick coalition of chaos atm ourselves)",
    "Don’t you have some pipes to go maintain to keep your health insurance?"
]