[
    "> They're in the way of new bands. Radiostations, festivals, media and award shows (I'm looking at you Grammy's!)\n\nLol this is just another typical \"no good new music because I only listen to top 40\" shitpost but with a different shade of paint. They're not in the way of new bands.",
    "Not sure what you’re talking about man. There are tons of new bands making great music right now. You just have to know where to find them. It’s not older bands fault that new bands aren’t more popular. Commercial radio stations don’t play new, up and coming bands and MTV doesn’t play music videos anymore. That doesn’t mean there isn’t good music out there. It’s just not being promoted by big labels and radio stations like back in the day. This isn’t Kiss’ fault. It’s Universal Music Group, Sony Music Group, and Warner Music Group’s fault. These companies decide what gets popular. And they play it safe. These big companies are risk averse. So if you want to listen to good music you have to find it on your own.",
    "Iron Maiden:  Nicko McBrain-72, Bruce Dickinson-66, Steve Harris-68….  \n\nU2:  Bono-64, Edge-63, Larry Mullen-63, Adam Clayton-64.   \n\nI’m 60, and admit that I don’t want to see bands with 1 or 2 original members still out on the road. And I still think of Alt-Rock and Grunge bands as “new” rock.   \n\nTom Morello from RATM is 60. Duff from GnR, too. Lead singers from Counting Crows, Jesus Jones, Mighty Mighty Bosstones, Soul Asylum, Hole, Warrant, Slaughter, etc etc all 60. \n\nYou need to decide what “old” and “new” is.",
    "Ok, so, you’re wrong, but before I tell you you’re wrong, you’re going to have to clarify something. Do you mean before the *band* turns 40 or before the *musicians* turn 40, because either way, you are being ageist as *hell*. Like, are you listening to yourself?\n\nThe Pretenders didn’t achieve success until after Chrissy Hynde turned 30, and they kept making music into her 40’s.\n\nCyndi Lauper released *She’s So Unusual* at the age of 30 because she refused to tell her label how old she was. And that *started* her career.\n\nPaul Simon released what is possibly his most successful and influential album, *Graceland*, at the age of 45.\n\nBB King continued to record music and influence artists until the day he died. The same could be said for Ray Charles. And Aretha Franklin. \n\nAlso, there *are* a lot of kids out there who are discovering old music. \n\nLook, I’m not saying that the KISS hologram show isn’t a cash grab. It is. But I’m also saying that in the alternate universe that Christine McVie was still alive, Stevie Nicks & Lindsey Buckingham made up, and Fleetwood Mac got back together I would be in line to buy tickets. And I’m 36.",
    "Define “Rock” music? Do you listen to the Rolling Stones?  When was the last time they got a Grammy? I guess life ends at 40 huh? If you haven’t created something worthwhile by 40 quit? What does age have to do with it. \nI feel bad for you, if at 51 you feel this way how do you have anything left to look forward to. I am quite a bit older than you, I have seen music change, Rock as well as what they used to call Country. \nSo tell Stevie Wonder to Stop, Santana, and you mentioned U2, so who else? Coldplay? \nThe music I listened to, my Generation, was the Beetles, Creedence Clearwater Revival, Eagles,Led Zeppelin, Linda Ronstadt,Tom Petty,Queen, The Who, Eric Clapton, James Taylor,Talking Heads,Steely Dan, Lou Reed,ZZ Top, Lynyrd Skynyrd, Jim Croce, Nazareth,Al Green,Heart,and many more. It was in my opinion the best music, bands and singers in all time. Not only could we listen to these bands we could see them in concert and we didn’t have to sell a kidney to do it. Yeah, it may have been festival seating but who cared. There may have been some passing around of smoking material, from people that we didn’t know, but everyone was chill, it was a different time, if I could go back and see those bands again I might, I did see Elvis Costello in the early 2000’s it was great, but you can’t capture that magic again. But to say they are getting Grammy’s and not allowing new talent? Maybe politics could enter into it. I’ve seen what has gone on the few times I’ve watched. “sour grapes” this person has had this many Grammys but can’t get best album. If enough people whine about it, maybe they will get it, even if someone else may actually be more qualified for that category. I don’t care who gets what but how old are these people? \nI hope things work out so you feel better about rock, or Rock v Heavy Metal. No one should feel bad when listening to music. It even calms down my Great Pyrenees when she gets grouchy, so I wish it would do that for everyone. \nOh and today, on Valentine’s Day go have a listen to “Three Dog Night” Just an old fashioned love song, it is one of their older ones, but a goodie. Music should make you feel good, if it doesn’t, find something else that does. It’s all about memories to me.",
    "I love new music!  You know, like from the eighties!",
    "Strange that you take away that from my post. It's the very opposite. There are a lot of great new bands. But it's like The Stones or The Beatles come up with a mediocre album or a half a song everybody's in awe. And I never listened to any chart in my life by the way.",
    "That partial is a reason. But what if, let's say U2 quit in 2000? Record labels would have needed to adapt and promote new bands to radiostations. But they didn't and I believe that didn't trigger their label to sign new talent. The same with festivals. They complain that there aren't any new rock bands and bands are aging. Rock bands are still a major pull for people to buy tickets. \nUntil the 90s festivals helped making new bands. After that they kept signing the same old bands because festivals were on a high and people had money to burn. So why risk anything. But that kept younger bands back.\nAnd sure times changed. Streaming, radio everything is readily available to find new music. But I'd like to see this young bands make it as big as well. ",
    "I deliberately restricted myself to bands. Artists making music, no matter what age, should make music till they drop. And of course I'm over exaggerating some what. But I still think that every decennium deserves their own musical heroes without old acts \"being in their way\". Let Fleetwood Mac be a band from the 70s and 80s. Like The Stones should have stayed a band from the 60s and 70s and U2 from the 80s and 90s. The 2010s and 20s need their own big names.",
    "Really? The Stones and The Beatles won Grammy's this year!? \nYou play whatever you like. And artists should make new music until they die. I don't mind at all and I love music from the 60s onward. ",
    "People like what they like. And those bands earned their respect as much as any new band out there stuggling.\n\nDo you want to dictate what people listen to? You might get a nice job at Spotify if you do.",
    "Young rock bands aren’t gonna get big the way they used to in the 60s through the 90s unless there is some sort of cultural shift. TikTok decides what is popular now and currently that means vapid pop music. And if you go by what these corporations dictate as popular, you will be very disappointed. However, take a band like King Gizzard and the Lizard Wizard. They have a huge following with fans around the world. They’ve put out 26 studio albums since 2012, tour constantly with each concert selling out and they don’t show any signs of slowing down any time soon. But you won’t hear them on mainstream radio or in Super Bowl commercials. They are still considered an indie band. If they would have come out in the 70s they would probably be as big as Led Zeppelin or Rush.\n\nThe culture needs to change. I don’t know what it would take for that to happen but I often think about when Nevermind came out in 1991. At the time rock was dominated by glam and hair bands and the number one artist was Michael Jackson. Nevermind ended up unseating Michael Jackson from the number 1 spot and grunge became mainstream overnight. Preppy kids and jocks started wearing flannel shirts and Converse and every record label was looking for the next Nirvana. The music in the 90s was pretty great as a result. We’ve had a lot of great bands since Nirvana but the culture has slipped back in to pushing pop music like it was in the 80s. So the culture needs to change if we want to see a resurgence in rock music.",
    "One of U2’s more under appreciated songs was written in the 2000’s. It’s called “Stuck in a Moment”, and Bono wrote it about Michael Hutchence from INXS. It was overplayed to shit when it was released, but it’s not a bad song. The Rolling Stones also continued to have good output in the 80’s. \n\nLook, I’m not saying that the situation with the Grammys isn’t fucked up, but your blame is misplaced. The problem isn’t with the artists it’s with the record industry as a whole.",
    "Casey I agree, I was replying to to the original poster. If you’re good you get noticed. I grew up on music from the Big Band Era to listening to my cousins “big girls don’t cry”. But the 60’s and 70’s were my years, 70’s High School and boy did we have the GREATEST MUSIC!  And the Concerts WOW! No ticket Master. I lived near a college Town so you bought the tickets there, you didn’t worry about the “best” seats there were none. It was the greatest time to grow up. I can’t say it was all flowers and sunshine and peace ✌️ signs all the time. It wasn’t. My car was broken into when I tried to save money and parked somewhere I probably shouldn’t have. They stole a bunch of tapes, but they were all tapes I had made off the radio I bet they really hated that🫣.",
    "The Grammys are a joke. It's cool if they get something moderately novel nominated and winning but the bar is on the floor.\n\n\nI mean even the Simpsons clowned on them in the early seasons",
    "Nobody has a desire to give media presence to an actual feminist anthem. It sounds catchy, is thought provoking, and kinda just plays into a rage a growing number of women are feeling these days. I didn't think it was Grammy worthy-verse 2 in particular got a bit melodramatic even by my standards- but it is interesting that it's a decent song that gets zero exposure",
    "oh and fuck you too",
    "> but I have heard how its the awards show that recognises the best achievements in music\n\nHahaha seriously?? Who in the fuck has been telling you this? It's an awards show. They're all shit.",
    "Isn't it just popularity? Which, I mean I know that sounds stupid but texas hold up or what ever it's called was shite but really popular. Beyonce is popular. So she won. At least it's slightly better than the Oscars that nearly always give it to some artsy fartsy shite rather than a decent movie. \n\nThere's tonnes of artists that are unreal and have amazing albums but never do well at awards because not a lot of people have heard of them - and its not always the bands fault. Radio stations where I'm at play the same stuff over and over and over (that stick season song for example, on a ten hour shift I heard it 6 times). Beyonce could release a single of her sighing for 5 mins and heart would label it a game changer",
    "“The music I like didn’t even win!”\n\nIlluminating take, truly\n\n“How tf did a movie soundtrack from the Coen brothers…”\n\nBuddy tell me you weren’t alive for this without telling me, that thing was fucking obnoxiously inescapable for *months*. It was *everywhere*",
    "The Grammy's are one of the most corrupt organizations in music that ever existed. They exist as an offshoot of the labels to help sell more music and drive engagement in their artists.",
    "I realized the Grammys were ridiculous in 1978 at age 18. Nominees for best new artist were The Cars, Elvis Costello, Toto, Chris Rea. Also new that year, Dire Straits, Devo, Van Halen, Kate Bush, The Police. The winner? A Taste Of Honey, for their one disco hit Boogie Oogie Oogie",
    "I have a strong disdain for all of these award shows. But as a musician my disdain for the Grammys are unmatched. It’s a ceremony of autofellation. Talented musicians do win awards, and honestly every single recipient is probably very talented, that not the point. They dont need this validation. 99% of music created in a year isn’t even considered for any given category. But what I don’t understand is why there’s an audience and why that audience gets upset if their favorite doesn’t win. I don’t need to state the obvious but I will, they do not care about music or musicians they care about money and selling the albums and artists like Beyoncé,Kendrick Lamar, or Taylor swift don’t gain an real fans or followers nor do they need to from winning these awards and I hope some serious heavy hitters in the music industry start to stand up for smaller musicians some day",
    "i mean some of these winners for AOTY and SOTY are pretty egregious tho",
    "\n\nLet's be clear, music is subjective, and it can be hard to argue on both sides on whether she deserved to win or not. But we can look at it objectively to determine if it was reasonable by analyzing her charting and # streams then compare them to another top perfroming country artist this past year. Since she also won top album of the year let's compare her to other top artists as well. \n\nFirst let's look at billboard ratings, which counts how many times a week an album or single is played and charts them on the top 100 or 200 weekly. And by quote \"Chart positions are based on multi-metric consumption, blending traditional album sales, track equivalent albums, and streaming equivalent albums.\" \n\nSo how often did beyonce chart for top country album? 4 times, 3 in April and once in May. How about charts for top album of 2024? 2 times, 2 in April. \n\n To compare the most listened country album of 2024 was Morgan Wallen with \"one thing at a time\" charting most frequently with a total of 34 times between December 2023 and January 2025. \n\nTo also compare for top album of 2024 is taylor swift with \"tortured poets department\" top charting 17 times. \n\nSo she clearly didn't win by frequency of top charting in either catagory. \n\nWhat about total number of media consumption like streams? Let's look at spotify for this, She got About 1.6 billion streams in total for \"cow boy carter\".\n\nHow does she compare to Morgan Wallen? His album \"one thing at a time\" amassed 6.5 billion streams on spotify.\n\nHow about biliie eilish? \"Hit me hard and soft\" amassed 5.6 billion streams on spotify. \n\nAnd taylor swift? \"5 billion streams on spotify\n\nTherefore she doesn't even beat out anyone here by streams either. However, she did in technicality, place 2nd for top charting country album outperforming other artists within the charts and # streams.\n\nNow with all that being said, Morgan Wallen was not considered for a grammy this year because his album simply did not release within the required time period. Therefore Beyonce would've won the grammy for best country album this year anyways considering she outperformed other country artists.\n\nAs for top album of the year? What the hell was this outcome, definitely not deserved when looking at it objectively, and if this isn't proof of Grammys being fixed or biased, idk what is. Let's be clear, I did not like taylor swifts album because I'm not her target audience. but if I'm looking at it objectively, she could've won it. \n\nAnd Let's not forget billie eilish, She definely had a better shot at winning top album of the year opposed from beyonce based off streaming statistics. \n\nIn conclusion, I think she would've won top country album regardless of what anyone says solely basing on streams and charts (unless I'm proven otherwise by someone else). But top album? Come on people, get real, what do the grammys prove then? If the voting is entirely subjective then why do people watch it? \n\nNow to express myself and be subjective for the sake of it, In my honest opinion, I just didn't enjoy her album as much as I expected or quite frankly at all. I didn't find much of the songs catchy and felt like they missed the emotional mark much of beyonces previous top hit songs hold. And to be even more blunt, her album felt more like an attempt to \"represent\" black people in country music in order to \"break\" the system or something along those lines. Honestly, country isn't her style of genre, I applaud the attempt, but I feel like it might have performed better if it felt more like she was interested in the genre, than challenging it and inserting herself in it for the sake of racial demographics. To go deeper, articles about the album glaze over the fact that she's a \"woman of color attempting to break into country music\". In my opinion who gives a shit, that shouldn't be a selling point for anything. Black people and quite frankly any other race can thrive in any genre without having to glaze over their \"identity\" and \"demographics\". In my opinion, to even factor race and sex in an non-athletic form of competition is just disgusting and literally the definition of sexism and racism. \n\nTo compare to her best work \"I Am... Sasha Fierce\",  which IMO is a fantastic album rooted with emotion and excellent writing, with songs written about relationships from a female perspective, ultimately proves her ability to legitimately win a grammy and produce fantastic songs. The only song I could sit and listen to without immidiately changing the song from \"Cowboy Carter\" was \"Levi's jeans\" which, I personally didn't find amusing enough to intentionally put it on repeat or on my playlists.\n\nAnd before anyone starts commenting, yes I listened to the entirety of the album, and yes I do occasionally listen to country music. I just didn't like it that much for the aforementioned reasons. I am not a racist and much of the music I listen to comes from African American people. But i don't listen to their music just because they are black, I listen to it because it's enjoyable. I feel alot of people might have a bias to glazing her album because she is a \"woman and black\" which yenno what, that's fine, all the power to ya. But for an award to be bestowed with no statistics to justify it? That's wild to me. \n\n And if we factor all of what i said in it just seems like she got the top album of the year grammy for just being of a woman of color attempting another swing at country opossed from statistical performance. Which is just wrong, Beyonce does have the following and skills to outperform her competitors, but she did not stick to her roots which in my opinion, resulted in her win for top album being controversial and a bit insulting. In my opinion billie eilish or taylor swift deserved the win.\n\nI hope I don't get blasted for speaking my mind, all here for discussion :)",
    "Nah, Beyonce's album had maybe one good original song on it, and it wasn't that one they played way too much.  I personally thought Billie Eilish's album was much better.\n\n#",
    "The point that you're missing is this album wasn't at all worthy, it was an okay-ish album at best. Albums like the midwest princess or brat should've won which shows more diversity and is damn good ",
    "you lost me at “woman of color” people hate on her 1. bc of the meme that everyone is scared of her and her possible ties to diddy 2. i think it’s fair to day the album doesn’t sound country 3. she has so many already and it feels fair to give the chance to other artists 4. last year jay z had a meltdown over not winning (for once) most of the time you are the one nominating yourself. nothing to do w her skin color.",
    "Listen, I love Beyonce (though I've not been a fan of her recent work but I know she's talented and forever one of the greats) but all I ever saw online about Cowboy Carter was that people weren't a fan. Did I feel like it was unfair criticism at times? Yes. But Cowboy Carter and it's singles weren't widespread favorites and they weren't everywhere either. It was easier not to have heard any of the songs if you weren't listening to the radio. On the other hand, I would say that Billie Eilish's songs were everywhere, on the radio, in stores, used in a movie commercial, etc and for a long time after the album was released. It was also a widespread favorite, even among people who weren't Billie fans. \n\nI think Beyonce should've won AOFY at least once in her career but not for this album. The Grammys trying to backpedal and give her this award because they feel regretful over not awarding it to her in the past, is just unfair to the artists who were in the category this year. Create a category for the outliers who didn't get awards when they shouldve, for iconic, culturally significant albums for cases like this so that Beyonce's previous snubs can be corrected but this ain't it. I was honestly surprised by this result and I'm surprised there isn't more push back about it.\n\nNow the country album, idk about that one. Idk if it played differently in the country scene but I kind of doubt it. But I can give that a pass, versus AOTY because to me, AOTY surpasses any genre constraints and I don't think she did that. I actually thought this was probably her most under performing album and I felt support for her was falling off.",
    "If this instance doesn't show you that these awards shows are fixed then I don't know what will.\n\nCowboy Carter received 0 (zero) nominations for the CMAs, yet she wins album of the year???? You think someone(s) in the voting section of the grammy's was trying to correct the \"wrong\"???",
    "i just dont understand how impact she is with country album? which i dont know how many song i from her that i hear last year which is only \\*this aint texas shit,if anything about country that deserve might aswell i put post malone album that he made more impactfull with all the featuring country artist. facepalm of the year for this award",
    "Well she couldn't make it in pop rock whatever category so she went country and now they're feeling obligated to have her win. Wow the whole thing is a sham. I don't think she's that talented either. And I thought the rules for each category was that the music had to be at least 50% country or whatever can you really say all her stuff was country?",
    "I'm not a fan of Beyonce. I think she always seems to be the \"center of attention\" and doesn't know how to blend in. I think her trauma with the paparazzi and the public seems to close her off to her fans, and maybe that's necessary. She has some great songs, but even II Most Wanted sounds wrong for me because Beyonce doesn't balance out Miley. However, I can never seem to escape her music nor her vocals. She's a fantastic singer and has written and performed some amazing, some catchy, and some emotional songs. Beyonce is not Beyonce without her voice.\n\nWith that being said, this was not the album that deserved to win, but I believe the album that was necessary to win. This album for Beyonce feels like she let AI do her homework based on what criteria she wanted and her previous work. Her songs are catchy, and that's cool and all, but when you've been listening to someone for literal decades, you can sense a familiarity in their music. This music doesn't feel like Beyonce. Her last 4 albums sounded like her; different sound, still her. This is \"someone took Beyonces actual country album, tried to replicate it, failed, filled in the missing gaps and then said 'I promise this is Beyonces album\" This award feels like a pity award for neglecting her previous work, and because they got called out. It makes it even more obvious that attention needs to be brought to their nomination and awarding processes. \n\nAccording to Statista, women aren't even nominated for the album of the year as much as men are. \"Between the years of 2013 and 2024, 14.7 percent of artists nominated for Grammy awards were female, and 85.3 percent were male.\" This has been in the media since 2016, but this is the first year they are addressing it.\n\nIf we want to truly be able to criticize the fairness of whether someone \"deserves\" an award, then the Grammys need to be more transparent about their criteria for nomination and awards. Otherwise, we keep falling into this trap of \"did they actually deserve to win.\"\n\n\n\nhttps://www.statista.com/statistics/801372/gender-grammy-nominees/#:~:text=Gender%20distribution%20of%20Grammy%20nominees%20in%20the%20U.S.%202013%2D2024&text=Between%20the%20years%20of%202013,gender%20distribution%20in%20the%20industry.",
    "her country album was trash and shouldn’t have won any awards",
    "It's not that she's a bad singer, I LOVED listening to her when I was growing up. I'll admit I didn't listen to the whole album, but I listened to Texas Hold Em (And that was because it went viral so I listened to it a few times) And I liked it and it's still very catchy, but something about it just didn't feel authentic. To me it just felt stereotypical, like most country music I've listened to doesn't just throw every single thing country related into a song. To me it isn't about color, and I think she's an amazing artist. And I'm still young so I don't know completely about the grammys, I just wanted to voice my opinion.",
    "Beyoncé is so overrated🙄🙄🙄 Billie deserved AOTY award. Period.",
    "I have the album. I’ve listened to it when it was released. I’m a country fan. Just because I don’t agree (AT ALL) with Beyonces win, this dialog of it being because she’s black has to stop. The woman simply didn’t earn it, and to try to write a huge explanation of why is admirable,,,it’s just reaching. She didn’t earn it. And many other artists did better. Every single thing on this planet isn’t about color. Nor are the CMTs required to give her an award when other artists are CLEARLY better at this genera. She and Jay wanted those wins. They used their clout to get them. That’s obvious to MOST people who watched. But, according to you, it’s all about get color. Come on!!!!",
    "I didn’t listen to every nominee for country album so the spectrum of my opinion is limited BUT I did listen to Lainey’s and beyonces and I am blown away at Lainey’s. I think Beyoncé winning album of the year is special and she earned it but best country album should’ve gone to Lainey Wilson.",
    "Beyoncé is not a country artist and shouldn’t have won best country album. Period. That’s like if Taylor Swift was to win best R&B album people would be in an uproar because it doesn’t make sense, that’s not her genre. On top of that, Cowboy Carter was not a great album all together and shouldn’t have even been nominated for album of the year and then for her to win it was insane.",
    "The op wants to say everyone is racist who didn't like that Beyonce won😂😂",
    "> I think it is so telling that people are being absolutely terrible to Beyoncé after the Grammys.\n\nGood opening line. \n> She is genuinely the biggest artist of this generation\n\nAre you sure? Most would disagree. Look at Spotify stream numbers.\n> and people saying that this was rigged are not realizing how hard Beyoncé has worked and that these wins were well deserved.\n\nBeyonce has worked hard her whole career. How was her award at the Grammys different. Did she work even harder this time? Show, don't tell.\n> I’m not saying that the Grammys haven’t been unfair before, but I think people are being too critical of Beyoncé specifically. People have been so quick to bash Cowboy Carter without even listening to it. People are mad that she won for best country album and are making fun of her, but nobody understands the history behind her album and her true motivation. \n\nAgain, show, don't tell. What was the history behind the album? What was her true motivation. If you make claims support them!\n> She reclaimed a genre that has been taken over by white people despite its origins.\n\nThis objectively not true. Country music was derived from many musical traditions including English, Scots, and Irish origins. African American influence only came about post Civil War times. The genre only gained popularity with the Carter Family and Jimmie Rodgers, both of which were of traditionally \"white\" origins (Jimmie Rodger's family was from Ireland.)\n> This was well deserved and shows her impact on country music.\n\nExplain her impact on country music. How did Beyonce change the genre with this album?\n>People are also not understanding how big of a deal it is that she won album of the year. She’s been working for over 20 years and she has more than 30 grammys and not one of them is an album of the year.\n\nAlbum of the year is not determined by how long an artist has been performing, but by how popular their music is amongst her fan and in the genre itself.\n> Billie is only 23 and has so many Grammys, I can guarantee that she will have another shot at album of the year in the near future. (mind you she already has won all of the year) \n\nThis is a good point and goes more to show how popular Billie Eilish is compared to Beyonce. \n> I honestly think people are so quick to dismiss Beyoncé’s career and achievements just because she’s a woman of color. \n\nI give this paper an F\n\n1. Didn't properly discuss the topic\n2. Didn't properly justify the win\n3. Didn't compare or contrast Beyonce against the other artists she won against\n4. Didn't explain how Beyonce impacted country music; Show, don't tell.\n5. Doesn't properly attribute the AOTY. Album of the year isn't earned because one has experience. It's earned because people liked it.\n6. Improper association between Beyonce's age and her popularity. Age of the artist doesn't guarantee popularity.\n7. Didn't stay on topic. Brings race and politics into a discussion about music.\n\nIn short, Beyonce didn't deserve Album of The Year because she's black. She deserved it because people liked it... which I'm not seeing evidence that they did. This was an undeserved win. This is why people are being terrible to her. She stole someone else's AOTY.\n\nEdit: Also before anyone tries to bring race into my comment, I'm American Indian. Which begs the questions, when are more AI artists going to gain national recognition and popularity and start winning Grammys?",
    "Because Its 100% based whatever reason of the judges opinion of artists who are on popular labels for whatever reason the judges choose.\n\nIf you every heard someone say \"Music business\" its exactly like a business. Their product is the artist, just like Apple sells iMac.",
    "The only reason she flipped over to country music is cuz she failed in every other genre of music. Even the country singers that have been in the country music industry for decades do not consider her a country singer. Her husband bought her Grammy and all the whining and bitching and complaining that she didn't win all the other times yeah she didn't win.",
    "Here's the reason why I think it's good. Just because an album has good intentions like Beyonce's does not actually make it a good album. I, unlike most, have listened to it. It is trash. It is unlistenable. 2/10 album. I do not want to listen to it ever again. When I listened to it, I was actually going in thinking it would be good, since that is what I heard at the time. I was mistaken. I think it is simultaneously this and the fact that this year was such a HUGE year for music with so many amazing albums and releases that explains why people are so upset. To be honest, I think literally every other artists who was nominated deserves the grammy more than her. Also, to put it lightly, Beyoncé is overrated in general. She is a great artist, don't get me wrong, but she has the most grammies. She absolutely does not deserve that title. Also, \"Queen of pop\" is kinda crazy considering there are MANY other pop artists who are better than her. I think people are just fed up with Beyoncé being dick-rode to no end and how she is held as some Golden standard when she hasn't made good music in years. Respectfully. I know her cultural impact has been huge and great, but the music is all that should matter in the grammies, and her music is FINE.",
    "What's amazing how people who listen to the likes of Lainey Wilson, Luke Combs, Chris Stapleton, Blake Shelton, George Strait, Reba, Dolly, Alan Jackson, the late Tim McGraw, Brooks & Dunn, the late Charley Pride, Rascally Flatts, Lady Antebellum, Barbara Mandrell, have NEVER heard Beyonce's air play on the likes of Dallas' 99.5 The Wolf... I guess she'll be voted as an outstanding pious woman and influencer in Christian circles next...",
    "I loved the reasoning and logic behind this argument all the way until the end. Loved how you reasoned that Beyonce's album was 2nd top charting country album, which is why she probably did deserve to win that one but I can see argument being made for why she didn't deserve it so also all is fair. But your last few paragraphs that's where you lost me. Maybe you're right maybe  people love Beyonce for being black and a women but can't the same argument then be made for Taylor Swifts grammy wins except exchange black for white. That her being a white women is why she does so well with an award ceremony that hadn't awarded a black women album of the year in the last 27 years until this past Sunday. Maybe we can do that with Adele too seeing how the common listeners thought when Adele won and even Adele to my understanding of that night, everyone thought that was the actual year Beyonce deserved AOTY and not her. \n\nI think she unrightfully got it after complaining for years about how she was snubbed and to be fair in my opinion, some of those years she was. With her husband last year complaining at the previous grammys about how beyonce never won aoty even though she then and still now has the most grammys awards of any artist or group of all time played a factor and made it look a certain way. Do I think Billie Ellish should have won yes, do I think Beyonce won because she's black hell no because if that was the case she would have won album of the year already. And to just hit home the fact that it's not because she was a black woman performing country to break into it or represent for black people...there have been plenty of times in recent history where country music  (CMA's) doesn't award or recognize black artist even when they have number 1 charting hits arguably the biggest country songs over their respective years, being Shaboozey and Lil Nas X. Shaboozey also didn't win any grammys so again I think if we're talking race that argument falls flat. Even with the intersectionality aspect I'm just not convinced. Not including that fact that only 3 black people have ever won period at the CMA's being black and doing country music is clearly not an advantage to anyone, including Beyonce.",
    "Agreed with every one of your points!!! Well said",
    "You reasoning is based off criteria that Grammy doesn’t use. If that was the case, she would have beat Beck in 2015. It’s based off artistic excellence and they mention that over and over that night. She may not of had the highest streams but her album was rated higher than Billie and Taylor’s on every outlet from Metacritic\n to billboard. Billie lost every category, she was never going to win AOTY. She lost to Charli, Sabrina, and Kendrick, 6 noms by 4 people before the last category was even called. Artistically Cowboy Carter was a bit more loaded than hmhas was. In rare cases they choose talent over popularity. Like Beck over Beyonce and Beyonce over Billie.",
    "SO, Beyoncé's new album, just like her last one, has her dipping her toes into a genre that's not really her usual thing. The previous was dance music.  And, yeah, the album's great and dominated the charts. But, honestly, I'm starting to think it's less about her genuinely wanting to explore these new sounds and more about just... knowing she can conquer anything she tries.  \nLike, she's got such a massive fanbase that she's basically guaranteed to win, no matter what genre she tackles.\nIt almost feels like she's going into these genres just to prove a point",
    "This was a fascinating comment! Thanks for breaking down the metrics.",
    "First of all, your claim that Beyonce only got the top album of the year simply because she's black is the dumbest thing I've ever heard. She won because it's actually a pretty damn good album, and it's completely different from anything she's ever done before. That's why it hit the top of the country charts, even if the country gatekeepers refused to recognize the fact that she was even on the charts.\n\nWhat you don't understand, and refused to even acknowledge, is how country music has deliberately kept black artists shut out of the genre for decades---that's just flat-out racism right there. It's only been in the last decade that black artists have started to make any real headway in country music----such as Mickey Guyton, Darius Rucker, Kane Brown, The War & Treaty, Miko Marks, Alice Russell, Brittany Spencer, Breland, and others. Both Guyton and Rucker have been open in the last few years how difficult it was for them to even get into the country genre, and the racism they're had to deal with along the way, just for being black artists in that genre.\n\nThis claim that Beyonce should \"stick to her roots\" is a bunch of nonsense, too. She switched up genres because she got tired just sticking to her roots, and singing the same kind of music she's been singing for years. That's what most artists do----they like switching things up from time to time, to keep themselves sounding fresh. I've noticed that white artists get to do this all the time--hop from genre to genre, but black artists are only supposed to stick to singing R&B, gospel, jazz, and hip-hop, as if that's all they can sing or perform. It's an insult to black people to think that's all we're supposed to sing, and it's a bunch of BS.\n\nBeyonce literally grew up Texas, where so many country singers come from---that it's not even weird that she should actually be into it. The country music genre has been too lily-white, and too conservative, racist and stuck-in-the-mud for damn near a century know---and that's way too damn long. The country gatekeepers still act like it's the 1950s or something. White people do not have a claim on country music---that is, they are not the only ones who can play it, sing it, or write it, or even like it. Yet the white country gatekeepers still act like nobody who isn't white can't claim country music as their own. Screw that outdated, outmoded BS.\n\nThe fact that Beyonce hit the top of the country charts is proof that even white people don't mind listening to country music that isn't sung by a white person for a change, and that even they're tired of the same old same old whatever in country music. . That's being said, I'm glad she won, because she deserved to win. She didn't take a damn thing from Billie Ellish or Taylor Swift, who are allowed to sing whatever the hell they want, like most white artists do. Funny how no one mentions the Swift started out as a country artist herself, and how many white pop singers have had hits on the country charts over decades. Yet a black artist like Beyonce tries to do the same thing, and some white folks who like country act like the sky caved in, just because she did. It's so damn ridiculous. If she was white, we wouldn't even be discussing this.",
    "i mean one of her albums literally changed the charting schedule for the whole music industry  so yeah she's pretty big lol",
    "The CMAs would be broadcasted in white hoods and burning crosses on stage before they give an award to a black person",
    "why are we not talking about the fact that the Grammys were fixed back in 2016 when she was supposed to win for album of the year and it was given to Adele? It was the most critically acclaimed album and the most successful, YET given to another artist? It’s the same reasoning everyone is having for Billie, 2016 was a SNUB. If they cannot put their own likes aside and understand that Lemonade was a FANTASTIC album, then people are blinded. It’s the same reasoning that everyone is having for Billie Eilish.",
    "Um, she spent five years making this album, she didn't just throw it out there, and the fact that it hit number one on the country charts means that she did earn it. She didn't go to the country station to promote because, to be frank, there was such a hateful backlash about her even having played at the CMAs in 2016, even thought she was invited to play there by the Dixie Chicks (they just call themselves the Chicks now) to do a song with them. She got a lot of hate simply for showing up there, which was so damn ridiculous, and hell yes, it was all about her being black. You just refuse to admit that racism has anything to with why there was such hate thrown at her from the CMA audience.  Explain to me exactly what Post Malone and Jelly Roll did to earn being country singers, even though neither one did anything like country before last year. What exactly is your definition of what one must do to be considered country, anyway? \n\nOh, and Beyonce didn't have to use her clout to get anything. The point being, I've never heard of a artist who was nominated 32 times, but never won anything. I can't even think of a single white artist that's happened to. She earned it, just like most artists who get Grammy noms or wins have. Clout alone does not get you a Grammy. As usual, none of you trolls know what you're talking about on this subject.",
    "Lainey Wilson is actually a pretty good singer, but let's be real-----most of these country singers--who are mostly white, of course---start to all sound alike after awhile, and look alike. There's really nothing original or new about the way most of them currently sing. It's like they all have to stick to what an image of a country singer is, and never go beyond that. Which is why country has become so conservative and boring. Which is also why these new black country artists coming up are putting some fresh blood into it, even if the country gatekeepers themselves won't admit that. Country needs to change just like any other musical genre, or grow stale as hell----it can't just keep being stuck in the past forever. That goes for any other musical genre, but country just seems more stuck in a rut, and not wanting to move forward---as if its gatekeepers want to stay stuck in the '50s or something.\n\nAnd it's been nice to see more black country singers coming up, because their mere presence is challenging this old racist idea that country can only be an-all white space, which it's been for way too many decades, and why the hell that is still even the case. That old racist idea that country music is only for white people, when both black and white people started out playing and singing country music together in the mid-1800s, only started in the 1920s, when white guys in the music biz trying to market certain types of music decided that country music--i.e. white people singing and playing guitars--would only be marketed to white folks, while black folks playing guitars would be marketed to them separate as \"the blues\". And it's been that ever since. This is the 21st century----this old, tired-ass racist, completely out of date idea that country is only for white people needs to stop, and be buried somewhere.",
    "Why wasn’t Cowboy Carter a good album? Nobody has provided a valid reason for why the album “wasn’t good”. Also that’s a stupid comparison. If Taylor Swift MADE an r&b album then she would be nominated. The category is best country album, not artist. Cowboy Carter was a country album through and through so that’s not a valid reason at all for why she shouldn’t have been nominated.",
    "Beyonce didn't steal a damn thing from anybody---that's a bunch of stupid nonsense---her gain is not somebody's else damn loss, so get off that. She made a damn good country album, which nobody expected, and finally got a long overdue award for it. It went to the top of the country charts, meaning that enough people liked it to get it up there in the first place. It's made an impact because she also used it as an opportunity to showcase some new and upcoming black country singers, and to show and prove that country music is no longer just a \"white thing\", or something only for white people any more.\n\nAnd your claims that country music is lily-white just goes to show that you don't know jack about black Americans' contribution to country music. Hell, the banjo itself is an instrument that was invented in Africa by Africans in the 18th century or so. These articles show that black American musicians had far more of an influence on some of the first white country singers than they were ever given credit for, and that both black and white musician play what would come to be called \"country music\" until it got segregated for marketing reasons in the 1920s, and the contributions of black country musicians got completely whitewashed out of country music history, and brushed aside, ignored, and forgotten in order to sell country music as a \"whites-only\" musical invention, which it never was to begin with:\n\n[Black Artists Helped Build Country Music, Then It Left Them Behind](https://time.com/5673476/ken-burns-country-music-black-artists/)\n\n[A Dive Into The Black History of Country Music: Giving Credit Where It's Due](http://skidmorenews.com/new-blog/2022/2/23/a-dive-into-the-black-history-of-country-music-giving-credit-where-its-due)\n\n[Country Music Has A Problem: It's Not Beyonce](https://www.thecrimson.com/article/2024/3/5/beyonce-tops-country-charts-first-black-woman-history/)\n\n[The Black Origins of Country Music](https://jaxmusic.org/jme/2022/06/the-black-origins-of-country-music/)\n\n[Not Their First Rodeo: Black Musicians And The Birth Of Country Music](https://hnoc.org/publishing/first-draft/not-their-first-rodeo)",
    "me when i just talk to talk without actually knowing why the album was made in the first place. anyways name one genre she has “failed” in💀. At this point this sub just hates beyonce because it has been standard practice to do so for so many years now and yall have just stopped putting any critical thinking into your posts/opinions. Wether you like beyonce or not, saying that one of the top 25 best selling artist of all time has “failed in every single genre” is just laughable.\n\n\nAlso, beyonce has never publicly spoken about not winning AOTY. actually she doesnt speak at all. This is why people like you and the rest of this sub feel so comfortable projecting your own opinions about Beyoncé onto her & putting words in her mouth.\n\nBeyonce has never publicly said anything about not winning album of the year.\n\nBeyonce has never said she didnt win album of the year because of her race.\n\n\nBeyonce did not say anything about not being nominated at the CMA awards.\n\n\nBeyonce did not say anything PERIOD.\n\nIn conclusion: please stop projecting your own made up stories, conspiracy theories, thoughts & opinions onto another person, whom you do not know and trying to put words in said persons mouth that never came out of them. This sub has been doing this for almost a decade now and it just gets really boring. Even you guys have to be tired of every single think piece/unpopular opinion post/discussion thread on this sub being some form of “beyonce bad/overrated” talk💀.",
    "Take a chill pill, like everyone else, I'm just giving my opinion...Who wins a Grammy doesn't affect my life in anyway.",
    "I mean we all have access to the internet right in order to use reddit am I wrong here? Linkin Park has no #1 Hot 100 billboard songs, 3 top 10's, and 26 total top 100 songs. Beyonce on the other hand has 9 # 1's, 24 top 10's, and 106 top 100's (sources below)... we're all entitled to our opinions and if you prefer Linkin Park more power to you, but when it comes to top 100's yeah thats a no. And obvisouly this wasn't including genre list like top rock songs or top r&b because they don't cross compete. But beyonce has more charted songs in her genres/subgenres than Linkin Park does in theirs so yeah. And I came to this post to talk about how I think she shouldn't have won AOTY and I'm not really a beyonce fan\n\n[https://www.billboard.com/artist/linkin-park/](https://www.billboard.com/artist/linkin-park/)\n\n[https://www.billboard.com/artist/beyonce/](https://www.billboard.com/artist/beyonce/)",
    "you? maybe speak for yourself, i understand both things but peoples hatred or rejection towards beyonce has nothing to do with that",
    "One has nothing to do with the other! what the fuck are on about.",
    "Lol, the opposite is, in fact, true. There’s little that country music would like more than to expand their audience. Why? Because people care about money before anything else.",
    "People forget that even Adele herself, when winning an award again a few years back (after 2016) said right after she was given her award---that Beyonce deserved that award, period. Or maybe it was 2016---I can't remember. The fact that even she said that should have made people wonder why Bey still didn't win that time, given how huge and impactful Lemonade was on the popular culture scale when it came out. .",
    "You spent a lot of time writing this. And I appreciate your dedication to Beyonce. Im sure it helps you feel better about calling certain people racist. But,,,,I said what I said. Read alllll the other comments on this thread. Look on social media in general. You are one of very very few people who thinks this album is Grammy worthy. Not with the other albums that were presented. \n\nYes. There are racist people. Is the majority of the population racist? Not likely. This album had no business winning against artists like Lainey Wilson, or Chris Stapleton. It was bought. And let’s be real. Billie Eilish had a better album. The majority of the nominees did? Did YOU listen to the other artists albums? Cuz I have. Most of them. If you were honest, you would listen, then re-evaluate your thoughts. But you are going to say all those artists are white. Meaning they don’t deserve to win, and if they did, it’s because “racism”. \n\nVery few people think Bey deserved it. I’m a fan of hers. I own Cowboy Carter among some of her other work. And I understand and comprehend that just because she made an album outside her normal genre, it DOES NOT MEAN she deserves these accolades. The album simply wasn’t as good as the others. Period!!!! Morgen Wallen got his first Grammy nomination with Post Malone this year. His first. Such a joke. Do you know who Morgan Wallen is? Have you listened to his music?? It crushes most of the country albums out there,,,,,,and yet the Grammys never nominated him. Till this year with Post. Why is that? It’s odd to me. It’s odd to me that Cowboy Carter beat out a huge country artist that has arguably one of the most unique voices:Chris Stapleton. We could call this racist. Cuz I’m telling you, and you should hear this: It isn’t only white people who are racist. The way it sounds,,,,,is that YOU are the one who determines who should receive accolades based on color. Not achievements. \n\nEveryone who is country knows that the CMT’s are the serious country awards. They arent having it, hun. Maybe part of it is Beyonces boo-hoo attitude of, “They don’t like me, they must be racist.” Her husband whining and crying last year. Give me a break. She  just EXPECTED to win. Because she’s entitled. She didn’t get recognition at the CMT’s……so she and her fans scream “racism”. I’m so sick of it. That whole dialog of racism every five minutes by someone. Stop. Everything isn’t about race. But,,,,to you, it seems to be. \n\n\nAnd I’m sorry, hun. But the majority of the population feels this way. You can’t call everyone a racist. It’s just,,,,wrong. She won because she and her husband have power. Everyone knows it. History will remember it that way. Mark my words. I’m sure she can live with that fact. She seems to have no shame at this point. Can’t even PRETEND to be surprised when they announced her as the winner. \n\nCome on!!!!!🤣",
    "Here's some good recent books about black folks' contributions to country music:\n\nMy Black Country: A Journey Through Country Music's Black Past, Present and Future, by Alice Randall---the author writes about her love of country music, and what it was like being one of the few black country songwriters in Nashville in the early '80s, and the racism she had to deal with at the time.\n\nBlack Country Music: Listening For Revolutions by Francesca T. Royster---this book is about the author's love of country music as a queer black woman, and what it's like being a black country music fan.\n\nDeFord Bailey: A Black Star In Early Country Music, By David C. Morton---this is the first book I've ever heard of written about Bailey, the first black country musician to play at the very first Grand Ole Opry, and who is credited with introducing the harmonica to the genre.\n\nCountry Soul: Making Music and Making Race In The American South, by Charles L. Hughes. This book goes into detail about how black country musicians' influence on their white contemporaries rarely translated into them getting any support for making their own country albums, or even trying to make a career out of it because of the racism in the country music biz.\n\n\n\nHidden In The Mix: The African-American Presence In Country Music, edited by Diane Pecknold. This is an interesting anthology of essays about black folks in the country music genre.\n\n\n\nThere was also another book called From Where I Stand: The Black Experience In Country Music, but it appears to be out of print. There was also a 3-CD box set with that same title that came out back in 1998, featuring the work of black country artists I'd never heard of at the time---I'm guessing the book was a companion to it. That same CD box set has been updated as of last year with a fourth CD, featuring a new collection of black country artists that have arrived since 2000. Here's an article about that:\n\n[Country Music Hall of Fame Spotlights Black Country Artists With Expanded Version of \"From Where I Stand\"](https://www.billboard.com/music/country/from-where-i-stand-set-expanded-set-country-music-hall-of-fame-1235697619/)",
    "Hot 100 are weird metrics, but yes, Beyonce beats them in that single category because she focuses mostly on singles and feats. Take out all the songs with feats and you're down to like, 5-6  tops with anything more than 1 week on the chart.\n\nLinkin Park has more top 10 and top 200 songs overall and an Album that absolutely destroys any metric compared to her albums with more top 100 AND nearly doubling the total time being on the charts (Hybrid Theory).\n\nThen keep in mind Numb has 2.4 billion views on Youtube And In The End with nearly 2 billion, compared to Beyonce's Halo (1.4) and Single Ladies (1) billion respectively.",
    "You got obliterated and never came back hahaha",
    "When did I ever say free speech is okay until it’s a black person?",
    "Ur literally all up in this thread embarrassing yourself and if you had a bit of literacy you would’ve noticed I was defending jay z as well as Beyoncé. I’m all for the enthusiasm fighting implicit racial biases but you’re literally providing nothing of substance when everyone here is looking to have nuanced discussion about her win. I love beyonce too but boo u need to hop offline ur heated",
    "chill the fuck out. jay z and beyonce aren't the pinnacle of blackness. im fighting ppl left and right based on their reaction towards kendrick bc THAT is racism, beyonce and jay z are just annoying.",
    "ur calling someone else delusional, the call is coming from inside the house. get ur shit sorted first 😭",
    "She’s a black woman that is not solely a country music artist so that does have something to do with it. Have you even listened to the album before calling it shit? What does Kanye have to do with Beyoncé he literally got kicked out two minutes after he got to the Grammys.",
    "He’s the only example anyone here has been able to sight. It’s like the CMA’s version of “I’m not racist, I have one black friend”",
    "First of all, I write a lot about subjects and things I like, just like anyone else on these boards. I'm not and have never been a part of the \"Beyhive\". I'm simply someone who liked Destiny's Child when they first came out, and thought all three of the ladies in the group could sing, and followed what each of them have done songwise since. Second of all, you're just mad that she won, and that your favorite artists didn't. Come on now----Beyonce winning is not taking a damn thing away from either Ellish or Morgan---everybody already knows who they are, and they're famous, too. So get over whining about them. The fact is, black artists have always been shut out of and ignored by the country music business, until recently, no matter how talented they were. That's just pure racism, pure and damn simple. Why else was Charley Pride the only black country artist they let slip in for decades? It darn sure as hell wasn't because they weren't any other equally talented black artists who wanted to sing country music. Also, how many white artists as talented as Beyonce do you know who have been nominated 32 times at the Grammys and still never actually won one? Can't think of one, can you? I thought not.\n\nThe thing is, white artists have always been allowed to jump into any genre they want, and still sell CDs, and win awards and prizes for them. Black artists are still expected to only sing gospel, R&B, or rap simply because they're black, told to stay in their lane, and not allowed to jump from genre to genre and experiment/mix things up---which is really ridiculous, in this day and age. Which is what Beyonce did, and some white folks who still have this outdated as hell racist idea that country music is only for white people to play and sing, are just so damn mad that she didn't go through the usual country music gatekeepers and just went straight to the top of the country charts without their permission.\n\nKeep in mind, Beyonce did go perform at the CMT's in 2016, to which she was invited, and she got such a nasty backlash from the audience there, that of course she never went back. The CMT even performed the gutless move of cutting her performance out of that special, which was even more pathetic. Basically a lot of white people just flat-out hated the fact that a black artist period was trying to sing country music at the CMT. It didn't matter that she came from the same state as a lot of country singers, and grew up listening to it and liking it, their attitude was that she had no business being there because she was black. I guarantee you if Taylor Swift (who started out as a country singer) had done the same exact thing as Beyonce, nobody would have a single damn problem with it, and you know that.\n\nYour opinion is just that--your opinion,period---you do not represent the \"majority of the population\" and it's really arrogant and laughable of you to think that you do. Once again, the fact that she went to the top of the country charts proves that she finally earned that Grammy. She's an artist who has always pushed and challenged herself to put out the best releases, when she could have just sat back, took it easy, and coasted on her back catalog.\n\nEven after over 25 years of being in the music biz, her music still sounds fresh, which isn't always the case with pop or R&B artists who have been around as long, or longer than she has. That's why I continue to listen to her music, because I appreciate artists who continue to push themselves musically. Your ridiculous claims that she only won because of her clout are so damn ridiculous. If she could use her clout to win, then how come it took her so long to get a Grammy? Your reasoning about that dosen't even make any damn sense when you really think about it. You're in complete denial about how racist the country music biz is and has always been. That why I posted those articles about country singers Mickey Guyton and Darius Rucker discussing how they're always had to deal with racism throughout their careers as black artists in the predominately white country music industry. Obviously you didn't even bother to read them. It's easy for white people to be denial about racism because they never have to deal with it at all, or just pretend that it dosen't exist, because it never affect them at all.\n\nAnd you keep claiming that Beyonce didn't \"earn\" her Grammy or the right to even be on the country charts---well, explain to me how Post Malone, a pop singer, and Jelly Roll, a former rapper \"earned\" the right to be on the country charts when neither one of them, like Beyonce, were even a part of the country music scene? Funny how nobody has a problem with either one of them switching to country music, even though they're not even traditionally \"country\". I find it interesting that when I asked that question in a previous post, you ignored it completely, and never bothered to even answer that question. Because you know good and damn well it's because they're white. If they were black, they would have never been accepted that quick into the country fold.\n\nAnd there have been plenty of white pop artists that have crossed over into the country charts, like Olivia Newton-John, Jewel, and plenty of others. Yet nobody ever whined about them being on there, and yet white artist still do that with no whines or complaints about them doing the same thing Beyonce has done. Nope, apparently it's only a problem when black artists do it. So stop trying to twists things around and acting as if the very bringing up of the existence of racism is racist---that's just straight-up stupid as hell, and it's always been a reality that black people have had to deal with. You're just pissed off that it's even brought up in the first place--you need to ask yourself why, instead of just whining about it because you didn't want to hear it.\n\nI guess you forgot that part of the Grammys where the head of the Grammy voting committee had to explain how there had been changes over the past few years---especially since there have been other black artists complaining over the years about how they feel that black artists didn't get enough recognition at the Grammys. Heck the Grammys didn't even acknowledge that hip-hop existed until the early '90s, when it had already been around for just over a decade.\n\nAnyway, Beyonce won, so get over and stop whining and complaining about it yourself. I'm still loving the fact that she finally won, and that she deserved it, lol. That isn't just my opinion, it's a damn fact, which is backed up by her having won in the first place.",
    "i sound ignorant for pointing out systemic racism and discrimination LOLLL?",
    "So basically… her team won, not her… cause I can almost promise you that Beyoncé isn’t the reason that album has “quality” if we’re talking sonically. I seriously don’t understand how she won.. and I haven’t even listened to the album. BECAUSE I DIDNT EVEN HEAR ABOUT IT. I am usually atleast semi caught up with releases in the music industry. I have not heard about this album until like 2 days ago, can’t be that good 😭😭",
    "i wrote the post, if i decide that i want to respond to your bitch ass i’m gonna do it",
    "and 1.2 billion of those viewed it to try and make sense of how it got best anything.",
    "lmao i was agreeing with you and defending your point against the other person lmaooo i was just using some dry humor/sarcasm sorry if that didn’t translate well over a reddit post😭",
    "No...its garbage.  Like for real.  I wouldn't even download it for free",
    "Darius won the new country artist award when he jumped from college rock to country, so whats your other argument? \n\nAnd to be honest I think all of Beyonce's tracks are shit. She tried to \"conquer\" another genre and fell right on her face. Then when the CMAs didn't recognize her efforts, they were immediately bigots and racists. Give me a break\n\nYe was there to make sure Beyonce won album of the year.",
    "Charly Pride won in the 70s. When the genre is white guess who's going to win. \n\nYou guys are just trying to justify racism when it's not that. This is why discrimination will never leave because everyone is looking to be offended by the smallest thing.",
    "You sound young AND ignorant if you REALLY believe that everyone is racist because they don’t believe Beyonce earned those wins. I appreciate you strongly defending your position, but it’s simply not true. Yes. There are some racist people. But everyone who disagrees with this win is not racist. And saying things like that will only haunt you later in life.",
    "You do realize that you said \" you clearly can’t understand the hardships that poc face on a daily basis\" then the same sentence you chastised  Specialist\\_Age7644 by saying \"so for you to say it has nothing to do with “color” is very ignorant. (also color is an outdated term, use race instead)\" .......... You just used the term POC and Color yourself, anywhoo \n\nNow regardless of whether Beyonce is she/ him/ they/ them/ white / green/ black or polka dotted . It was is a Shit album. I don't think it deserved anything other than a game of Frisbee out the back yard (Vinyl version of course)",
    "It did not translate at all but tbf I’m horrible at catching sarcasm.",
    "Beyoncé is also a woman, let’s not forget that area of discrimination. Can you name other Black people that are truly successful in country music, a genre that has major ties to Black history? Her music has meaning and she makes tracks that people can relate. Why exactly is it “shit”. Music is purely subjective to the listener and generalizing every song she has ever made makes no sense. She has made hits for years and no two songs sound the same, so how can you say “all her tracks are shit”. Kanye got kicked out of the Grammys right after he got there, so stop trying to find some sort of association there. Beyoncé made a great album that reclaims the genre, and that is undeniable.",
    "Since when is country a white genre? A whole ass genre that was invented by black ppl by the way💀. Also saying the CMAs are not exclusive because one black person has won makes no sense. thats like me saying the BET awards are not exclusive to black people because Christina Aguilera or whoever may have won one once",
    "that is not even close to what i am saying, i definitely did say that beyoncé is getting more hate because she is a woman of color, but i didn’t say that everyone who disagrees is racist. music is subjective and that is major part of what plays into the hate. i responded to your comment because race is still a big part of the dismissal of beyoncé accomplishments and careers. she has been set back before because she is a black woman, i.e. the CMA’s. beyoncé has said herself that she hasn’t felt welcome in the country music scene, and i wonder why…",
    "i was quoting what that person said and person of color is the correct term, so i don’t what exactly your point is, but try again next time.\ngood for you if you think the album is shit… it told a story and had quality music, but you’re entitled to your opinion and so am i",
    "wtf are you talking abt, correct abt what",
    "LOL i don’t use reddit all like that im sorry😭i was trying to support ur point",
    "y'all both need to chill tf out im not against black ppl here lmfao",
    "They are all shit. They do nothing but pander to the sheeple, who think they can't do anything wrong. She was losing big time to Taylor Swift so she had to \"find\" another outlet and it failed.\n\nBut the Queen B can't do anything wrong..... except make country music. She tried to jump on the bandwagon like Kane Brown and Lil Nas X. \n\nQuit listening to what the records labels tell you to listen to and make up your own mind. Top 40 music is just for the sheeple, if you want to find real musicians dig through bandcamp and soundcloud to find real artists. \n\nAnd quit getting your panties in a bunch over Ye. It was a joke regarding his actions at the MTV awards. Sheesh ... \n\nAnd btw here's a small list of black country singers who are female:\n\n  \nMickey Guyton\n\nLinda Martell\n\nBrittney Spencer\n\nRissi Palmer\n\nReyna Roberts\n\nMiko Marks\n\nRhiannon Giddens\n\nYola\n\nTracy Chapman\n\nAllison Russell\n\nTina Turner\n\nAdia Victoria\n\nEtta Baker\n\nMavis Staples\n\nBrittany Howard\n\nKaia Kater\n\nLeyla McCalla\n\nCandi Staton\n\nMuni Long\n\nValerie June",
    "Omgf!!!  Now it's the woman card?  The way you tell it, we all would have thought we were still in 1950's racist America. 😆😁😁 Child go somewhere with all that",
    "Read all the above comments from others about other black country artists. She is not the first to enter the country world. Lemme ask you this??? Have you listened to the competing artists albums??? Have you? Under Country or best album? Any of them? I’ve listened to many of the albums. Music is subjective. You are right. But when the majority of people think she SHOULD NOT have gotten those awards,,,,you have to ask why? And YOU are saying racism plays into that. Perhaps her album just wasn’t that great. People are voicing that opinion. That other albums are better and did better. It’s obvious her clout got her those awards. It’s fine if you are a fan of hers. I appreciate your defense of her win. But you can’t say it’s all racism. People just think the album is not the winner. Thats all.",
    "And how many of these women chart or are mainstream? I listen to Cowboy Carter and to Beyoncé because her music is good, not because some record label tells me to. You are in denial that Beyoncé has changed the game and that’s it. She won awards, got streams and at the end of the day is still winning.",
    "Uh, no-----it's because for the longest time country music pretty much ignored black country artists and never accepted them. Yeah, they let Charley Pride in the door, but that's mainly because he was selling a lot of records, and didn't rock the boat, so to speak. And it was the usual case of, they had their one black person, and that was all they needed. \n\nI used to like some country songs as a child, but as I grew up, it became harder to really like country as a whole when I never saw any country artists who looked like me, and there's the fact that country music itself was always associated with racist rednecks who hated black folks, and deliberately shut them out of the country music business for years--making it seem like country music was exclusively for white people and white people only---which it was, for a long as hell while, and for too damn long, to be honest. \n\nMore black country artists have been coming up in the last decade, which has been great to see, and aren't keeping quiet about how ingrained the racism in the country music business really is toward black artists even today. Heck, in the last decade the country music gatekeepers have been accused of not even giving female country artists enough play on radio station, and prioritizing male country singers over them. Talk about going backwards. \n\nHere's an interview with country singer/songwriter Frankie Staton, who started the Black Country Music Association back in the '90s, along with singer Cleve Francis, as a platform to help black country musicians get a foothold into the business, and what a difficult struggle it was, since Nashville pretty much ignored them,and had no interest in pushing black country singers at all, no matter how talented they were, she said. Which is why the BCMA only lasted barely a decade. There's a Rolling Stone article from a few years back that goes into more depth about them, but Staton talks about managing to carve out a space in country music as a songwriter, dealing with yep, racism, even just for trying to be a songwriter, and the impact Beyonce's Cowboy Carter has had on country music for black country musicians in the article from last year:\n\n[Frankie Staton On Building a Future For Black Country Musicians](https://floodmagazine.com/154727/frankie-staton-feature/)",
    "music is subjective and beyoncé won for best album for a reason. her album tells a story and is a compilation of songs that come together to form a narrative. i stand by the fact that it was deserved and that she has been snubbed in the past due to racism. the academy also doesn’t go based on whether the song is “good” or not it’s also about the artist’s accomplishments on the charts, how the album comes together, and whether the music has true quality or not. beyoncé has dealt with racism in the past and she continues to as well. i want you to go take a look at twitter and see some of the racist shit people HAVE actually posted after her wins. not all the haters are racist, but there is no denying that racism has played a major part in the hate she has gotten throughout the years and also the discrimination she has faced in the industry. no one else is getting as much hate as beyoncé after the grammy’s even though so many other artists also beat out billie eilish and others.",
    "I don’t feel like she “reclaimed” anything. She essentially made a pop album with some country typical instruments, threw some big name country legends on it and called it a day. If anything, she took away from black female artists that are true country artists. They are the ones we should be recognizing. Not someone who has been famous for the last 20 years, and is making the switch because country is cool right now.",
    "All that’s being said, is that her awards were bought. You are defending the win…and that’s fine. I’m black, and have walked this planet much longer than you. I’ve experienced racism. And I’m very aware of our history. But, when I commented my opinion, your FIRST response to me is, “Are you white?”\n\nYou basically lost credibility when you asked that. Why? Because you asked that, and were fully prepared to lecture me about oppression because you thought I was white. \n\nThis is why I’m telling you to just stop. Please, stand up for our rights as black people, but don’t boo hoo and make it sound like Beyonce is struggling through horrible oppression. Or that racism is the primary reason she is getting this hate.\n\nHer husband threw an embarrassing fit last year, and this year she wins? You think it’s all a coincidence?\n\nMoney and power can buy just about anything. That’s what occurred. And as much as you want to say Cowboy Carter told a story or whatever,,,,,it shouldn’t have been the winner.\n\nBut it was. And we will all move on. But just know, that very few people think she deserved it. Not because of her color, but because the content of her album was not that great. Not at all.  Beyonce will live the rest of her life under the shadow of this award. Because, although her and Jay think they earned it….few others think she did.",
    "In 2016 when she performed her county song, Daddy lessons from her album lemonade at the CMAs with the chicks and she felt not welcome but she still decided to summit the the song for best country song at the Grammys but they told her that it wasn’t eligible. So she went to work and worked on two albums, which are now act one Renaissance and act to Cowboy Carter, but the thing is Cowboy Carter was supposed to be at Act One and Renaissance supposed to be Act Two but because of the pandemic, she felt that it would’ve been best to release Renaissance first to lifted people up and it’s true because her last track on Cowboy Carter transitions into the first track on Renaissance.\n\nSo when was time to release act two she already did the work, the proof is in the album. Not only that had three country legends: Linda Martell, Dolly Parton and Willie Nelson she also brought on five young black country artist: Tanner Adell, Brittney Spencer, Tiera Kennedy, Reyna Roberts and Shaboozey who’s music  numbers boosted after the release, especially Shaboozey who’s song, A Bar Song(Tipsy) just entered its 27th week surpassing the weekends, blinding lights. Beyoncé was also promoting the girls, especially putting their names on billboards. Wow promoting the album which all of them said, help them gain new fans. \n\nAnd because of her album of the year win they just won their first Grammy. And she dedicated her win to Linda Martell.\n\nThe album is very thought out with from the instruments being played by Stevie Wonder harmonica, Paul McCartney and Nile Rodgers on guitar and Rhiannon Giddens on the Banjo to the fact that each song is it own reimagined version of a western film.  \n\nThe album is predominantly country with a blend of Americana, pop, blues, folk, classic rock, hip hop and R&B and because of her Texan roots she also blended in zydeco, rock and roll, psychedelic soul, rhythm and blues, funk, gospel, bluegrass, opera, rock, honky-tonk and go-go. And also international musical elements as well like Flamenco, funk Carioca and Irish folk. Hence her saying this is an a country album. It’s a Beyoncé album and on track 12, Linda Martell says the line “genres is a funny little concept” and on track 19 saying “ this particular tone stretches across arrange a genres and that what makes it a unique listen” \n\nSo don’t act like she just woke up one day and wanted to do a country album without knowing the history, there’s a woman putting in the work and credit everyone that was involved with the album and that including the songwriters and producers of songs that she sampled for the album. This is the same woman that credit her husband on a song for just clapping.",
    "I found the comment that expressed exactly how I felt; word for word.\n\nIt would have been a better move to include people she felt were being ignored in country music so she could boost them as well as herself and find some credibility on the way. Instead it feels like she's reaching for credibility by including all these big names in country which kind of makes the album feel nepo. This also does kind of feel like a revenge album, and does feel a little forced because it still feels like a pop album with country elements. And it's not like Taylor Swift hasn't done the same, but Beyonce is supposed to be a leader, not a follower.\n\nBut on the other side, the album in and of itself is a statement, and that's enough for me. If this doesn't prove that the grammys is rigged and that she should have won before, and that it's a pity award for messing up, I don't know what would.",
    "there’s no way of knowing if she bought the awards or not. idc if i lost credibility this is reddit not a dissertation 💀. she still has faced discrimination and i stand by that. ignoring that discrimination creates a narrative that her career has been a breeze, which it hasn’t. her awards are deserved, she is genuinely the best vocalist of this generation and i stand by that as well. agree to disagree i guess. just because i’m young doesn’t mean i don’t understand how society and the world works. i still stand by everything i hv said and if you disagree that’s fine, beyoncé stays winning and that’s a fact.",
    "There'd be no reason to watch the award shows if the winner was the artist with the most plays in x category.",
    "the grammys have always and will always be an industry networking event that aligns around celebrating artists who have been successful that year. you might find a curveball winner every now and again (arcade fire with the suburbs, for example), but it’s predominantly an industry event to mingle and pat each other on the back.",
    "I agree with you completely.  With that said, I was stunned that Sierra Ferrell won 4 Grammys--because she was the artist who most captured my attention in 2024.  But I feel that in the ignored categories (like Bluegrass and alternative country), the nominations tend to be more based on merit because, frankly, most people have never heard of the artists in those categories.",
    "You think the Grammys are about artistic merit? lmao",
    "Alright I'll play. \n\nDefine \"artistic merit\" for me.",
    "I mean, I’m sure the recording academy has that defined. It’s why their members are composed of artists and members in the industry. If what they wanted was award the numbers they would all be streaming and radio executives .",
    "What makes a particular song or album good? I'm sure you like some songs that I don't like and vice versa, so clearly two people can have different ideas of good music. Art is subjective, there is no scientific measure of \"good.\" The very concept of \"quality\" is a matter of endless philosophical discussion. What *is* quality? \n\nI don't have a problem with artistic awards, but I think it quickly becomes a problem if people take it too seriously. I don't think it's possible to define something like art with rational language, which makes the whole thing kinda silly. I'm not saying we shouldn't do it, but I think the harder we look at it, the less sense it makes.",
    "That’s bullshit . They were invited . Issues came from showing up naked",
    "Parading his puppet around. Sick people",
    "Butt naked.\nWtf.\nLeave that shit at home.",
    "Stop spreading fake fucking news.",
    "Bianca Censori is like an actual real life NPC. She never looks like there's anything going on upstairs. I honestly don't know whether or not to feel bad for her or be repulsed by her.",
    "Celebrities at the Grammys just… so many of them are so ridiculous looking. This is just insane though.",
    "Their parents must be so proud!!",
    "she has no soul left in those eyse, completely empty in her head\n\nman, Kanye is a creepy mothefucker",
    "The way he parades her around like an object is pretty disgusting, she must be at his same demented level to accept all of this. And I'm not going to say anything about how he married a Kim Kardashian lookalike",
    "Being arrested would bring them both down a peg. I kinda feel sorry for her. He's a fool. She seems like a victim.",
    "Well for good reason too, she looks like sex trafficked victim at this event . Meanwhile, this is a black tie event",
    "When you have too much money and fame and you feel society norms don’t apply to you. Seems like it’s becoming a trend.",
    "They both should have been arrested and banned from the public eye",
    "Ye acted horribly.  She did not want to show herself.  He was a husband dead set on publicly embarrassing his wife.",
    "She looks so embarrassed, scared, humiliated. I have never heard her speak even. Is she allowed to?",
    "They were literally nominated for an award 😂",
    "these morons are puke. why is news being posted in music?",
    "He was invited\tMatter fact this whole sub fucking retarted Yall believe anything the media spoon feeds you Well \tguess what bitches the media isn’t everything I’m tired of yall stupid ass dumbass fatherless idiots thinking that anything the media tells you is true\tFuck yall and this entire sub Go enjoy your Taylor swift record  \tI don’t care if I get downvoted\tThe fact you guys respond and reply is enough to prove you will do fucking anything to talk down on this innocent man \tGo Eat a dick\t\tAnd also I’m tired of how you people will talk down on anyone who opposes your agenda \t\tPeople out here die and you all would rather want to see an innocent man kill himself\tGet a life you miserable evil people You disgust me\t\t\tYou’re almost as bad as Tr U mp\t\tMatter of fact mods come here u/stabbinU u/stabbinU\t\t\tBan me from this retarted sub \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tYe 2028 ✌️💯",
    "You don’t get kicked out of something when you couldn’t get in in the first place. If they stone you at the gate because you don’t have a ticket, you don t claim they kicked you out of the Super Bowl.",
    "I wish the Daily Mail would redact itself. It was a nasty, small minded little newspaper before it became a nasty, small minded clickbait website",
    "I wouldn't be surprised if he was directed to do this as a distraction to the public",
    "People like you are reaching so hard lmao. She’s been dressing/styled like this since before she met Kanye. You’re just spouting out nonsense because you dislike him instead of having anything to substantiate what you’re saying.",
    "The real hero of these comments.",
    "Wow",
    "what price a good night sleep without a worry in the world?\n\ni'm richer than they'll ever be. and yet. you dream of them.\n\n  \n\"Because one speaks to legitimate need and one speaks to the ego of the elite.\"\n\nlol you're just another very confused young man.",
    "Where the fuck is your punctuation",
    "The guy is defending a nazi billionaire while also comparing a billionaire as someone who isn’t a good artist. Amazing.",
    "Yeah. I can 100% see someone doing this as a statement, a performance piece, a political disruption, etc.\n\nBut I would expect someone doing something like that would do it with a twinkle in their eye, or a smirk, or at least some kind of fierce or confident look - the defiant face of someone who doesn't need approval.\n\nBut she did look scared. Uncomfortable. Miserable. There was no pride or flaunting or impishness there. It was a wholly weird thing. I'm not one for conspiracy theories but whatever happened to cause that incident, the woman who performed it was entirely uncomfortable about the act and that raises alarm bells as to why she did it and what compelled her.",
    "His music now is mediocre at best. Idc if he’s Beethoven doesn’t change the fact he’s an asshole.",
    "https://www.nerdwallet.com/article/finance/average-net-worth-by-age\n\nThat puts you in the top 1-2%. Congratulations.",
    "Funny \tYou sir win Reddit ✌️",
    "I’d be humiliated walking around being some knock off version of my husband’s former wife. I guess she’s willing to trade her identity for the drippings of his wealth. Strange life and I’m glad it’s not mine or someone I care about.",
    "I don’t know who she is, so I can’t say for certain, but she seemed uncomfortable during the press photography part.\n\nLike I wouldn’t be surprised if she was blinking “SOS” and hoping someone noticed.",
    "So by your logic someone who doesn’t look happy = looks like someone who has been trafficked??",
    "But what about the other crap they pull in public ?  They are just nasty.",
    "Stop telling the world how broke you are. Go get a job",
    "This calculator says top 9% for the US - https://dqydj.com/net-worth-by-age-calculator/\n\nAnd again, that’s for the whole US… I live in a high cost of living city in the coast, so I’m not really wealthy at all. Just a middle class person in an expensive city.\n\nBut that’s all beside the point… my point is, there probably is at least one 55-65 year old in this thread with a $2M net worth. And they ain’t rich.\n\nEdit: they replied and blocked me. What a loser.\n\n>Pedantic and arrogant. Bet the ladies love you\n\nI save the pedantic shit for Reddit. But what the hell did I say that’s arrogant?",
    "Yuck. What a fucked up way to talk about someone",
    "she always dressed like that lmao",
    "[https://www.newsweek.com/lip-reader-kanye-west-bianca-censori-grammys-2025-2025175](https://www.newsweek.com/lip-reader-kanye-west-bianca-censori-grammys-2025-2025175) \n\nNewsweek sweetie. I have no idea where you got that I got that from the Daily mail but again, you fail.",
    "So you’re telling me you can get nominated but not invited? What if by some chance you win? Nobody claims the award? Or they’re blatantly saying you got nominated but won’t win anyway?",
    "no! I got a chuckle out of ***copye pasta***\n\nlove you",
    "No you’re good\tThis one is actually funny",
    "The lip reader that newsweek references originally made a tiktok that was written about by Dailymail. Regardless, Do you not understand the bigger point I’m making about how dumb it is that you’re quoting an article that uses a lip reader as a source? It’s not even a firsthand or secondhand witness account of someone that was there but instead the source is some amateur on tiktok hypothesizing what they think was said 😂 \n\nI wonder how you’re able to get through your daily life being this clueless",
    "Hey, don't get mad at me because a musician you like turned out to be an untalented Nazi.\n\nIf you think Kanye is on par with Beethoven, then it's just obvious you don't know anything about Beethoven.",
    "Fine, then you sonovabitch. It sounds like we agree entirely.",
    "You don’t have to be present to win. Do you think you need to be present to win???",
    "You know that lip readers are trained, right? Like the person is a professional lip reader. Just because the Daily Mail also wrote about them, does not mean they have anything to do with the Daily Mail. \n\nYou just really do not like being wrong and are now lashing out because you have a fragile ego. You have been proved wrong twice here and so you are going to spew a bunch of insults because insults are the last refuge for those with no arguments.",
    "I still hate that he ended up a nazi, you know your point is shit when you have to lie about what I actually said",
    "No, but that’s not the point. I’ve seen some winners win awards but have someone else claim them on their behalf, but that’s something the nominee should decide to do.",
    "What the actual fuck are you talking about",
    "I thought surely it can't be as bad as what they've pulled in the past. Lemme give it a goog-\n\n\nOh....oh she's just straight up naked, tits to the wind with her coochie out and everything.",
    "I don’t know anything about this Bianca Censori but she looks like the kind of person that would eat a turd if dared too.",
    "People need to stop watching these fuckin award shows.\n\nThe awards are frequently bought and paid for and they do absolutely nothing to change the product. Just a stage for rich people to show off.",
    "Hopefully, she's being arrested as a sex offender because had that been a man with his dick and balls \"hiding\" behind clear plastic, he'd already be on a predator list.",
    "Women are always complaining about how their clothes don't have pockets. That dress? Only comes with a prison wallet.",
    "Showing up uninvited, dressed inappropriate and still being shocked you’re escorted out..\n\nGuess they had difficulty “grabbing” Bianca (un)Censori ",
    "I'm all for daring looks, but this just feels vulgar. It doesn't feel like a statement, it just feels like he's showing off her naked body.",
    "A man would have been arrested and charged... but on the other hand is anyone else sensing a Tom Cruise/Katie Holmes situation.",
    "The surname doesn’t do justice to the act. Or does it? 🤔",
    "Kanye's a creepy fucker. I feel like he's the kind of lunatic that would have naked people standing around his house as coat racks and chairs.",
    "That woman did not grow up with love at home",
    "Wtf why womens body illegal unless it has the correct 3 little triangles",
    "As if being escorted out matters. Their goal was to get people talking about them. And it worked. I've seen more posts about this than about Beyonce winning her award.",
    "I wish she would get arrested for indecent exposure and charged with a sex crime for exposing herself around potential minors. And have her register as a sex offender and deport her ass back to wherever she came from. Ugh, they got what they intended - attention and all of us talking about this unfortunately. I just wish there would be some consequence to asinine behaviour.",
    "Whose bright idea was it to invite them?",
    "Does anyone have the bloody uncensored images? Seems like there are millions if fotos but everyone goes through the effort of censoring the interesting parts. Yawn.",
    "oh no he is gonna blame *them* isnt he",
    "But Chris Rock can get assaulted all day",
    "They didn’t appreciate Ye going on and on about nothing but he’s rich and can do what he wants.\n\nHe’s right. Sadly.",
    "When you have too much money and fame and you feel society norms don’t apply to you. Seems like it’s becoming a trend.",
    "[Haha, he sure loves those sweeties!](https://www.candywarehouse.com/products/gummy-teeth-candy-2kg-bag)",
    "Hasn't done or said anything stupid in awhile. He must have started to feel depressed without all the attention",
    "This was a real shame. He should have been escorted out for his god awful music.",
    "Another proud father moment! How would you like to be the Dad fielding the WTF questions. Both of the couldn't possibly be anymore useless. Two No talents trying hard to be relevant.....Epic FAIL!",
    "Fuck Kanye West. I don't give a fuck how talented he was. That idiot fuked with the 2020 election",
    "More attention-seeking behavior from Kanye and his merry band of clout chasers and coattail riders.",
    "Who fucking cares.",
    "They are so pathetic",
    "I've loved hip-hop my whole life, but never managed to get into kanye. Ive literally always thought this guy was weird since the 2000s and feel like it took 25 years for people to actually raise eyebrows. crazy....",
    "Should be arrested for exposing themselves to minors",
    "America Has A Mental Health Crisis. After All 75 Million Idiots Elected A 6 Yr Old Brat For President.",
    "When the elites deploy their celeb pawns for mass distraction, and you get stuck with the result of an abusive relationship.",
    "They look so happy together.",
    "Why is everyone so up in arms about some nudity. There's wayyyyy worse things to be upset about in the world.",
    "They were headed to a freak off and took a wrong turn.",
    "OH HELL NO",
    "Kanye is the best in the business",
    "So desperate to be relevant. Mental illness is no joke.",
    "Didn’t see her dress, but definitely saw a slit",
    "Is any website not blurring it?? So lame ",
    "Isn’t he suppose to be a fashion designer but can’t even get his wife to wear his shit.",
    "I need to know what the lives of people that design sites this are like. Are they the modern equivalent of people who dreamed of being actors and end up in a rabbit costume at a kid's party?\n\n\nDid they all grow up watching the Matrix and dream in code? Did they hope to build the next Myspace? Maybe get a fat government project? Only to wake up one day and find their boss demanded they build a site where every sentence ends in an ad instead of a full stop. A site where the slightest bit of user interaction causes it to jump about haphazardly in the hope of tricking them into tapping on an ad. A site where the portion of the screen the reader wants the text to be in is obscured so that they have to move the screen around more to feel comfortable on it.\n\n\nI hope you're reading this mystery coder. You could be so much more.",
    "I know, I'm in love",
    "Banned? He’ll be awarded the presidential medal of freedom by musk himself",
    "He did a Nazi thing recently? Haven't heard anything about  Kanye in news cycles lately.\n\nEdit: idk why I got downvoted lol I remember the Nazi stuff from a few years ago but I was just wondering if there was something recent related to Elons thing, I felt like Kanye hasn't really been in the news in this past year",
    "Public nudity is not allowed in Los Angeles if it is done with the intent to offend or sexually gratify someone.  \n  \nYou could argue it's for Kanye's gratification, but that won't hold up in court. She did nothing illegal.",
    "Lmao",
    "I never even know the Grammys are going on until it passes. Society needs to stop obsessing over celebs period.",
    "Kanye should transition to MMA. Dana says that his fighters praising Hitler is free speech.",
    "I mean they clearly don't if he was there and nominated for an award",
    "That’s funny. I’m thrilled to be your first upvote",
    "Sure didn’t look like it",
    "Negative. It’s just censored for posting purposes",
    "She’s no victim, she’s straight up crazy.  Also I thought they were getting a divorce?",
    "wop wop wop wop wop , dot fuck em up",
    "Mf when did he 🍇a child 😭 mfs just be lying now",
    "What exactly is he marketing? What are we falling for? Obviously you are going to get attention if you show up with your naked wife to the Grammys. Any one of the numerous celebrities there could do the exact same thing and receive a similar response, but you wouldn't brand it \"genius\" because they haven't bred a cultish reverence in your impressionable peanut brain.\n\nIt's attention-whoring. He got our attention in the same cheap way a child dropping trow at a birthday party would, what a genius.",
    "What movie is this gif from? It’s seen so much relevant use and is perfect for so many things",
    "This is so funny",
    "Just a pair of pathetic attention seeking halfwits imposing their fetish on the rest of the world. Creepy fucks.",
    "I saw a video on X. Not sure if this is one of the subs that ban X links or not, though. Regardless, I am sure it's all over the internet by now.  \n  \nEdit: Judging on the downvotes, this is probably one of the Elon hating subs. So you're on your own.",
    "I saw a peach on her ass",
    "Oh wow. Didn’t realize they had that kind of money",
    "Lmao what",
    "I love THIS",
    "That site has over 900 partners purchasing the data of people who didn’t pay attention to the popup.  \nIt’s someone who figured out how to make a living while doing as little work as possible. Frankly, I’m jealous.",
    "Haha!! Totally",
    "Fucking bullshit, she willingly suck on those NUTS for some money and fame",
    "Just walking around with your dong out is considered dangerous in modern society. That's why it's enough alone to be put on a registry.",
    "Public nudity is straight up illegal in LA. She could totally be arrested. Especially since there were children there",
    "California Penal Code (CPC) §314(1) – Indecent Exposure – In California, **the crime of Indecent Exposure occurs when a person exposes his or her naked body or genitals in front of anyone who could be annoyed or offended by it**.\n\nGoogle. or [CA.gov](http://CA.gov)  fool.\n\nIts not about Kanye or his wife, it's about us.  \n\nI guarantee no one on either side of this stupid argument knows what shoes she was wearing.",
    "you see, by claiming this is assault, we are all victims.  so the next time someone gets raped or beaten until their bones break these people can pipe up and say 'im a victim too, i have been assaulted'. they will leave out the part where they saw a nude body at the grammys, but everyone around them will say 'oh that is terrible what you went through. people shouldn't have to suffer like that'\n\nits some sort of mental condition where people feel validated through victimhood complexes.",
    "it is free speech. thats literally the definition of the word. you are free to speak.",
    "Thanks!  That's hilarious.",
    "What is your comment even pertaining to? A man would be arrested a charged: I’ve heard of men having to register as sex offenders for peeing with a school close by while drunk.",
    "It’s illegal. What if a guy walked around with his dick out in front of little girls?",
    "His brand, himself. His fucking antics. Everyone keeps making him more and more famous despite the either positive or negative effect from all the wild shit he does. You guys say he’s canceled yet wtf is this? I’ve seen this a thousand times all over reddit already.",
    "She has her own money lmao they’re both just disgusting perverts. Idk why people act like either of them are victims. Look up who her family is.",
    "Two things:\n\n1. He has strong ties with him. So, relevant.\n\n2. Not American.",
    "In all seriousness Kanye’s a billionaire eclectic artist. If anyone should be doing this crazy stuff it’s him. I hate that society craps on him when he’s just trying to advance fashion and shock us with art \n\nHe made the most iconic shoe ever since Jordan 1 And then society deemed him unacceptable and cancelled his billion dollar shoes empire of course he’s got a chip on his shoulder ",
    "It was impressive when it was average joes gaming the system not Silicon Valley dorks. Guy who create shit like this don’t have the imagination to appreciate an easy paycheck.",
    "Just really confused about the capitalization of nuts here. Why are you yelling about Kanye’s nuts lol?",
    "she doesnt look uncomfortable. she literally loves the attention. \n\nwhich btw. she should be arrested. that would look uncomfortable. \n\nif a dude did this they would be in jail",
    "I have a question: Do you really think the public will be made safer if we weaponize the sex offender registry to go after everyone who does a performative stunt? Or if we threw everyone on it who could plausibly be charged when indecent exposure, whether they were actually predators or not? Is it a wall of shame, or a serious tool for identifying dangerous predators?",
    "Fine with me..... Honestly I think people should be far more upset with the fucking actual \"I love Hitler\" nazi beside her.",
    "I think if a man did that he should be fined and cited. Whether he should end up on the SO registry is a question of whether or not he poses a danger to others. And if a man showed up to a red carpet award show with exposing “clothes” on (which is what we’re talking about here) then he obviously doesn’t. \n\nThis is not a binary. We don’t have to choose between “this is totally okay” and “put on a list and permanently subject to life altering restrictions” for every single person who gets caught doing something indecent. There’s room for nuance, and that nuance should exist in motive and manner of an act of indecency and whether or not it poses a danger to others.",
    "As a viewer, I’m annoyed and offended. Let’s all rally and sue.",
    "And aren’t children allowed to attend the Grammys..? Like are you allowed to just be naked like this in front of minors..? Because I didn’t think so",
    "this really devalues the pain of actual victims.",
    "Free speech applies to your First Amendment rights against Government intrusion. It has nothing to do with private enterprise and one would expect a legitimate company to fire overt supporters of Nazi ideology.",
    "You can still put it to good use! That number is almost always registered as a grocery or pharmacy rewards number, so just punch it in for the discount if you don't want to register. (Alt = [local area code] + 867-5309)",
    "She is almost definitely his victim. There's a lot of signs of spousal abuse there.",
    "Nah. \n\n\nThen don't bring up American politics in a space unrelated to them. We have enough of that shit everywhere else on the internet.",
    "Based. Thanks for showing me that one haha, that's entirely fair",
    "Yes. I'm sure Bianca's tiddies at the grammy's are more relevant to politics than music lol",
    "He's also a nazi and an egomaniac piece of shit.\n\n\nDo you know why Adidas cancelled his contract? It's because he told the Jewish employees to forgive Hitler's misdeeds. That may fly in an American company, but in a German one? That's a hell tf no.\n\n\nIs Kanye an amazing musican and artist? Yes. Is he also an antisemitic piece of shit with severe mental health issues? Also yes. And those shouldn't be excuse because he makes good music.",
    "1. Is the act a crime?\n2. Is the crime a sex crime?\n\nIf yes; place on the offender's registry.\nIf no; do not.",
    "Yeah no one said that, but you keep arguing with that straw man.",
    "Oh no, a hypothetical child may have seen a pair of tits.\n\nIt's the end of the world!\n\nAnyone who thinks something this benign is damaging for a child has some seriously misplaced priorities.",
    "Ok so if a guy flashes someone that's not assault? I'm pretty sure it is so it should be same for women as well.",
    "LOL.\n\nfreedom of speech means you are free to believe what you believe you are free to say what you want.\n\nyou said :\"Dana says that his fighters praising Hitler is free speech.\" i was telling you that by definition that is the word free speech. you are free to speak.\n\nnobody should be fired for believing what ever they want.\n\njust liek i dont believe in firing people. just because they think they are the opposite gender. they arent. they are mentally unwell. but thats there problem as long as they arent pressing it on kids.",
    "Nudity isthe state of being without clothing. It can also refer to wearing significantly less clothing than is expected in a given culture or situation\n\n\"look it up\"\n\nmaybe you can use fucking google dumbass\n\nif you can see it. its nudity.",
    "Like what? She has the money and the power to leave. She’s could easily have him killed if she wanted to. There’s no power imbalance here. She’s always been a weirdo freak, and she worked with him for years before their relationship. She knows exactly who he is. They’re both perverts. She’s not a helpless victim, she is a willing participant. Unlike the rest of us (including the CHILDREN at this event) who are unwilling participants in their exhibitionism.",
    "Nah.\n\njust relax please",
    "Not degrading sex workers here, but she has a masters degree. And she’s clearly into it. I think she’s hotter than Kim k too ",
    "At the expense of making the world a worse place I do. At the expense of denying ourselves better things I do. At the expense of being lazy I do. The future looks grim to me when I read comments about new dreams being tricking someone into loading 100s of ads so you can go mess around somewhere doing f*** all for society. Absolutely. It’s selfish and sad",
    "Got it. So if a guy is caught pissing outside, it’s indecent exposure, and he should spend the rest of his life as a sex offender.",
    "Okay, but there's a pretty big gulf of difference between \"Fine her, cite her and ban her from future events\" and \"Make her a sex criminal who's subject to movement and residential restrictions for the rest of her life\"",
    "I've worked in criminal law in SoCal before, this shit would get dropped unless they were jacking off or flashing people for gratification.",
    "Being arrested just means you're *charged* with a crime. Police are not lawyers. They charge you with something and then lawyers and judges determine if you're guilty of an actual crime based on the circumstances and charges. \n\nSeeing someone taken away in handcuffs isn't proof of anything.",
    "Thank God we have heroes like you",
    "In my state, no, it isn't.  assault in ny is an act that requires physical harm.   i guess it could be different in other states.  \n\ncomparing the trauma of seeing a naked body with the same level of suffering as someone who has been subjected to physical harm due to the intentional of reckless acts of another person is insulting.",
    "Thats not how abusive relationships work dude.",
    "Just because she's a shitty person doesn't mean that she is incapable of being a victim of domestic abuse. \n\nShitty people are abused by their spouses all the time. Just because they are terrible people doesn't mean they deserve it.",
    "You obviously have never been in an abusive relationship. He is truly gaslighting her, she looked positively terrified. It's not as easy as you think to just leave. She looks to be so deep in his thrall. It's scary. I pray she finds the courage. But do not, and I repeat, DO NOT prejudge someone's actions and assume everyone is strong enough to make those types of decisions. That's not how abuse works. I know because I lived it.",
    "If it was a man with his dick out, he’d be in jail",
    "The DA can also decide not to file charges if they recognize that it's not a crime and that they'd easily lose in court.",
    "Showing someone your privates without consent is definitely sexual assault and harassment. Acting like it isn’t is reckless and insulting",
    "Okay, so we're actually on the same page here. The way you initially phrased it made it sound like you think this incident was a sex crime (which, y'know, trolling an award show obviously lacks the malicious intent here)",
    "If it was a man, I’d argue that permanent inclusion on the SO registry would also be stupid",
    ">  If Kanye was wearing something where his dick was showing the way her vag is, this scenario would play out very differently, grammys or not.\n\nSee, this is the part I think is ridiculous. Trolling the Grammys is not an act of a sexual predator, whether a man or woman is doing it, and I doubt Kanye West, or even just an average joe streaker, would be facing a lifetime on the sex offender registry for doing it. Context matters.\n\nAnd yes, there are plenty of instances of people of both genders being popped for indecent exposure without that particular punishment being employed. You usually have to be exposing yourself to someone non-consensually, or directly to a minor for that to be employed.",
    "I really believe your anecdotes compared to my firsthand experience working in criminal law.",
    "In your state people are put on the sex offenders registry for physically attacking another person, or from causing injury to someone through reckless actions?",
    "nice goal post moving you got going on. what you describe is a crime, and not acceptable, but it's not assault. \n\nlike i said, idiots like you devalue the suffering of actual assault victims by comparing what they have suffered to something that is not what any reasonable person considers to be the same thing.",
    "Yeah I wasn't sure why I was downvoted at first, but I get it now. It just seems simple to me, and I totally agree with you.",
    "I agree with you, context should matter. And it does matter more...for rich famous people. And then it matters more for women. Men are at the bottom of the ladder for being excused for exposing themselves.",
    "I mean, technically \"firsthand experience\" is also just anecdotes by definition. That being said, you seem to know what you're talking about, enough that I'm giving you the benefit of the doubt haha.",
    "Ok so if it is a crime but not assault then what is it? I was sure it was sexual assault, I was wrong. I never set out to devalue anything. To me trauma is trauma period. But for the and of this discussion what crime is someone committing, if not sexual assault by flashing someone without consent? Genuinely asking here",
    "> Why? The line must be drawn somewhere\n\nYes. We're debating about where that line should be drawn.\n\n> it normalizes it to the point where others do it and put ppl’s safety at risk.\n\nIf you write her a citation, issue a nasty fine and ban her from future ceremonies, you send a message that's not normal. I don't see the need to put her on a sex offender list when she's not a sexual predator. You yourself think she isn't personally doing anything nefarious, so why would you punish her with a life long sanction that puts her on a public list as though she was?",
    "Why? Why is it so controversial that a modicum of common sense be applied to this? The SO list should be reserved for dangerous people. Male or female, trolling the Grammys isn't the act of a dangerous person.",
    "good, so we agree, what happened wasn't assault then",
    "Oh, I got that, I was just taking the mickey at your wording. Exposure, yes. Indecent, maybe. It also is free expression, though. And neither necessarily trumps the other, so it will always have to be decided on a case by case basis.",
    "you suck at reading comprehension.  i was responding to a comment that called it assault.",
    "Pretty sure they’ve been giving out grammy awards for a while buddy",
    "Happy for Justice. Met them after a show in October and they were the chillest people.",
    "And 3rd one for Justice",
    "Tame Impala AND Justice win grammy*.  This song was produced by Justice. Dont know why they were removed from that headline.",
    "Congrats, but does anyone seriously still care about the Grammys?",
    "So happy for all members!",
    "Damn had no idea it was just one guy",
    "About time.\n\nMost talented person in all of music.",
    "I’m just gonna say it. He still hasn’t made anything as good as Lonerism, and that’s okay. Still good, but I feel like he sounds too industry generic now.",
    "I also enjoyed wings of time from them. It was a song for the d&d movie.",
    "Love to see it",
    "I thought the first-ever Grammy award was won in 1959??",
    "Been a huge fan of his for a while it’s about time he got some recognition",
    "Been around for a while!  Still good!",
    "He does not need this award anyway, we all know that he's a good boy 🐶✨",
    "Good to see :)",
    "Lets go!!! Congratulations",
    "Never even heard of this jive ass turkey",
    "I liked the first Tame Impala song I heard. Then I realized they pretty much all sound the same.",
    "It won a J award at least and that's probably a bigger deal",
    "Runway houses city clouds still sounds so good.",
    "A masterpiece",
    "Yeah they definitely have 🤔",
    "Was originally going to be called Tame Tayou, but the Chuckle Brothers had already used it. ",
    "I saw Tame WITH A LIVE BAND and my friend tried to be like “What? No? There’s no other people” like I wasn’t just at the venue seeing multiple people on stage. We get it girl, it’s just Kevin.",
    "Justice has won two Grammys before this",
    "That would make a wrong headline since Justice won Grammys before.",
    "It’s a fantastic track and it also sounds spectacular on good speakers. ",
    "The whole album is amazing actually",
    "I care when bands I like win because I like to think it gets them more money or possibly just makes them happy. That’s about it",
    "The \"Best New Artist\" is a good category to see who will no longer be relevant",
    "The fact that he won a grammy for the garbage, generic electro-pop he puts out now, instead of the first two albums, tells you all you need to know about the grammys and quality.",
    "I seriously do not give a crap about awards for the arts.",
    "You mean Justice?",
    "I'm more concerned with Chris Brown still having a career. Fuck that woman beater.",
    "I feel like the Grammys give out \"make up\" awards a few years after they snub something excellent.",
    "Lmao hating on generational talent.",
    "Really? I mean I'm no super fan or anything but I think if you listen to a couple of songs on one album like say, The Slow Rush and then a few on another like on Lonerism or something they sound pretty different?\n\nEven more differences and options if you include the song being talked about in this article that he did with Justice or any of the ones he does for various things like the D&D song or barbie song he did. \n\nA lot of em do have a certain feel to em that you'd find in any psychedelic rock song but I think a good number of em are different sounding.",
    "if your counting Hyperdrama, yes, but before they won In 2018 for Woman Worldwide, and Cross was nominated in 2008",
    "“Wow, an awards statue! Oh, it’s a Grammy”",
    "Looked up the list and you're not kidding. 2010s are a bunch of duds and then I don't know half of the 2020s recipients. 2000s are pretty strong overall, cultural impact wise.\n\n\nhttps://en.m.wikipedia.org/wiki/Grammy_Award_for_Best_New_Artist",
    "For real - please listen to this song that just won an award and then listen to Innerspeaker and tell me they sound the same",
    "He probably won because He's a Man, woman.",
    "They also won Best Remixed Recording in 2009 (Electric Feel)",
    "Well, the title of the post doesn't say that either. It just says \"Tame Impala Wins First-Ever Grammy Award\" which is true.\n\nIf you click on the actual news, it states further information: *Tame Impala and Justice won Best Dance/Electronic Recording for their song \"Neverender\"*",
    "It’s funny to see some of the nominees that lost that category and went on to be massive artists. At the same time, I don’t think it should be a popularity contest, but that’s pretty much what the Grammys are anyway, especially now. \n\nI don’t think there’s any chance we’ll ever get an underdog AOTY winner again with how rabid and fanatic people are these days.",
    "Oh yeah forgot about that, I think that was also MGMT’s only Grammy win",
    "There will always be someone who just recently finds out that it’s just one person and that’s what keeps the meme funny to me lmao",
    "Okay yeah that's pretty understandable- I keep forgetting that the whole show genuinely takes like 6 hours"
]