[
    "Mr Lamar isn't getting popular now, that's a wrong assertion\n\nHe just wasn't overly present in the zeitgeist because he drops his albums, does good numbers both sales and tour wise and goes back inside. This is the longest he's be outside since DAMN era which is actually his biggest album run era...I get the assertion though as he's very much impactful and more visible in 2024/2025 than he's been in the past 4 years.\n\n\nBut yeah you can check Spotify Main Playlists and other media stuff like Billboard Chart metrics or kworb.net.\n\nThe other comment does a better job giving you more pointers",
    "Rosalía – “Di Mi Nombre” (Flamenco-inspired, but sultry and hypnotic like Billie)\n\nSade – “No Ordinary Love” (Smooth, jazzy, and sensual)\n\nFKA twigs – “Two Weeks” (Seductive, airy vocals with a hypnotic beat)",
    "-i fall in love too easily - Chet Baker\n\n-Like the movies - Laufey\n\n-Decoy - Fievel is Glauque\n \n-Something's wrong with the morning - Margo Guryan ( one of my current faves ) \n\nI have many more :D this is just from the top of my head, if you liked these I'll add more to the list",
    "hii, thankyou for taking the time to recommend listened to \ndi mi nombre (a bit too upbeat for me)\nno ordinary love (love it)\ntwo weeks (okayish)\nthank you again",
    "hii, thankyou for taking the time to recommend. I listened to the songs you suggested and\nI fall in love too easily (love everything about it)\nlike the movies (like the vibe)\ndecoy (love the playfulness)(it's very morning in france dancing in the kitchen in just a white oversized shirt and hair down making breakfast and dancing while your window overlooks beautiful buildings)(sorry I have a tendency to describe songs like that)\nsomethings wrong with the morning (same but somehow better vibe as decoy, love it)\nthankyou again<333",
    "haha I also had a similar image in my head when listening to that\nWhy apologizing ? Don't say sorryyy, you describe it perfectly <3\n\nGlad you enjoyed these!!",
    "I love your music taste",
    "Your experience resonates with many, particularly the challenge of balancing music practice with a busy life. Building a daily routine, even in short increments, can rekindle your passion, as noted by experts who emphasize the importance of regularly engaging with your craft to maintain motivation and avoid burnout.\n\n* [How to Get Your Musical Passion and Drive Back: A Guide ...](https://www.mymusicmasterclass.com/how-to-get-your-musical-passion-and-drive-back-a-guide-for-the-uninspired-musician/)\n* [How to Get Yourself to Practice When You Don't Feel Like It](https://bulletproofmusician.com/how-to-get-yourself-to-practice-when-you-dont-feel-like-it/)\n\n^(This is a bot made by [Critique AI](https://critique-labs.ai). If you want vetted information like this on all content you browse, [download our extension](https://critiquebrowser.app).)",
    "Music is not Free. And it does not come magically to your device.\n\nIn the old days, you would have to buy music either physically (Vinyls, CDs, cassettes) or digitally (MP3 or FLAC files) and either play the media or transfer the file to your device. You can still listen to music like that, but buying every single album you want to discover, that's very expensive.\n\nNowadays streaming gives you access to a very large music library. The free version is just there to help you try the interface, see if you find the music you like. Then you will have to move to the paid subscription. And 10$/€, less than the price of an album on physical media, for a quasi unlimited library and access of all new music that is released, in CD quality (the free version has reduced sound quality), that's really cheap compared to what you would have to pay if you had to buy everything.",
    "Thanks I’ll make sure to try it out",
    "I’ll forever hate the Funky Boss for ruining what The Cult had going on. 😡",
    "Damon Albarn - blur to gorillaz\n\n\nOasis - pop rock to shit.",
    "Nowadays, pick a theme or genre and chase it. I realized it's been a while since I've listened to Type O Negative and Bjork.  I'm gonna make good on that.  Pick an artist or two each week and listen to their discography in order (or not in order).\n\n Saturday breakfast with YouTube is a favorite.  New releases all the time.  Check out KEXP concerts. \n\nSame with surfing Bandcamp by genre, you get a couple free listens each song.",
    "The thing holding you back from expanding your taste is putting the time in to try lots of stuff, not the quality of the source of recs or a specific suggestion \n\n\n\n\nThat said\n\n\n\nMy newest love is Maruja, give em a shot. Really awesome visceral jazz-rock post-rock shit\n\n\nhttps://youtu.be/VRtkoNBJRQo?si=JqTCIh_3-SLe1Wa0",
    "It’s so easy these days, just pick some bands or genres you think you would like, and research some bands, and then listen to their catalogue.\n\nOnce you find a genre or type of sound you like, then dive deeper into that and look for other bands that are similar or that influenced those bands.\n\nYou can do this by using a streaming service or just Google research and YouTube.",
    "Out on a Tiny Desk playlist when you get ready in the morning. Eventually something will call to you. \n\nI also like the Discover Weekly on Spotify, though it is far from perfect. Ie, sometimes I think \"How dare Discover Weekly think I don't know who (insert artist) is!\"  (Like I get why algorithmically I got served Elliott Smith, but also, my entire jam list screams \"she gets sad to 'Needle in the Hay' on the regular\")\n\nI also periodically just post on shitty Facebook for friends favorite songs and make a playlist. People love to give you their favorite music. It sometimes leads to unwelcome realizations about taste level, but mostly more insight into how diverse your social bubble can be.",
    "I have been using Spotify for years. \nThrough 'discover weekly' I slowly managed to expand my taste. \nIt has a pretty clever algorythm, based on what you listen to, it offers you similar, sightly similar music and I always find stuff there which is definitely different from what I usually listen to. If I like something, I add it to my rotation and boom, next time it becomes part of what the algorythm analyses for its recommendation.",
    "Check out [Glass Beams](https://youtu.be/hGQu4_fan8Q?si=b_YA7vLNBZIJjMLx), [Hermanos Gutierrez](https://youtu.be/duT62emRXIk?si=WdEhRRINz2ks3BG-), and I love [Miasma](https://youtu.be/BX335Z4esSU?si=1SihMMFn99pT4iqr) by Ghost.",
    "Try a post rock playlist.\n\nTo explore more music look up other songs by artists whose songs you like.  \nGo to Wikipedia and look up what the genre is called of songs you like. Check out the genres that were the main influences of that kind of music and what genres followed.  \nTry to look up modern takes of older genres you like. For example “modern deep funk”.",
    "I don’t know if I’m allowed to make recommendations or not (I never knew of the rule against requesting them) so I won’t, but I will include an example that’s relevant to my point. \n\n\nA great way to expand your music taste is to talk music with like-minded people that enrich your lives in other ways too. Sharing with humans is generally the best way to learn anything. \nFor example, I have a reddit friend that I happened to be talking music with one day, and he made a brilliant suggestion (with little to go on of what I already like). \n\n\n\nIt was Matt Berry’s ‘Simplicity’ album (available on Spotify). \n\nI suppose it’s technically acid jazz (?) which isn’t my usual, but I got immediately sucked in by the groove. Fantastically funky, and cleverly-captivating without being over-demanding. Easy to imagine being in the room with them. \n\nIt’s great to sit and listen to or also ideal for “background music” (for me the music is still the focus even when multi-tasking) \n\nI’m not advocating drugs and they’re not necessary to enjoy it, but if you listen to this on ketamine you *will* feel the percussion walking along your spine. My back felt the strongest and lightest it’s ever been for several days after. It’s probably great on a comedown for other stuff if you want something playful enough to encourage light visuals while simultaneously being soothed.\n\n\nSo yeah, just get out there (or online) and talk to people about what gets each of you going. The better somebody knows you, the better their recommendations will be",
    "🤔 I discovered video game music this way just after posting... good idea! Thank you kindly!\n\n\nSatriani is what started it this morning... crisp, clear jamming",
    "Listen to Escapism by RAYE (Live from Royal Albert Hall). The beginning is a straight masterpiece.",
    " She definitely had some stuff that went down good. Especially during my substance days.",
    "Hell yeah, this is the type of suggestion I was looking for. \n\nI'll fire up youtube with a known song and see where it leads. 👍",
    "Cool, have fun with it.  Just to say it again, the Live on KEXP shows are a fantastic resource.  \n\nARTE Concert, another channel, has some neat concerts and settings all over the world, the Passenger Series.  You'll find some neat electronic sets.  Or, hey see what Yann Tierson is doing.  His upcoming album is half piano, half synth...all instrumental.  ...Max Cooper is doing some interesting mid-tempo electronic music, too.",
    "😍 hell yeah",
    "A cover album is the best album ever made? This is some grade A troll bait.\n\n![gif](giphy|OCdGWZvcc1T8xDbj7O)",
    "I feel like they could have made it a double album. Mr Blue Sky is the best one on there.",
    "The. Best. Album.\n\nEver. Made.\n\nSteely Dan Aja\n\n\"I'll stand on Bob Dylan's coffee table in my cowboy boots and say that.\" --Peter Frampton",
    "Weezer is not the best at anything. They're not even the best at playing their own music.",
    "Naah. There were over 1000 best albums ever made. I can tell you one I bet you've never heard of. After that, I can tell you a bunch more.",
    "This is a thought I don’t think anyone has ever had before, and it’s glorious. \n\nYou’re not wrong, though. ",
    "By all means, have all the discussions about music and art you want. But this is always such a shortsighted thing to say or think. Art is subjective and therefore there will never, ever be a “best album ever made.” Not an album, a song, a movie, a painting, anything. It’s about the artists creating something and then the audience experiencing it in some way.  \n\nI understand these kinds of statements are usually just a way for someone to say “hey guys I really love this album, let’s talk about it” but why not be more direct like that instead of couching it in some “best ever” context which will always be futile. Anyway, that’s all. Good luck!",
    "Most impactful? Lol. That's certainly an opinion.",
    "Yeah lol, although I do kind of believe it though, judge it purely on the tracks and not the quality and or recording artist and the theory tracks",
    "Although I like this album, this in an L take, especially because this is assuming we remove all context involving the creation of said album",
    "God does not look favorably upon your kind",
    "Africa, Billie Jean, Everybody Wants to Rule the World, Take on Me, Paranoid, Sweet Dreams, No Scrubs, Happy Together, Mr. Blue Sky, Stand by Me? Pretty impactful. ",
    "I appreciate that, I truly do think it makes sense",
    "there's no judging it purely on the tracks. wtf?! you know their decent tracks because of the original recordings. shit, at least make some logical sense when trolling.\n\n-G.",
    "Right, a literal cover album is a W take\n\nI mean Songs in the Key of Life exists, too.\n\nYou're putting Weezer above the first 4 Black Sabbath albums.\n\nCan't really take this seriously.\n\nI mean Pet Sounds, Some Kind of Blue, Highway 61 Revisited, What's Going On, Dark Side of the Moon? Weezer... not even making the list.\n\nBetter than Electric Ladyland???? sure Jan",
    "because op can't articulate thoughts for shit?\n\n-G.",
    "Dude they’re saying exactly that. If you were to remove all context (not knowing the original artists or that it was a cover album), you would think that Weezer created Sweet Dreams, Mr. Blue Sky, Paranoid, No Scrubs, Everybody Wants to Rule the World, Africa, whatever else was on there: all on the same album. It would be undeniably the greatest album ever. I don’t know why nobody’s understanding the prompt correctly. ",
    "By all means, have all the discussions about music and art you want. But this is always such a shortsighted thing to say or think. Art is subjective and therefore there will never, ever be a “best album ever made.” Not an album, a song, a movie, a painting, anything. It’s about the artists creating something and then the audience experiencing it in some way.\nI understand these kinds of statements are usually just a way for someone to say “hey guys I really love this album, let’s talk about it” but why not be more direct like that instead of couching it in some “best ever” context which will always be futile. Anyway, that’s all. Good luck!",
    " Nah fr tho, I understand where you’re coming from, but that’s not my argument, I definitely do not agree with Weezer teal album being the best of all time, I just think that it’s one of the best track lists, removing who recorded it or the quality of the performance",
    "Fuck that guy. Pick a side, square ",
    "What a wild take. You’re acting like something incredibly subjective is objective.\n\nI happen to like Kendrick’s rap voice quite a bit and also think TPAB simply *sounds* absolutely amazing overall. What sounds good *is* subjective, my dude…\n\nYour argument gets even weirder in your replies ITT. Not everyone likes Drake’s voice. Anyone who *actually* knows production will tell you that no, there are in fact, *not* rules, there are maybe *guidelines*, but the common expression is “if it sounds right, it is right.” If you want to crank 400 htz on the kick, you go for it if you think that sounds good to you on this particular track for whatever reason. There are no rules. What a bizarre thing to say…\n\nYou also seem to be equating polish with what you’re calling “better,” which again, is pretty weird. There’s something to be said about intentional rawness. Maybe I’m reading too much into that one, but based on your examples, that’s what it seems like you’re saying.",
    "It's subjective. What is meaningful to some isnt meaningful to others. Same deal with how it sounds.",
    "I mean this is just your opinion, but I guess i'll bite. It might be long but I'm really trying to answer the question.\n\nAlso, It's hard to equate 2 completely different genres and critique albums from those spaces using the same metric.\n\nWeeknd Trilogy (going to refer to it as an album in this, I know its a compilation) is an alt r&b/ pop/ darkwave album, that isn't necessarily narrative focused. The album doesn't ask you to follow a narrative, sure there are themes across them all but they're not really themes that evolve and develop as you make your way through the tracklist, they're just kind of themes that are typical for The Weeknd... and that's OK! The album sure is innovative, but isn't entirely new either and that's also OK! There's a reason he samples Cocteau Twins so heavily...\n\nTPAB on the other hand, is a highly narrative based album as most of Kendrick's albums are. That narrative and deciphering and interpreting different parts of the album is something Kendrick fans have come to love about his albums. Rap is also historically a much more narrative based genre, where rappers are praised for their ability to tell stories in their rhymes. The album is asking you to dive into the narrative of the album. It's presenting that to you as a major pillar of the project. Same with the jazz instrumentals, the repeated lyrical motifs, the spoken word poem that develops throughout the album and how that poem pays off... If you don't like the Jazz elements of the album that's fine, but if you do appreciate that genre of music, as well as 90s rap aesthetics, and you embrace the narrative parts of the album it's extremely hard to not be impressed by the album when it all comes to fruition on Mortal Man.\n\nAs far as Alligator Bites Never Heal not being listenable, I don't really get your point here... Maybe you just don't like the 90s style of rap? Doechii is pulling from so many different angles of hip hop from 90s, to boom bap, to R&B. Listening to her it's obvious how influential artists like Andre 3000 and Missy Elliot are to her. TBH when I listen to this album the narrative parts of it aren't really what's so exciting to me. It's her energy and her performance. Denial Is a River, sure tells a story and it's a compelling story, but the song is just a lot of fun. Nissan Altima is just foot on the gas, belt to ass energy. One of my most listened to songs last year and I really don't know what the song is about other than Doechii just being an incredible rapper.\n\nDifferent albums and different genres do and attempt different things. If you aren't a fan of the subgenre these albums live in, the writing behind them isn't going to save it for you. However, if you are, and the album is asking you to interact with the narrative and it resonates with you, it would make sense to shine light on that and praise it. Just because people are doing that doesn't mean they're valuing the meaning over the \"listenability\"... it just means they like different music than you which is ok. Because something is showered in praise by a core audience doesn't mean literally everyone has to like it.",
    "Art is all subjective, of course. I, personally, agree with you on TPAB, but I absolutely do not agree with your overall opinion of Kendrick Lamar. I also cannot get into The Weekend. I just don't find his music interesting or new at all. You say a lot of \"music should\", but music SHOULD move us and that's it. Some people get incredibly emotional when listening to Sigur Ros, but none of those lyrics are real words. How does this happen?",
    "I'd say it all just depends on if someone has digested those topics before.  People like to celebrate big ideas that are new to them or resonate with what they're experiencing.  We're not all on the same page, yet a good song can least help tell what book we're reading. \n\nI can't listen to bands like Tool or Pink Floyd like I used to, and they even sound great still.  But, get the message and hang up the phone.  No need to spiral out 24/7.",
    "There are so many rules when it comes to objective sound. You could analyze and sound or voice under a spectrogram and without even hearing the sound, choose which one is better. Now some sounds sound good in context, like a rough kick in a smooth beat, but overall, sound isn’t subjective at all, its about how you place and contrast the sounds that make it good",
    "Impressive art to me is the artists that can create vivid and realistic landscapes, scenes, portraits statues that can convey emotion",
    "Do you think a lot of modern art is impressive?",
    "There are rules when it comes to objectively good sound music. Music theory, songwriting theory, and engineering techniques are all to make music sound objectively good. Also some people’s voices are scientifically better than others",
    "I feel like music is less subjective when we think. There are so many rules in production, songwriting, and engineering that are just psychologically pleasing to the human.\n\nIf you analyze Drake and Kendrick’s voices under a spectrogram and other formant tracking software, Drake’s is just smoother and more sonorous. Drake was just born with a more pleasing voice, there is nothing that Kendrick can do about that.\n\nI have not heard the song you mentioned, but I would say that it’s a good example on how music should be made, where a song can be listened to for it’s sound, even if the lyrics aren’t relatable, while say theoretically, another person can like a song for it’s lyrics too, so the song is just more appealing.",
    "Why can’t the art that portrays “big ideas” sound as good as other art forms? I feel like they tend to sacrifice sound and focus on meaning too much, where sometimes it’s just spoken word poetry over a beat",
    "That's great FOR YOU. Get it? YOU! That's YOUR OPINION.",
    "Yes the rules are objective and strict. However what you do in the confine of those rules is the creativity is music",
    "I see what your saying but I’m not criticizing the listener as much as I am the artists. People liking an artist is more promotion and marketing than anything. How many times to do people like an artist because of their personality, message, or relatability. Now how often do we say we like an artist strictly because of their sound? The Weeknd got buzz without even showing his face or identity just because of his sound. Nowadays, artist have to be influencers or activists in order to get buzz, it’s almost like their music is just fuel for their message, not made to focus on the beauty of music and sound itself. I get the “it’s bigger than the music” but what is? Of course ideas will be bigger than the music, but it’s just not about the artistry of music anymore; rather a message if you see where I’m getting at",
    "I agree with what your saying, but it’s not like the whole track can be “rough”. Music builds tension off of contrast. Some songs just don’t have enough variation and contrast to where the “rough” parts just don’t hit as hard because there is no contrast.\nI’m not saying your wrong, this is just what I commonly see",
    "I mean I'm sure there are people who start listening to people because they see their morales align, but that love of the music is what's going to keep people going back. And if you aren't an activist to some degree in today's political climate, you should be kind of embarrassed... Standing for absolutely nothing when you have a platform is lame, even the Weeknd would agree with that  \\*\\*points to his generous donations to Palestine",
    "You are wrong. plain and simple. Art and Science can be symbiotic, but art exists to break \"rules\". Art is about complicating the basic facts that science provides. It still works within the confines of physics, but it's a way for humans to \"think outside the box\". For me, my opinion, I love gritty/broken sound. Give me some glitchy Aphex Twin and a book, and I'm gone. Now does that music sound \"good\" by scientific standards? No. Does that make it bad music? Also no.",
    "Music theory? All music theory is is just ratios between frequencies. If your talking about the voice, narrow bandwidth frequencies are more pleasing, and artists who tune their formants to the fundamental sound objectively better. Not to mention being on pitch sounds way better than not",
    "Well if we are talking scientifically, the music should balance every part of the frequency spectrum. Poetry doesn’t have melody either making it incomplete as music. Also capella singing is music, just not good at that.\n\nMy point is that there are scientific rules to good sounding music that you can’t just ignore in the name of meaning, which people tend to do",
    "No music focuses on sound. You can choose your words to sound better and flow better. Some words and syllables work better in places compared to other ones. You could theoretically right a song that had no real words but the flow is nice and the words sound nice in context. The hard part is doing both sound and meaning, but people tend to place the meaning over the sound part",
    "Yes but at why are we praising the people for a message instead of music? Like Kendrick can right an album about civil rights, and everyone will love it because of the message? Don’t they just love that the message is in music form instead of the music itself? I feel like people saying that music is good because of message just are completely ignoring the artistry of music composition and letting an external message override how good the music sounds. For example, Kendrick could turn To Pimp A Butterfly into a poetry book and it would do well and still carry the same message. The Weeknd couldn’t do the same for after hours. At what point can we admit that Kendrick’s music isn’t as good, but we just value the message, we is completely irrelevant to sound itself",
    "That's like someone asking \"how can you prove God is real?\" and your answer being \"The Bible\".",
    "Your last sentence is a contradiction.\n\nAs I said, you’re just arguing semantics. Music is whatever people call music, and the definition doesn’t inform why it’s valued or for what reasons. Your thesis is based off some unfounded assumption that it does.\n\nYou could just as easily advocate that more scientifically melodious waveforms (whatever that means) should have a different and more rigidly defined label than “music”. With regard to what we value culturally, artistically and sonically, that would accomplish the exact same thing. Meaning, not a whole lot beyond a new word in the dictionary.",
    "Yeah, some people value meaning over how something sounds, and that's totally okay. \n\nI think I understand where you're coming from, though. Sound design, engineering, and production take skill, effort, experience, and a large amount of intelligence to curate, and people should be listening to those pieces and appreciate the process that goes into the product.\n\nIn the real world, the large majority of people don't care about that. They only care about how something impacts them. An electrical engineer can walk into a very well electrically managed warehouse and geek out over how well managed their systems are, but everyone else will just expect the lights to work and not think much else of it.",
    "Again, this is extremely dismissive of the listeners experience with the music. GKMC, DAMN, TPAB, and MMATBS aren't spending literal years and decades on the billboard 200 because people only like the message of the music. \n\nI've never heard someone say Kendrick's music is good solely because of the message, you can literally reference hundreds of reviews for that album where people are citing the musical elements of that album that move them.\n\nKendrick gets praise for speaking up because there are very few artists who are as political as him, who make as bold of statements as he does. \n\nArguing against versatility is definitely a decision... and again comparing 2 completely different genres. Most rap albums could be turned into poetry books because that is the foundation of the genre... saying that Kendrick's would do well even if it was a poetry book is just testament for how good he is as a rapper. \n\nIt doesn't seem like you want a discussion, or to understand the way other people experience music, it seems like you want to establish objectivity and a community centered around music discussion probably isn't the best place to do that as objectivity is inherently anti-discussion",
    "Pete Townsend never took lessons. He never learned how to read music. He never learned the \"rules\", but somehow he's one of the most talented artists of the century. How does that work?",
    "Yeah not every form, style, or rhythm is objectively good, it doesnt matter what genre or culture it comes from. Music theory is just observations that musicians made when they sounds that everybody thought was pleasing, and it’s all math based",
    "Or scientists can analyze dopamine release when certain chords and sounds are played 🤷",
    "There is no assumptions. Music can be anything, but good music strictly follows rules. It valued because it objectively sounds good. A perfect 5th is a 3:2 ratio. It sounds good in any culture. Im not sure what your trying to argue",
    "Im saying that message is irrelevant to around itself and people need to treat them as separate so they can combine the two to make the best music possible",
    "I’m not sure what you’re confused about. You’re operating under some prescriptivist definition of music that places value on production and harmony, attributes that are not present in any commonly understood definition of the word music. That you infer it to be there is the baseless assumption.\n\nYou say that people “can’t just ignore” a scientific standard for what constitutes “good music”, even though they quite clearly can and do. That the reality of what people value conflicts with your own assumption is the whole reason this post exists.\n\nI’m not trying to argue with you about anything, I’m just saying your point of contention, at its root, is either “I think the word music should be more rigidly defined” or “people don’t value the same things I value”. I’m not sure how you think anyone is supposed to respond to that, beyond “I disagree”.\n\nIf you’re actually attempting to make some kind of qualitative argument, then you should just accept that you’re wasting your time. it doesn’t matter what “sounds good”. We don’t hand out gold statues to whomever can construct the most perfect sine wave. Maybe you’re young, but a perfect 5th may as well be a car alarm after the millionth time you’ve heard it. If you force someone to listen to 10 years of Yacht Rock, they’ll be begging you for The Misfits and Megadeth, not more Yacht Rock. You can point to all the scientific literature on 12-tone music theory you want, but that isn’t going sway anyone’s contemporary opinion on what they value in music.",
    "Are you saying you'd listen to a piece with perfect sound and vocal tones on your spectrogram, but the lyrics contain the most offensive shit you've ever heard, and say it has high replay value?",
    "This all just comes down to something not being for you and that's fine. Just move on and stop trying to tell people that the music you like is objectively better than the music they like based on your assumption of how they're engaging with the music... it's lame.",
    "Yes actually that’s a step in the right direction. There are so many even foreign songs where the listener can’t distinguish a single word but are loved because of the sonic quality",
    "I don’t understand the “solved” part of this… but I love to discover a lost song and make it “mine.”",
    "By solving something, it means the community's attempts at searching for the songs become successful and given a band and title behind the mysterious songs, and a year it released",
    "Gatekeepers of music has always been a thing, it's just even more prominent from how much social media is used and ease of flaming people with anonymity.",
    "Try and care less about what other people think. This is all in your head, just like what you like and spend as much time with it as you want. There’s no right or wrong way to consume art. It’s purely subjective. It’s supposed to be fun so do whatever makes it fun to you.",
    "Who cares what other people say? Just enjoy what you enjoy.",
    "I've noticed that's kind of how things have been for at least 30 years, but probably longer. The whole hipster meme is built off of this kind of behavior. Knowing about a cool thing BEFORE it was cool gives you a certain amount of credibility among other people that like that thing. When you gather a lot of people that care about that kind of thing (for example in an online discussion forum) there will start to be increasingly granular details that are deemed important. You'll see similar behavior in almost any fandom whether it's anime, a TV show, movie, book series, or music.",
    "Yeah I mean I'm 33 and people still act like this around my age either younger or older. \nIt was way worse when I was a teenager though so that might be a part of it if you are younger\nThe best thing you can do Is just enjoy what you want to enjoy and don't let people make you feel bad or bully you for liking a different type of music than what is 'normal'",
    "because people are passionate about",
    "I don't think so other than the little clout kids that can make bold clams about their favorite mainstream rapper not knowing there are underrated dudes out there that could sweep mainstream dudes under the rug \n\nOnly other genre I've heard this out of is metal lmao",
    "SUGA from BTS once said that when you discover them is when they debuted for you\n\nTheir career start whenever you find them\n\nIt really stuck with me because it validated my support for them. Artists love new fans and treat them no differently than others. A growing fanbase is always welcome from their perspective and it's all that matters. Supporting an artist you like however you can is what matters",
    "Fuck gatekeepers \n\nEnd of thread",
    "They're not totally wrong,  you used to be able to share music freely or show someone a song and it wasn't weird. Nowadays people are at least annoyed if you want to show them a song because of how individualist it's become.\n\nThere was way more commonality/overlap of musical tastes before algorithms.",
    "I agree with that so much. It’s also like that with movies and tv shows.",
    "Yeah, my sister had some friend who told her “but you don’t like billie eilish as much as me” when my sister tried to connect with her.",
    "That’s awesome",
    "But wait - let's say if you hated Limp Bizkit but only knew two of their songs then I'll stand by that gate all day bro\n\nSome people just hate because they like hate trains and bashing on people's interests",
    "You can though...if you like something just listen it, go to gigs, don't worry about being a 'fan.' Being eclectic in your music tastes means that you enjoy and explore more music. 'Fans' are a bit trapped!\n\nThat goes for everything in life, you only get one go at this so live the life you want to live!",
    "Like it’s a crime for not listening to certain music for 10 years. I don’t know why people make competitions about who did what longer or who listened to certain music earlier."
]