[
    "Rosalía – “Di Mi Nombre” (Flamenco-inspired, but sultry and hypnotic like Billie)\n\nSade – “No Ordinary Love” (Smooth, jazzy, and sensual)\n\nFKA twigs – “Two Weeks” (Seductive, airy vocals with a hypnotic beat)",
    "-i fall in love too easily - Chet Baker\n\n-Like the movies - Laufey\n\n-Decoy - Fievel is Glauque\n \n-Something's wrong with the morning - Margo Guryan ( one of my current faves ) \n\nI have many more :D this is just from the top of my head, if you liked these I'll add more to the list",
    "hii, thankyou for taking the time to recommend listened to \ndi mi nombre (a bit too upbeat for me)\nno ordinary love (love it)\ntwo weeks (okayish)\nthank you again",
    "hii, thankyou for taking the time to recommend. I listened to the songs you suggested and\nI fall in love too easily (love everything about it)\nlike the movies (like the vibe)\ndecoy (love the playfulness)(it's very morning in france dancing in the kitchen in just a white oversized shirt and hair down making breakfast and dancing while your window overlooks beautiful buildings)(sorry I have a tendency to describe songs like that)\nsomethings wrong with the morning (same but somehow better vibe as decoy, love it)\nthankyou again<333",
    "haha I also had a similar image in my head when listening to that\nWhy apologizing ? Don't say sorryyy, you describe it perfectly <3\n\nGlad you enjoyed these!!",
    "I love your music taste",
    "I play a lot of pop on bass, the beats fine but her lyrics are trash. I'll play her if you slip me some cash on the side, but you'd have to be naked and hot to even get close enough to ask.",
    "Oh sorry I didn’t make that clear, I was implying that I do like some pop artists like them… I like their pop music. My bad",
    "Ah, okay. Because you said it several times. It's okay to enjoy pop music.",
    "Totally agree!!",
    "You’ll be happy to know Kanye and co weren’t “escorted out”. \n\nThey left of their own free will.",
    "Milli Vanilli won best new artist in 1990 and they didn’t even sing. \n\nRecord label politics been trumping over real talent for a while.",
    "Artists draw on previous artist's work for influence.  In the 60s, it was all about throwbacks to the Blues music of the 20s and 30s, all of the big pop bands were releasing what was basically Blues standards with electric instruments.  Some, like the Beatles, were honest about it, while others like Led Zeppelin would be sued out of existence today.  It's very common for entertainers to do throwbacks to please the audience.  Currently Thee Sacred Souls and neo-Soul is all the rage.  Their latest album sounds like something Marvin Gaye would record.  It is a constant of the genre.",
    "It's because 80s new wave and pop tended to have heavy basslines, more topical synths, shorter melodic loops (than the 90s)  , and a low barrier to entry. \n\ntoday's music has MUCH crisper production, heavy basslines, but falters in comparison melodically and compositionally.   The 80s were also \"fun\" ... something that has largely been missing from the current scene. \n\nof course, much of this is just my opinion.",
    "The music 'wants to be' whatever the artist wants it to be. Idk what you mean because this decade is one of the most exciting times in music I have ever seen. Most of the stuff I have heard nowadays are beautiful, exciting, genuine, and fun. I'm definitely not saying that other decades were not these things, i'm just making a case for the music today. Nothing has changed much except that there are more tools to utilize. The love for music is still here and it will never go away. ",
    "They probably do have respect for the sound, it's what inspired them to be a performer.  Everything an entertainer does is for the audience, if they don't think we will like it, they won't release it.",
    "The two Billies teaming up on \"Last Night on Earth\" was such a perfect song choice given everything LA is going through. Love seeing artists from different generations and genres coming together like this. Props to Billie Eilish for joining Green Day that duet sounds like it was pretty special",
    "There was a joint interview with Billi Joe Armstrong and billie eilish where it looks like she have a huge crush on him, she’s gay so it’s probably just being a huge fan",
    "I'm in the minority (couldn't help myself) but I prefer it to American Idiot. American Idiot is great and a very easy listen  but I just love the songwriting on 21st Century. It's the last Green Day record I love.",
    "Revolution Radio and Saviors are pretty neat!",
    "I never expected to love RevRad but its become my 3rd favourite behind AI and Dookie. *Forever Now* is one of my favourite songs of theirs at this point. Really liked every song on the album especially Outlaws, Too Dumb to Die, and Ordinary World as the closer. \n\nDon't like Saviors as much - its probably in my lower half of their albums for me but thats more due to how much i love most of the others - but Dilemma is just brutally real and I love it. \n\nOnly Green Day album i didnt like from the start and dont listen to is  Father of All. I even liked the trilogy though it should have been cut down to 1 really good album instead of 3 mediocre ones imho.",
    "Dilemma is definitely the best song off of Saviors!"
]