[
    "1 Taylor Swift\n\n2 Drake\n\n3 SEVENTEEN\n\n4 Billie Eilish\n\n5 Stray Kids\n\n6 Zach Bryan\n\n7 The Weeknd\n\n8 Eminem\n\n9 Kendrick Lamar\n\n10 Sabrina Carpenter",
    "There was just a thread created yesterday saying Taylor’s music is consumed by only white girls. Haha\nThe Tortured poets department opened with 100M streams in China alone in one week.\nAlso, Taylor Swift was the only female as well as non Chinese artist in top 10 of China last year and she was 2nd.\nAnd as an international fan of Taylor, I think USA is actually the only place where she has competition cause globally, those in USA with cultural impacts or GP lovers are all khia’s \nIndian guy here.",
    "and haters still say only Taylor's fan listen to her. NO, Swifties only can't achieve #1 on GLOBAL, STREAMING, SALES and VINYL all at once. this proves the gp LISTENS to Taylor Swift.",
    "Surprisingly, not many kpop acts this year. Last year the top 10 of the sales chart was entirely kpop (with the exception of Taylor Swift). I wonder whether the sales dropped or the calculation methodology changed?",
    "Taylor's legendary status is assured. She is already in the same league with Michael Jackson, The Beatles, Elvis, Madonna.",
    "Cowboy Carter is #18 on the albums chart so it's not too surprising. Beyonce made the top 20 at #18 too. This is the rest of the list btw:\n\n11 Ariana Grande\n\n12 Post Malone\n\n13 Morgan Wallen\n\n14 ENHYPEN\n\n15 Travis Scott\n\n16 Kanye West\n\n17 Lana Del Rey\n\n18 Beyoncé\n\n19 Linkin Park\n\n20 Bad Bunny\n\nI am surprised that Bad Bunny is \"this low\".",
    "I think Kendrick and Beyonce just made really good music this year. It's not a conspiracy. There's certainly industry politics but it's not like there's a movement to bring down Taylor or Drake. (Well, people definitely hate Drake right now but unless proof of the rumored crimes materializes it's not going to go anywhere)",
    "Beyonce’s catalogue is inexistent, Numbers are terrible right and left. It’s weird because songs like single ladies do very low numbers.",
    "# #18: [Reba McEntire - Fancy](https://i.imgur.com/cWs19xN.gif)\n\n---\n\n**Average:** 8.242 **// Total Points:** 824.2 **// Controversy:** 1.635 **// [Rank Graph](https://i.imgur.com/HfBhSER.png)**\n\n---\n\n**Original Rate and Placement:** [90s Country Gals, #2/63](https://www.reddit.com/r/popheads/comments/196keut/90s_country_gals_rate_reveal_day_3_the_rate_that/khv5sb5/) **// Average:** 8.975 **// Controversy:** 1.437\n\n---\n\n(11 x1) flava\n\n(10 x28) 1998tweety, akanewasright, Ambrosia42, babadork, BleepBloopMusicFan, bogo, ConnerY2323, CrimsonROSET, darj, dreamingpastel, ignitethephoenix, ImADudeDuh, impla77, jirachi, jman457, letsallpoo, nt96, RainbowSherbet47, SFbby, ShinyTomato69, skylofte2, Stryxen, TiltControls, TragicKingdom1, uiscebeathaoir, Wane Lietoc, All Fun Cops Are Bastards Edition, wathombe, WindysaStarStarStar\n\n(9.5 x1) nonchalantthoughts\n\n(9 x13) camerinian, Frajer, Ghost-Quartet, hockeynl, Hulnia, jasannn, kerriekipje, krusso1105, lexiaredery, sarcasticsobs, static\\_int\\_husp, stealthamo, therealbayonetta\n\n(8.7 x1) NFLfreak98 (8.6 x1) DirtyRat583\n\n(8.5 x5) Ayzrules, bigbigbee, DaHumanTorch, fadedblue09, icantlikeeveryone\n\n(8.4 x1) beeozan (8.2 x2) emayzee, slimboyfriend\n\n(8 x13) apatel27, FitzMarble, Goorry121, implasdad, Lynflower680, NervousLemon6670, pijus41, PrimaryCrusaders, ricki, Runaway3212, seanderlust, steelstepladder, welcome2thejam\n\n(7.7 x2) diminutiveaurochs, marbIeIily\n\n(7.5 x3) ArcaneLabyrinth, TakeOnMeByA-ha, zadooi\n\n(7.3 x1) Verboten\\_Prince (7.2 x3) indie\\_fan\\_, Poydoo, Sunny\\_Waterloo\n\n(7 x13) Awkward\\_King, bran, buildingigloos, Content\\_Love5312, FreeCuddlesAnyone, frogaranaman, giraffiecathie, mustwinfullgaming, pbk, qazz23, raggedy-princess, team\\_kockroach, vayyiqra\n\n(6.5 x1) hikk\n\n(6 x3) asadprofessorplum, IIIHenryIII, Roxieloxie\n\n(5.5 x1) innuendo\\_overdose\n\n(5 x3) daftsone, moongenightmares, RandomHypnotica\n\n(4.3 x1) xophrys\n\n(4 x2) Nagisoid, undisclosedthroway\n\n(3 x1) pheromenos\n\n---\n\n**diminutiveaurochs** (7.7): loving the storytelling in this one - the stomp-y production feels so Epic and there's an acute sense of drama here, especially with the roaring bite to her vocals. this is what country should be! ~~trying not to focus on the bleak lyrical themes here and pull a full 1997-era fiona apple 'there's no hope for women'~~\n\n---\n\n## Host comment\n\n**flava** (11): I know Fancy only had one chance and she blew it, but idc when you make songs this good you deserve a trillion chances\n\n## Don't let me down!\n\n**ConnerY2323** (10): ok popheads you get a second chance don’t let her down again\n\n**CrimsonROSET** (10): this is your second chance popheads, dont let me down!\n\n**WindysaStarStarStar** (10): we let fancy down twice now, will it happen a third time\n\n**NervousLemon6670** (8): Here's your second chance, Fancy, don't let me down\n\n## fancy this song\n\n**1998tweety** (10): Rare Cracker chew (this sounds awful outside of context)\n\n**akanewasright** (10): there’s a Broadway performer (Julia Murney) who covers this at a bunch of her live shows, and to get into the song, she’d always tell the story about the time she got an offer (without auditioning) to do voice over promos for a porn network… I’m pretty sure that was the first time I ever heard the song, so I think about the “cocktober story” whenever I listen to this\n\n**Ambrosia42** (10): a classic\n\n**babadork** (10): In hindsight, it’s kinda weird that my siblings and I used to sing along to this song in my grandma’s car\n\n**BleepBloopMusicFan** (10): The slay was so loud, Reba herself had to cover her ears with a balaclava.\n\n**dreamingpastel** (10): Apologies to Ms. Reba McEntire. I wasn't familiar with your game when I first rated this.\n\n**ignitethephoenix** (10): she ate so hard here\n\n**ImADudeDuh** (10): https://i.imgur.com/IrbS7QT.jpeg\n\n**impla77** (10): yass narrative yasss\n\n**jirachi** (10): can't believe this did not win omg... everything about it sounds so winner like\n\n**jman457** (10): ooh the soul in this, low key wish Beyonce had a song like this on Cowboy Carter thats so NOLA/ Deep south yet still in the country space.\n\n**Stryxen** (10): stunnnnn should win\n\n**TiltControls** (10): Reba just knows how to sell a story\n\n**uiscebeathaoir** (10): This should’ve won, I’ve never been more mad about results from a rate I didn’t do\n\n**Wane Lietoc, All Fun Cops Are Bastards Edition** (10): this is an epic music video & story & IS radio ready!\n\n**wathombe** (10): wow this song is fire; giving me gallows pole a little bit (that's not a euphemism, it's a reference)\n\n**nonchalantthoughts** (9.5): Don’t you dare take the name of Texas in vain! (She’s from Oklahoma but whatever)\n\n**camerinian** (9): genuinely quite sad that the current country music moment would fucking hate a song like this\n\n**Ghost-Quartet** (9): Classic song with great vocals from Reba but something I don't think people appreciate enough about the song in this day and age is what a statement it made when Bobbie Gentry originally released it in 1969... it touches on topics like poverty, welfare, sex work, which are still pretty taboo even today. I'd give it a 10 but Reba did a live version with Kelly Clarkson that kinda washed the recorded version for me.\n\n**lexiaredery** (9): We need more country rates because this is basically my only exposure to it and I miss it\n\n**Ayzrules** (8.5): this has a really nice melody!\n\n**icantlikeeveryone** (8.5): Wow.... I don't like country genre for 97% of the time, and this song didn't singlehandedly change my opinion, but she sounds very fabulous here, and I really like the melodies, it's so colorful!\n\n**emayzee** (8.2): honestly modern country has really warped my view of the genre bc the old stuff can be GOOD\n\n**slimboyfriend** (8.2): me in the billboard top songs of 2014 when I gave fancy an 8\n\n**apatel27** (8): American dream in a nutshell\n\n**FitzMarble** (8): that one coworker who randomly trauma dumps after a few days of working with them and you can’t escape\n\n**implasdad** (8): good solid country music\n\n**PrimaryCrusaders** (8): I wish all modern country songs could go as hard as this one\n\n**ricki** (8): im sorry this happened to fancy but at least we got this song form it\n\n**Runaway3212** (8): I’m happy All Stars gives you another chance at some songs cause this song has grown on me a lot\n\n**seanderlust** (8): This is kind of Jukebox Hero-coded no I will not be explaining\n\n**TakeOnMeByA-ha** (7.5): i lied to my mom that reba was a converted muslim so i could buy the reba full series dvd collection and showed her this album cover as proof\n\n**Verboten\\_Prince** (7.3): Who the hell names their daughter Fancy anyways?\n\n**Awkward\\_King** (7): im sorry this could've eaten as a lip-sync song fuck the as5 producers for not giving kennedy enough time to learn it (but if youre a texas queen you should already know it by heart kinda) and for not better rigging it for like kylie or ginger\n\n**buildingigloos** (7): It reminds me of the country songs that were popular in the 60s, like a story set to music. Also is this the Brooklyn 99 theme tune\n\n**frogaranaman** (7): \"I was born white trash\" omg finally a lyric this sub can relate to\n\n**mustwinfullgaming** (7): I really liked the verses of this one, but I'm ngl...the chorus let me down sadly. Still a good song though.\n\n**pbk** (7): i still don't think this song is mixed well but it's fun\n\n**qazz23** (7): good cover, like the bigger sound of the chorus\n\n**team\\_kockroach** (7): Maybe it doesn’t need to be 5 minutes long, but I love the narrative of this song a lot.\n\n**vayyiqra** (7): Never realized the lyrics to this are bleak and about grim stuff like poverty\n\n## let her down\n\n**IIIHenryIII** (6): I’m a big country music fan myself, but I never got the appeal of this song\n\n**innuendo\\_overdose** (5.5): it’s no the Night the Lights Went Out in Georgia, I’ll tell you that for free\n\n**daftsone** (5): I wasn’t let down, just not let up either\n\n**RandomHypnotica** (5): the only Reba song i care about is I'm a Survivor\n\n**undisclosedthroway** (4): I didn’t choose to be this way but I just cannot stand country music\n\n**pheromenos** (3): yeah this is very far from my music taste\n\n## why are there so many songs about fancies? and what's on the other side?\n\n**sarcasticsobs** (9): 거기 너 I fancy you, 아무나 원하지 않아, Hey I love you (Love ya)\n\n**stealthamo** (9): Pretty good for not having Charli XCX on the hook.\n\n**welcome2thejam** (8): \"Mama, why is my sister's name Rose?\" \"Because your Pa loved roses\" \"Thanks Mama\" \"No problem Fancy by Iggy Azalea ft. Charli XCX\"\n\n**marbIeIily** (7.7): Charli and TWICE wanted her nachos so bad\n\n**Poydoo** (7.2): IM SO FANCY\n\n**FreeCuddlesAnyone** (7): she cleared the aussie with ease.. twice’s still winning the fancy off though!\n\n**Nagisoid** (4): FANCYYYYYYYYYY YOUUUUUUUUUUUU",
    "another day, another rate eliminated in first out\n\n# #20: [Black Eyed Peas - Pump It](https://i.imgur.com/xRf3wJB.gif)\n\n---\n\n**Average:** 8.195 **// Total Points:** 819.5 **// Controversy:** 1.851 **// [Rank Graph](https://i.imgur.com/nAd07jJ.png)**\n\n---\n\n**Original Rate and Placement:** [Mid 00s Radio Pop, #2/49](https://www.reddit.com/r/popheads/comments/1e8shbg/mid_00s_radio_pop_rate_reveal_day_3_throw_11s_on/lea9gmq/) **// Average:** 9.239 **// Controversy:** 1.394\n\n---\n\n(11 x1) lexiaredery\n\n(10 x30) beeozan, bigbigbee, buildingigloos, camerinian, DaHumanTorch, darj, diminutiveaurochs, DirtyRat583, dreamingpastel, flava, Frajer, FreeCuddlesAnyone, frogaranaman, ignitethephoenix, IIIHenryIII, ImADudeDuh, innuendo\\_overdose, jirachi, letsallpoo, moongenightmares, RandomHypnotica, Roxieloxie, seanderlust, SFbby, skylofte2, Stryxen, TakeOnMeByA-ha, TiltControls, Wane Lietoc, All Fun Cops Are Bastards Edition, xophrys\n\n(9.6 x1) Poydoo\n\n(9.4 x1) jman457 (9.1 x1) babadork\n\n(9 x11) akanewasright, Ambrosia42, Ghost-Quartet, icantlikeeveryone, Lynflower680, pbk, pijus41, PrimaryCrusaders, Runaway3212, sarcasticsobs, TragicKingdom1\n\n(8.8 x2) indie\\_fan\\_, Verboten\\_Prince\n\n(8.5 x7) 1998tweety, emayzee, nonchalantthoughts, slimboyfriend, static\\_int\\_husp, uiscebeathaoir, wathombe\n\n(8.4 x1) Ayzrules (8.3 x2) impla77, implasdad\n\n(8 x7) hikk, Hulnia, kerriekipje, nt96, RainbowSherbet47, ricki, vayyiqra\n\n(7.7 x1) NervousLemon6670\n\n(7.5 x5) Awkward\\_King, FitzMarble, pheromenos, steelstepladder, undisclosedthroway\n\n(7.2 x1) ConnerY2323\n\n(7 x15) ArcaneLabyrinth, bran, CrimsonROSET, daftsone, fadedblue09, giraffiecathie, jasannn, krusso1105, NFLfreak98, qazz23, raggedy-princess, Sunny\\_Waterloo, team\\_kockroach, welcome2thejam, WindysaStarStarStar\n\n(6.5 x2) BleepBloopMusicFan, Goorry121\n\n(6 x2) stealthamo, zadooi\n\n(5.4 x1) marbIeIily\n\n(5 x4) apatel27, mustwinfullgaming, ShinyTomato69, therealbayonetta\n\n(4.5 x1) Nagisoid\n\n(4 x1) bogo\n\n(3 x1) hockeynl\n\n(2 x2) asadprofessorplum, Content\\_Love5312\n\n---\n\n**beeozan** (10): LOUDER!\n\n**diminutiveaurochs** (10): one of those rare tracks with a heavy sample focus that REALLY makes it work - this feels greater than the sum of its parts. I know BEP get a lot of flack for being corny but cmon, this is great fun! I just love the energy here idk no notes im quite literally boppin in my chair. sorry that flava seemingly caught a stray in the lyrics here tho\n\n---\n\n## Host comments\n\n**TiltControls** (10): BEP being one of the few artists with multiple songs in this rate is so funny to me\n\n## F-R-E-S-H we fresh\n\n**lexiaredery** (11): Thank you radio pop for making me realize how absolutely amazing this song is\n\n**buildingigloos** (10): Uses the sample perfectly. Had no idea it was a sample until I was 15 and watched Pulp Fiction for the first time. Fun song to include in DJing\n\n**camerinian** (10): the fact they had this in the pocket for their superbowl show and still whiffed it to a nuclear level??\n\n**dreamingpastel** (10): Is part of my reasoning the fact that I really like the sample? Yeah. It's still a 10.\n\n**Frajer** (10): I forget what album got Kendrick Lamar the Pulitzer\n\n**FreeCuddlesAnyone** (10): straight up pumpin’ it and by it i mean my peanits\n\n**frogaranaman** (10): frat parties really were never the same\n\n**ignitethephoenix** (10): they don’t make songs like this anymore (foreplay for recession pop).\n\n**IIIHenryIII** (10): pumpin’ that… pumpin’ that\n\n**ImADudeDuh** (10): https://i.imgur.com/nidUqNm.jpeg\n\n**innuendo\\_overdose** (10): I stand by this as being a pretty fucking excellent odyssey. All prog rockers should take notes.\n\n**jirachi** (10): me at the gas station idk\n\n**moongenightmares** (10): thought this was hard as fuck at 10\n\n**RandomHypnotica** (10): god THIS is what real music sounds like\n\n**Roxieloxie** (10): louder!!!\n\n**Stryxen** (10): fergies pipes\n\n**TakeOnMeByA-ha** (10): the greatest thing that will.i.am or fergie have ever attached their accursed names to\n\n**Wane Lietoc, All Fun Cops Are Bastards Edition** (10): GOATED\n\n**jman457** (9.4): Quintin Tarinto is shaking\n\n**babadork** (9.1): I’d give the “Miserlou” sample playing on a loop a 10\n\n**Ghost-Quartet** (9): LOUDER!\n\n**icantlikeeveryone** (9): Now it sounds dated but it's still certified banger imo, the raps are fire, and Fergie sounds good even though her part is small.\n\n**pbk** (9): biiiitch\n\n**Runaway3212** (9): we love energy so much\n\n**sarcasticsobs** (9): Baffling that this did not win its rate (sees Timbaland - The Way I Are was also in the rate) Welp!\n\n**Verboten\\_Prince** (8.8): We deserve the version of Uma Thurman with this theme\n\n**emayzee** (8.5): god they're so fucking fun\n\n**wathombe** (8.5): love the Miserlou sample\n\n**Ayzrules** (8.4): it’s not bad, kind of samey throughout but still a bop\n\n**impla77** (8.3): this is peak black eyed peas (they didn't do most of the work)\n\n**implasdad** (8.3): good sample\n\n**kerriekipje** (8): huh, huh, HAAAAAAAAAAAAHHHH\n\n**RainbowSherbet47** (8): I’m sorry but that intro is INFECTIOUS\n\n**vayyiqra** (8): No song should sample \"Miserlou\" ever, it's too recognizable, it's a dumb thing to do. However BEP's specialty is \"dumb\",\n\n**NervousLemon6670** (7.7): Hey does anyone else remember G-Force? It's a film about talking guinea pig super spies that is of course live-action with CGI furballs as the heroes, Nick Cage plays a mole, anyway the reason I bring it up is because every five seconds they play \"Boom Boom Pow\" by the Black Eyed Peas and if I ever hear that song again I will be reduced to a gibbering mess. what does that have to do with this song? Well if you think about it, G-Force is kinda like Pulp Fiction which is 100% what WillIAm was watching stoned out of his mind when he came up with the idea to sample Misirlou\n\n**Awkward\\_King** (7.5): they were on some shit while recording this album that needs to be studied how were they doing this\n\n**ConnerY2323** (7.2): the vocals are STACYING on this one\n\n**CrimsonROSET** (7): a just dance classique\n\n**daftsone** (7): Louder you say? With a song this good, why not\n\n**qazz23** (7): wasn't expecting a Misirlou interpolation, it's pretty good but nothing i'd return to\n\n**team\\_kockroach** (7): What a wildly nutty beat. I love the shit out of it.\n\n**welcome2thejam** (7): Definitely one of the best BEP songs\n\n## second BEP song, BEP stale topic\n\n**BleepBloopMusicFan** (6.5): I’m afraid the relative scoring of being in a meta rate is hitting this pretty hard.\n\n**stealthamo** (6): Not bad, but I could not get over the initial letdown when I realized this wasn't Miserlou.\n\n**apatel27** (5): The sample is the only good part\n\n**mustwinfullgaming** (5): I am not really pumping it sadly\n\n**Nagisoid** (4.5): $HAWK\n\n**bogo** (4): something that's always bugged me about this song is that it just sounds cheap, low quality, whatever, like it just sounds like the great value bargain bin version of actual good pop music\n\n**asadprofessorplum** (2): Has this song always ended abruptly like that?\n\n**Content\\_Love5312** (2): Did you know that their fans go by the \"Peabodys\"",
    "this rate really didn't lose a song until now wow\n\n# #11: [Jessie Ware - Pearls](https://i.imgur.com/2yNqbwk.gif)\n\n---\n\n**Average:** 8.364 **// Total Points:** 836.4 **// Controversy:** 1.816 **// [Rank Graph](https://i.imgur.com/nqxlbej.png)** \n\n---\n\n**Original Rate and Placement:** [2023 Sub Faves, #8/41](https://www.reddit.com/r/popheads/comments/1cfe2oa/2023_sub_faves_reveal_day_three_why_are_all_the/l1ozdvu/) **// Average:** 8.715 **// Controversy:** 1.640\n\n\n\n---\n\n(11 x2) ImADudeDuh, indie\\_fan\\_\n\n(10 x31) 1998tweety, Ambrosia42, Ayzrules, babadork, bogo, camerinian, ConnerY2323, CrimsonROSET, DaHumanTorch, DirtyRat583, dreamingpastel, flava, FreeCuddlesAnyone, frogaranaman, Ghost-Quartet, Goorry121, hockeynl, icantlikeeveryone, ignitethephoenix, jirachi, krusso1105, Lynflower680, Nagisoid, nonchalantthoughts, pbk, pijus41, qazz23, RainbowSherbet47, TragicKingdom1, wathombe, welcome2thejam\n\n(9.5 x2) jasannn, NFLfreak98\n\n(9.2 x1) innuendo\\_overdose\n\n(9 x12) BleepBloopMusicFan, Frajer, implasdad, lexiaredery, nt96, ricki, skylofte2, static\\_int\\_husp, stealthamo, steelstepladder, therealbayonetta, vayyiqra\n\n(8.8 x2) diminutiveaurochs, NervousLemon6670\n\n(8.5 x4) emayzee, Poydoo, Stryxen, uiscebeathaoir\n\n(8.4 x1) Sunny\\_Waterloo (8.3 x1) impla77\n\n(8 x16) akanewasright, bran, FitzMarble, giraffiecathie, hikk, mustwinfullgaming, PrimaryCrusaders, RandomHypnotica, Roxieloxie, Runaway3212, seanderlust, SFbby, TakeOnMeByA-ha, team\\_kockroach, TiltControls, WindysaStarStarStar\n\n(7.9 x1) Verboten\\_Prince (7.8 x2) jman457, zadooi (7.6 x1) marbIeIily\n\n(7.5 x1) undisclosedthroway\n\n(7 x7) buildingigloos, Content\\_Love5312, fadedblue09, IIIHenryIII, pheromenos, sarcasticsobs, ShinyTomato69\n\n(6.8 x1) kerriekipje (6.6 x1) moongenightmares\n\n(6.5 x3) ArcaneLabyrinth, Awkward\\_King, xophrys\n\n(6.4 x1) slimboyfriend\n\n(6 x5) asadprofessorplum, bigbigbee, daftsone, darj, raggedy-princess\n\n(4.5 x2) beeozan, Wane Lietoc, All Fun Cops Are Bastards Edition\n\n(4 x1) apatel27\n\n(2 x1) letsallpoo\n\n(0 x1) Hulnia\n\n---\n\n**diminutiveaurochs** (8.8): This is kind of a by-the-numbers disco-infused dance track (compliment). I know I just dissed Caroline's track for being devoid of soul, and I guess one could argue that this one is a bit vapid here and there, but at least - unlike Caroline - Jessie isn't trying to do anything but make you dance. It succeeded in its mission so I'm slappin a 9 on it. Bop\n\n**beeozan** (4.5): this song is fine but her music is so offputting to me now. the other day i put on *What's Your Pleasure* and turned it off 2 minutes into \"Spotlight.\" I left her in 2022\n\n---\n\n## Host comment \n\n**RandomHypnotica** (8): In this moment, i regret not sending Begin Again\n\n## shaking it \n\n**ImADudeDuh** (11): https://i.imgur.com/0PSyF1E.jpeg\n\n**1998tweety** (10): mother of pearl\n\n**Ayzrules** (10): oh VIBES, love the disco influence. This is my first time listening and i’m obsessed\n\n**camerinian** (10): this has massive old gay energy and i mean that as such a plus\n\n**ConnerY2323** (10): sneaking around in sunglasses and a trenchcoat behind jessie picking up all the pearls so i can pawn them to pay rent this month\n\n**CrimsonROSET** (10): i know there are multiple songs telling me the contrary but i cannot fathom jessie ware actually being kinky in my head the slightest bit of lace poking out from underneath her shirt is already scandalous\n\n**flava** (10): not my favourite song off the album but that album is so fucking stacked\n\n**FreeCuddlesAnyone** (10): i mean who would hate this\n\n**frogaranaman** (10): stop! only so many pearls can be shaken off!!\n\n**Ghost-Quartet** (10): I revisit this album so much and it still hasn't gotten old.\n\n**icantlikeeveryone** (10): She's such a disco queen! It makes me imagine myself dancing happily with a random stranger lol.\n\n**jirachi** (10): best song ever i cannot believe it\n\n**Nagisoid** (10): Hot Girl Anthems\n\n**pbk** (10): levels of pussy thought impossible\n\n**qazz23** (10): really like how she belts out that chorus\n\n**RainbowSherbet47** (10): I think I’ve never heard a song capture the 80s sound as well as this holy shit\n\n**wathombe** (10): oh this is a bop\n\n**welcome2thejam** (10): When you look up the moon line on Genius for some reason it just links to a Google Image search of \"jessie ware pearls lyrics\"\n\n**NFLfreak98** (9.5): jessie don’t miss\n\n**innuendo\\_overdose** (9.2): not the best tune on the record, but damn it’s a tight record\n\n**BleepBloopMusicFan** (9): It’s weird because I had no problem giving both of the 2023 Sub Faves submissions 10’s in their original rate, but in a meta rate context…it’s just different. I can’t quite say that this matches up to Caroline’s slay.\n\n**implasdad** (9): good voice\n\n**lexiaredery** (9): I was playing this album so much last summer I may have made my Mom a Jessie Ware fan\n\n**vayyiqra** (9): I will not say what I think the pearls really are\n\n**NervousLemon6670** (8.8): Yeah sure that's a good retro throwback I can dance to this\n\n**Poydoo** (8.5): bop\n\n**Stryxen** (8.5): I know you wanna go to the moon. But if you don't go you'll never get there 🧐👨‍🏫\n\n**uiscebeathaoir** (8.5): re exploring this album after having gotten hugely into classic disco is such a fun experience, I have so much more respect for this song. I will say though that while this is a gag, Begin Again would’ve been THE gag\n\n**mustwinfullgaming** (8): I AM SHAKING IT AND THERE ARE NO PEARLS LEFT TO FALL OFF COME BACK MY PEARLS PLEASE I NEED YOU\n\n**Roxieloxie** (8): cute\n\n**Runaway3212** (8): Rose Gray should target this tea\n\n**seanderlust** (8): The album cover on the Spotify playlist is so right, this is a hot girl anthem\n\n**TakeOnMeByA-ha** (8): shes like bruno mars for 20-something white gay men\n\n**team\\_kockroach** (8): I think Begin Again should’ve been chosen instead, but this is still an infectious jam that showcases Jessie’s incredible talents.\n\n**TiltControls** (8): I used this as the trailer music for that rate cycle and now it's all I can think of when I hear those opening notes\n\n**WindysaStarStarStar** (8): wake up pearl! You’re about to be shook down\n\n**Verboten\\_Prince** (7.9): Shake those pearls!!\n\n**jman457** (7.8): good disco throwback\n\n**marbIeIily** (7.6): Pearl, so confusing\n\n## tired\n\n**buildingigloos** (7): I was genuinely confused when cupid by fifty fifty wasn't playing at the start\n\n**Content\\_Love5312** (7): A perfectly fine disco song from an album that I revisit often.\n\n**IIIHenryIII** (7): Love Me Like You Do is not a hot girl anthem at all (this is a comment on the compilation from Spotify)\n\n**pheromenos** (7): dgaf about her\n\n**sarcasticsobs** (7): Disco, how groundbreaking\n\n**slimboyfriend** (6.4): she’s cute but she’s got NOTHING on Ooh La La\n\n**asadprofessorplum** (6): The way this song was in my 2023 Spotify Wrapped Top 5 but now it’s kind of a skip…\n\n**daftsone** (6): What a voice\n\n**darj** (6): the way “Lightning” is my favorite song on this album I’m the sole dumb bitch yearning for Jessie to return to 2013 blend of Disclosure-core and sophistipop\n\n**apatel27** (4): So sick of this sound now",
    "# Slumber Party Pop\n\n---\n\n**Overall Average**: 7.821 **// Average Controversy:** 2.221\n\n---\n\nbeeozan: at least it's always nice to know that no matter how bad our rate results are it won't be as bad as slumber party pop\n\ndiminutiveaurochs: I didn't do this rate at the time (nor catch the now-legendary reveal), so this section of the rate was full of pleasant surprises! I really enjoyed the bright, carefree production on all these tracks - really dreamy and easy to lose yourself in.\n\n---\n\n* \\#15: Chappell Roan - HOT TO GO! | 8.267 | 826.7\n* \\#25: Hemlocke Springs - Enknee1 | 8.121 | 812.1\n* \\#30: Hemlocke Springs - Girlfriend | 8.023 | 802.3\n* \\#55: Remi Wolf - Quiet on Set | 6.873 | 687.3\n\n---\n\n**welcome2thejam** (10.000): Bitch!!!\n\n**Wane Lietoc, All Fun Cops Are Bastards Edition** (9.650): lol the gift that keeps on giving! nice to revisit the hemlocke cuts to confirm that she did have it\n\n**innuendo\\_overdose** (9.250): thank you so much for giving me a quick Slumber Party Pop rundown without having to listen to any Baby Queen, love that so much <3\n\n**jirachi** (9.250): unnecessary remi massacre and the wrong chappell songs winning ou that's not...\n\n**Ghost-Quartet** (9.000): I think some people questioned my All Stars picks for this rate because they weren't the obvious frontrunners and I think that's totally fair, but also their absence meant they got voted in and now Slumber Party Pop has four songs in the rate. We just can't stop winning girls~\n\n**Verboten\\_Prince** (8.725): Should have done this one man… Popheads makes crazy predictions but when they get a pop girl right they get it RIGHT\n\n**slimboyfriend** (8.625): damn babyqueen flopped so hard she was erased from rate history\n\n**nt96** (8.500): Remi was robbed!! Future rate winner of 202X!!\n\n**Roxieloxie** (8.200): One of the most interesting rates we've done that has such a early sub energy to it (affectionate) i love this as a snapshot of what chappell was like on the verge of her rise but not quite her peak yet, its fun little time capsule and one of the best themings i've ever seen a host do for a reveal\n\n**qazz23** (8.000): Hemlocke and Remi were the best ones here\n\n**uiscebeathaoir** (8.000): y'know once Baby Queen’s out of the equation this was a pretty solid rate idea\n\n**pheromenos** (7.900): lowkey i still don't get the concept of this rate, and especially in retrospect rating midwest princess with these three khias was funny as hell\n\n**Nagisoid** (7.875): 3 pop bibles and Chappell\n\n**apatel27** (7.875): Biggest setup since tumblrcore\n\n**IIIHenryIII** (7.750): I wish I could back to fix all of my scores for Chappell\n\n**vayyiqra** (7.000): zzz\n\n**ImADudeDuh** (7.000): the best banners AND the best shitposts ever, this rate was kinda instrumental to chappell blowing up\n\n**flava** (3.875): Baby Queen you will likely never be famous\n\n---\n\nUser Averages:\n\nRandomHypnotica: 10.000\nwelcome2thejam: 10.000\ndarj: 10.000\nakanewasright: 10.000\nlexiaredery: 9.875\nWane Lietoc, All Fun Cops Are Bastards Edition: 9.650\nkrusso1105: 9.625\nGoorry121: 9.500\nCrimsonROSET: 9.500\nAmbrosia42: 9.425\nFrajer: 9.375\nWindysaStarStarStar: 9.250\ninnuendo_overdose: 9.250\nLynflower680: 9.250\npbk: 9.250\njirachi: 9.250\nbogo: 9.000\nRainbowSherbet47: 9.000\nGhost-Quartet: 9.000\nShinyTomato69: 9.000\nwathombe: 8.900\nBleepBloopMusicFan: 8.750\npijus41: 8.750\nVerboten_Prince: 8.725\nslimboyfriend: 8.625\nemayzee: 8.575\nsteelstepladder: 8.500\nPrimaryCrusaders: 8.500\njasannn: 8.500\nnt96: 8.500\nhikk: 8.500\nletsallpoo: 8.500\nNFLfreak98: 8.450\nAyzrules: 8.375\nDirtyRat583: 8.325\nskylofte2: 8.250\nContent_Love5312: 8.250\nhockeynl: 8.250\nHulnia: 8.250\nRoxieloxie: 8.200\nTragicKingdom1: 8.125\nstatic_int_husp: 8.125\nFitzMarble: 8.100\njman457: 8.075\ndiminutiveaurochs: 8.050\nbigbigbee: 8.000\nqazz23: 8.000\ntherealbayonetta: 8.000\nSFbby: 8.000\nseanderlust: 8.000\ndreamingpastel: 8.000\nuiscebeathaoir: 8.000\nTakeOnMeByA-ha: 8.000\npheromenos: 7.900\nNagisoid: 7.875\nstealthamo: 7.875\napatel27: 7.875\nIIIHenryIII: 7.750\nArcaneLabyrinth: 7.750\nAwkward_King: 7.750\nignitethephoenix: 7.650\nmoongenightmares: 7.650\nsarcasticsobs: 7.625\nundisclosedthroway: 7.625\nteam_kockroach: 7.625\nSunny_Waterloo: 7.600\nricki: 7.500\nbuildingigloos: 7.500\nTiltControls: 7.500\nbran: 7.375\nimplasdad: 7.350\nfrogaranaman: 7.250\nmustwinfullgaming: 7.250\nraggedy-princess: 7.250\ncamerinian: 7.125\nNervousLemon6670: 7.025\nvayyiqra: 7.000\ngiraffiecathie: 7.000\nImADudeDuh: 7.000\ndaftsone: 7.000\nConnerY2323: 7.000\nbabadork: 6.975\nRunaway3212: 6.875\nimpla77: 6.775\nzadooi: 6.700\nnonchalantthoughts: 6.650\nbeeozan: 6.625\nicantlikeeveryone: 6.600\nFreeCuddlesAnyone: 6.500\n1998tweety: 6.125\nmarbIeIily: 6.075\nStryxen: 6.000\nDaHumanTorch: 5.875\nPoydoo: 5.675\nkerriekipje: 5.325\nxophrys: 4.875\nfadedblue09: 4.750\nasadprofessorplum: 4.500\nflava: 3.875\nindie_fan_: 3.300",
    "who did math rock better?\n\nvanessa carlton - a thousand miles or that one midwest emo beyonce song on the I Am side of Sasha Fierce?",
    "## tha o shit blueeee\n\n**ImADudeDuh** (6.5): https://i.imgur.com/WJy30vB.png\n\n**TakeOnMeByA-ha** (6.5): its insane how much worse this is than the charli xcx remix\n\n**apatel27** (6): Closing montage sounding song\n\n**daftsone** (5): I sort of enjoyed this … in parts, maybe I just don’t quite get what Caroline was going for\n\n**frogaranaman** (4): I'm having war flashbacks to my old job\n\n**vayyiqra** (4): Caroline keeps being an interesting phenomenon, like musically she was autogenerated in a lab to pander to fans of the nebulous genre of \"art pop\", but that's why I don't care for her a lot.\n\n**FreeCuddlesAnyone** (0): i gave this a 3 in the original rate and i dislike it even more now? like i do think there’s a good base behind it but good lord i don’t like the way Caroline utilise her vocals here at all. like most of it is just her making noises for the sake of it… we kinda wanted DANG instead.\n\n**ignitethephoenix** (0): extremely overrated song. Technically isn’t isn’t poor but it just is very irritating to me and I’ve never been a fan of Caroline’s voice and I would like this more if she didn’t just wail randomly half the time over it."
]