[
    "> They're in the way of new bands. Radiostations, festivals, media and award shows (I'm looking at you Grammy's!) Lol this is just another typical \"no good new music because I only listen to top 40\" shitpost but with a different shade of paint. They're not in the way of new bands.",
    "Not sure what youre talking about man. There are tons of new bands making great music right now. You just have to know where to find them. Its not older bands fault that new bands arent more popular. Commercial radio stations dont play new, up and coming bands and MTV doesnt play music videos anymore. That doesnt mean there isnt good music out there. Its just not being promoted by big labels and radio stations like back in the day. This isnt Kiss fault. Its Universal Music Group, Sony Music Group, and Warner Music Groups fault. These companies decide what gets popular. And they play it safe. These big companies are risk averse. So if you want to listen to good music you have to find it on your own.",
    "It's not rock music's fault countless generations have failed to produce their own music that has wide appeal. It's the marketing department who aim at sectors and push performers toward those sectors. And what are awards anyway? someone's idea to make a cheap bag of money that's all.",
    "So do other artists have to stop working when some arbitrary redditor decides its time? Give your head a shake and go support the bands you want to see/hear.",
    ">They're in the way of new bands. Well, maybe if the new bands produced better music, they wouldn't be so threatened by the old bands.",
    "![gif](giphy|9Vkm7LGgrPTcA345Sb)",
    "Iron Maiden: Nicko McBrain-72, Bruce Dickinson-66, Steve Harris-68. U2: Bono-64, Edge-63, Larry Mullen-63, Adam Clayton-64. Im 60, and admit that I dont want to see bands with 1 or 2 original members still out on the road. And I still think of Alt-Rock and Grunge bands as new rock. Tom Morello from RATM is 60. Duff from GnR, too. Lead singers from Counting Crows, Jesus Jones, Mighty Mighty Bosstones, Soul Asylum, Hole, Warrant, Slaughter, etc etc all 60. You need to decide what old and new is.",
    "Ok, so, youre wrong, but before I tell you youre wrong, youre going to have to clarify something. Do you mean before the *band* turns 40 or before the *musicians* turn 40, because either way, you are being ageist as *hell*. Like, are you listening to yourself? The Pretenders didnt achieve success until after Chrissy Hynde turned 30, and they kept making music into her 40s. Cyndi Lauper released *Shes So Unusual* at the age of 30 because she refused to tell her label how old she was. And that *started* her career. Paul Simon released what is possibly his most successful and influential album, *Graceland*, at the age of 45. BB King continued to record music and influence artists until the day he died. The same could be said for Ray Charles. And Aretha Franklin. Also, there *are* a lot of kids out there who are discovering old music. Look, Im not saying that the KISS hologram show isnt a cash grab. It is. But Im also saying that in the alternate universe that Christine McVie was still alive, Stevie Nicks & Lindsey Buckingham made up, and Fleetwood Mac got back together I would be in line to buy tickets. And Im 36.",
    "Define Rock music? Do you listen to the Rolling Stones? When was the last time they got a Grammy? I guess life ends at 40 huh? If you havent created something worthwhile by 40 quit? What does age have to do with it. I feel bad for you, if at 51 you feel this way how do you have anything left to look forward to. I am quite a bit older than you, I have seen music change, Rock as well as what they used to call Country. So tell Stevie Wonder to Stop, Santana, and you mentioned U2, so who else? Coldplay? The music I listened to, my Generation, was the Beetles, Creedence Clearwater Revival, Eagles,Led Zeppelin, Linda Ronstadt,Tom Petty,Queen, The Who, Eric Clapton, James Taylor,Talking Heads,Steely Dan, Lou Reed,ZZ Top, Lynyrd Skynyrd, Jim Croce, Nazareth,Al Green,Heart,and many more. It was in my opinion the best music, bands and singers in all time. Not only could we listen to these bands we could see them in concert and we didnt have to sell a kidney to do it. Yeah, it may have been festival seating but who cared. There may have been some passing around of smoking material, from people that we didnt know, but everyone was chill, it was a different time, if I could go back and see those bands again I might, I did see Elvis Costello in the early 2000s it was great, but you cant capture that magic again. But to say they are getting Grammys and not allowing new talent? Maybe politics could enter into it. Ive seen what has gone on the few times Ive watched. sour grapes this person has had this many Grammys but cant get best album. If enough people whine about it, maybe they will get it, even if someone else may actually be more qualified for that category. I dont care who gets what but how old are these people? I hope things work out so you feel better about rock, or Rock v Heavy Metal. No one should feel bad when listening to music. It even calms down my Great Pyrenees when she gets grouchy, so I wish it would do that for everyone. Oh and today, on Valentines Day go have a listen to Three Dog Night Just an old fashioned love song, it is one of their older ones, but a goodie. Music should make you feel good, if it doesnt, find something else that does. Its all about memories to me.",
    "I love new music! You know, like from the eighties!",
    "Strange that you take away that from my post. It's the very opposite. There are a lot of great new bands. But it's like The Stones or The Beatles come up with a mediocre album or a half a song everybody's in awe. And I never listened to any chart in my life by the way.",
    "That partial is a reason. But what if, let's say U2 quit in 2000? Record labels would have needed to adapt and promote new bands to radiostations. But they didn't and I believe that didn't trigger their label to sign new talent. The same with festivals. They complain that there aren't any new rock bands and bands are aging. Rock bands are still a major pull for people to buy tickets. Until the 90s festivals helped making new bands. After that they kept signing the same old bands because festivals were on a high and people had money to burn. So why risk anything. But that kept younger bands back. And sure times changed. Streaming, radio everything is readily available to find new music. But I'd like to see this young bands make it as big as well.",
    "60 is old. I'm 51, that's starting to become old!",
    "I deliberately restricted myself to bands. Artists making music, no matter what age, should make music till they drop. And of course I'm over exaggerating some what. But I still think that every decennium deserves their own musical heroes without old acts \"being in their way\". Let Fleetwood Mac be a band from the 70s and 80s. Like The Stones should have stayed a band from the 60s and 70s and U2 from the 80s and 90s. The 2010s and 20s need their own big names.",
    "Really? The Stones and The Beatles won Grammy's this year!? You play whatever you like. And artists should make new music until they die. I don't mind at all and I love music from the 60s onward.",
    "People like what they like. And those bands earned their respect as much as any new band out there stuggling. Do you want to dictate what people listen to? You might get a nice job at Spotify if you do.",
    "What new bands are the Rolling Stones preventing from playing your local football stadium?",
    "Young rock bands arent gonna get big the way they used to in the 60s through the 90s unless there is some sort of cultural shift. TikTok decides what is popular now and currently that means vapid pop music. And if you go by what these corporations dictate as popular, you will be very disappointed. However, take a band like King Gizzard and the Lizard Wizard. They have a huge following with fans around the world. Theyve put out 26 studio albums since 2012, tour constantly with each concert selling out and they dont show any signs of slowing down any time soon. But you wont hear them on mainstream radio or in Super Bowl commercials. They are still considered an indie band. If they would have come out in the 70s they would probably be as big as Led Zeppelin or Rush. The culture needs to change. I dont know what it would take for that to happen but I often think about when Nevermind came out in 1991. At the time rock was dominated by glam and hair bands and the number one artist was Michael Jackson. Nevermind ended up unseating Michael Jackson from the number 1 spot and grunge became mainstream overnight. Preppy kids and jocks started wearing flannel shirts and Converse and every record label was looking for the next Nirvana. The music in the 90s was pretty great as a result. Weve had a lot of great bands since Nirvana but the culture has slipped back in to pushing pop music like it was in the 80s. So the culture needs to change if we want to see a resurgence in rock music.",
    "One of U2s more under appreciated songs was written in the 2000s. Its called Stuck in a Moment, and Bono wrote it about Michael Hutchence from INXS. It was overplayed to shit when it was released, but its not a bad song. The Rolling Stones also continued to have good output in the 80s. Look, Im not saying that the situation with the Grammys isnt fucked up, but your blame is misplaced. The problem isnt with the artists its with the record industry as a whole.",
    "Casey I agree, I was replying to to the original poster. If youre good you get noticed. I grew up on music from the Big Band Era to listening to my cousins big girls dont cry. But the 60s and 70s were my years, 70s High School and boy did we have the GREATEST MUSIC! And the Concerts WOW! No ticket Master. I lived near a college Town so you bought the tickets there, you didnt worry about the best seats there were none. It was the greatest time to grow up. I cant say it was all flowers and sunshine and peace  signs all the time. It wasnt. My car was broken into when I tried to save money and parked somewhere I probably shouldnt have. They stole a bunch of tapes, but they were all tapes I had made off the radio I bet they really hated that.",
    "The Grammys are a joke. It's cool if they get something moderately novel nominated and winning but the bar is on the floor. I mean even the Simpsons clowned on them in the early seasons",
    "Nobody has a desire to give media presence to an actual feminist anthem. It sounds catchy, is thought provoking, and kinda just plays into a rage a growing number of women are feeling these days. I didn't think it was Grammy worthy-verse 2 in particular got a bit melodramatic even by my standards- but it is interesting that it's a decent song that gets zero exposure",
    "Kanye is well-versed in history Are we sure about that?",
    "Nonsense rationalization. Just strange, wealthy people's behavior.",
    "The only thing that was on display was mental health issues, and they both need to seek help.",
    "Or we can collectively recognize ceaseless, shameless need for constant attention for what it is. Then ignore it and focus on an awards event.",
    "oh and fuck you too",
    "What was on display was a man rapidly fading from public consciousness, and desperately attempting to be relevant again.",
    "Clearly OP had never even heard of the Grammys 24 hours ago.",
    "Half of you critics can't even stomach me, let alone stand me",
    "> but I have heard how its the awards show that recognises the best achievements in music Hahaha seriously?? Who in the fuck has been telling you this? It's an awards show. They're all shit.",
    "this gets posted literally every year, we get it, nobody is forcing you to watch the grammys",
    "Isn't it just popularity? Which, I mean I know that sounds stupid but texas hold up or what ever it's called was shite but really popular. Beyonce is popular. So she won. At least it's slightly better than the Oscars that nearly always give it to some artsy fartsy shite rather than a decent movie. There's tonnes of artists that are unreal and have amazing albums but never do well at awards because not a lot of people have heard of them - and its not always the bands fault. Radio stations where I'm at play the same stuff over and over and over (that stick season song for example, on a ten hour shift I heard it 6 times). Beyonce could release a single of her sighing for 5 mins and heart would label it a game changer",
    "The music I like didnt even win! Illuminating take, truly How tf did a movie soundtrack from the Coen brothers Buddy tell me you werent alive for this without telling me, that thing was fucking obnoxiously inescapable for *months*. It was *everywhere*",
    "Exactly! Where was the rock? Where were the bands? That's the only music that matters. /s",
    "The Grammy's are one of the most corrupt organizations in music that ever existed. They exist as an offshoot of the labels to help sell more music and drive engagement in their artists.",
    "Mediocre album that had no cultural relevance you cannot be serious",
    "I realized the Grammys were ridiculous in 1978 at age 18. Nominees for best new artist were The Cars, Elvis Costello, Toto, Chris Rea. Also new that year, Dire Straits, Devo, Van Halen, Kate Bush, The Police. The winner? A Taste Of Honey, for their one disco hit Boogie Oogie Oogie",
    "I have a strong disdain for all of these award shows. But as a musician my disdain for the Grammys are unmatched. Its a ceremony of autofellation. Talented musicians do win awards, and honestly every single recipient is probably very talented, that not the point. They dont need this validation. 99% of music created in a year isnt even considered for any given category. But what I dont understand is why theres an audience and why that audience gets upset if their favorite doesnt win. I dont need to state the obvious but I will, they do not care about music or musicians they care about money and selling the albums and artists like Beyonc,Kendrick Lamar, or Taylor swift dont gain an real fans or followers nor do they need to from winning these awards and I hope some serious heavy hitters in the music industry start to stand up for smaller musicians some day",
    "nobody told OP this, they're implicitly aware that they just want to vent and do the \"old man yells at clouds\" thing but they need an angle to frame it as a Take a reddit classic",
    "even awarding Renaissance would be better i mean no disrespect to Beyonce I thought I heard she won for Lemonade or sum shit",
    "i mean some of these winners for AOTY and SOTY are pretty egregious tho",
    "even if the album isnt your cup of tea, to say it had no cultural relevance is just inaccurate",
    "I mean no disrespect after you called her album trash and culturally irrelevant lmao",
    "no, it's the same every year, just don't pay attention to it, you're not the target audience and it doesn't matter",
    "Let's be clear, music is subjective, and it can be hard to argue on both sides on whether she deserved to win or not. But we can look at it objectively to determine if it was reasonable by analyzing her charting and # streams then compare them to another top perfroming country artist this past year. Since she also won top album of the year let's compare her to other top artists as well. First let's look at billboard ratings, which counts how many times a week an album or single is played and charts them on the top 100 or 200 weekly. And by quote \"Chart positions are based on multi-metric consumption, blending traditional album sales, track equivalent albums, and streaming equivalent albums.\" So how often did beyonce chart for top country album? 4 times, 3 in April and once in May. How about charts for top album of 2024? 2 times, 2 in April. To compare the most listened country album of 2024 was Morgan Wallen with \"one thing at a time\" charting most frequently with a total of 34 times between December 2023 and January 2025. To also compare for top album of 2024 is taylor swift with \"tortured poets department\" top charting 17 times. So she clearly didn't win by frequency of top charting in either catagory. What about total number of media consumption like streams? Let's look at spotify for this, She got About 1.6 billion streams in total for \"cow boy carter\". How does she compare to Morgan Wallen? His album \"one thing at a time\" amassed 6.5 billion streams on spotify. How about biliie eilish? \"Hit me hard and soft\" amassed 5.6 billion streams on spotify. And taylor swift? \"5 billion streams on spotify Therefore she doesn't even beat out anyone here by streams either. However, she did in technicality, place 2nd for top charting country album outperforming other artists within the charts and # streams. Now with all that being said, Morgan Wallen was not considered for a grammy this year because his album simply did not release within the required time period. Therefore Beyonce would've won the grammy for best country album this year anyways considering she outperformed other country artists. As for top album of the year? What the hell was this outcome, definitely not deserved when looking at it objectively, and if this isn't proof of Grammys being fixed or biased, idk what is. Let's be clear, I did not like taylor swifts album because I'm not her target audience. but if I'm looking at it objectively, she could've won it. And Let's not forget billie eilish, She definely had a better shot at winning top album of the year opposed from beyonce based off streaming statistics. In conclusion, I think she would've won top country album regardless of what anyone says solely basing on streams and charts (unless I'm proven otherwise by someone else). But top album? Come on people, get real, what do the grammys prove then? If the voting is entirely subjective then why do people watch it? Now to express myself and be subjective for the sake of it, In my honest opinion, I just didn't enjoy her album as much as I expected or quite frankly at all. I didn't find much of the songs catchy and felt like they missed the emotional mark much of beyonces previous top hit songs hold. And to be even more blunt, her album felt more like an attempt to \"represent\" black people in country music in order to \"break\" the system or something along those lines. Honestly, country isn't her style of genre, I applaud the attempt, but I feel like it might have performed better if it felt more like she was interested in the genre, than challenging it and inserting herself in it for the sake of racial demographics. To go deeper, articles about the album glaze over the fact that she's a \"woman of color attempting to break into country music\". In my opinion who gives a shit, that shouldn't be a selling point for anything. Black people and quite frankly any other race can thrive in any genre without having to glaze over their \"identity\" and \"demographics\". In my opinion, to even factor race and sex in an non-athletic form of competition is just disgusting and literally the definition of sexism and racism. To compare to her best work \"I Am... Sasha Fierce\", which IMO is a fantastic album rooted with emotion and excellent writing, with songs written about relationships from a female perspective, ultimately proves her ability to legitimately win a grammy and produce fantastic songs. The only song I could sit and listen to without immidiately changing the song from \"Cowboy Carter\" was \"Levi's jeans\" which, I personally didn't find amusing enough to intentionally put it on repeat or on my playlists. And before anyone starts commenting, yes I listened to the entirety of the album, and yes I do occasionally listen to country music. I just didn't like it that much for the aforementioned reasons. I am not a racist and much of the music I listen to comes from African American people. But i don't listen to their music just because they are black, I listen to it because it's enjoyable. I feel alot of people might have a bias to glazing her album because she is a \"woman and black\" which yenno what, that's fine, all the power to ya. But for an award to be bestowed with no statistics to justify it? That's wild to me. And if we factor all of what i said in it just seems like she got the top album of the year grammy for just being of a woman of color attempting another swing at country opossed from statistical performance. Which is just wrong, Beyonce does have the following and skills to outperform her competitors, but she did not stick to her roots which in my opinion, resulted in her win for top album being controversial and a bit insulting. In my opinion billie eilish or taylor swift deserved the win. I hope I don't get blasted for speaking my mind, all here for discussion :)",
    "Nah, Beyonce's album had maybe one good original song on it, and it wasn't that one they played way too much. I personally thought Billie Eilish's album was much better. #",
    "\"The biggest artist of this generation\" is subjective though. What makes you say she's the biggest artist?",
    "The point that you're missing is this album wasn't at all worthy, it was an okay-ish album at best. Albums like the midwest princess or brat should've won which shows more diversity and is damn good",
    "you lost me at woman of color people hate on her 1. bc of the meme that everyone is scared of her and her possible ties to diddy 2. i think its fair to day the album doesnt sound country 3. she has so many already and it feels fair to give the chance to other artists 4. last year jay z had a meltdown over not winning (for once) most of the time you are the one nominating yourself. nothing to do w her skin color.",
    "it is not a country album",
    "Husband pitched a fit last year, remember? Thats how this happened.",
    "You are delusional",
    "Biggest artist? nah that can never be true.",
    "Comments like this is why we have the dislike button on reddit !!",
    "What this sounds like: ![gif](giphy|f7MoTodygKd56)",
    "Listen, I love Beyonce (though I've not been a fan of her recent work but I know she's talented and forever one of the greats) but all I ever saw online about Cowboy Carter was that people weren't a fan. Did I feel like it was unfair criticism at times? Yes. But Cowboy Carter and it's singles weren't widespread favorites and they weren't everywhere either. It was easier not to have heard any of the songs if you weren't listening to the radio. On the other hand, I would say that Billie Eilish's songs were everywhere, on the radio, in stores, used in a movie commercial, etc and for a long time after the album was released. It was also a widespread favorite, even among people who weren't Billie fans. I think Beyonce should've won AOFY at least once in her career but not for this album. The Grammys trying to backpedal and give her this award because they feel regretful over not awarding it to her in the past, is just unfair to the artists who were in the category this year. Create a category for the outliers who didn't get awards when they shouldve, for iconic, culturally significant albums for cases like this so that Beyonce's previous snubs can be corrected but this ain't it. I was honestly surprised by this result and I'm surprised there isn't more push back about it. Now the country album, idk about that one. Idk if it played differently in the country scene but I kind of doubt it. But I can give that a pass, versus AOTY because to me, AOTY surpasses any genre constraints and I don't think she did that. I actually thought this was probably her most under performing album and I felt support for her was falling off.",
    "If this instance doesn't show you that these awards shows are fixed then I don't know what will. Cowboy Carter received 0 (zero) nominations for the CMAs, yet she wins album of the year???? You think someone(s) in the voting section of the grammy's was trying to correct the \"wrong\"???",
    "i just dont understand how impact she is with country album? which i dont know how many song i from her that i hear last year which is only \\*this aint texas shit,if anything about country that deserve might aswell i put post malone album that he made more impactfull with all the featuring country artist. facepalm of the year for this award",
    "Beyonc is soooooooo overrated. Post Malone deserved one last night. Bey sold her soul",
    "Well she couldn't make it in pop rock whatever category so she went country and now they're feeling obligated to have her win. Wow the whole thing is a sham. I don't think she's that talented either. And I thought the rules for each category was that the music had to be at least 50% country or whatever can you really say all her stuff was country?",
    "I'm not a fan of Beyonce. I think she always seems to be the \"center of attention\" and doesn't know how to blend in. I think her trauma with the paparazzi and the public seems to close her off to her fans, and maybe that's necessary. She has some great songs, but even II Most Wanted sounds wrong for me because Beyonce doesn't balance out Miley. However, I can never seem to escape her music nor her vocals. She's a fantastic singer and has written and performed some amazing, some catchy, and some emotional songs. Beyonce is not Beyonce without her voice. With that being said, this was not the album that deserved to win, but I believe the album that was necessary to win. This album for Beyonce feels like she let AI do her homework based on what criteria she wanted and her previous work. Her songs are catchy, and that's cool and all, but when you've been listening to someone for literal decades, you can sense a familiarity in their music. This music doesn't feel like Beyonce. Her last 4 albums sounded like her; different sound, still her. This is \"someone took Beyonces actual country album, tried to replicate it, failed, filled in the missing gaps and then said 'I promise this is Beyonces album\" This award feels like a pity award for neglecting her previous work, and because they got called out. It makes it even more obvious that attention needs to be brought to their nomination and awarding processes. According to Statista, women aren't even nominated for the album of the year as much as men are. \"Between the years of 2013 and 2024, 14.7 percent of artists nominated for Grammy awards were female, and 85.3 percent were male.\" This has been in the media since 2016, but this is the first year they are addressing it. If we want to truly be able to criticize the fairness of whether someone \"deserves\" an award, then the Grammys need to be more transparent about their criteria for nomination and awards. Otherwise, we keep falling into this trap of \"did they actually deserve to win.\"",
    "Clearly she's ver big, even if she doesnt turn me on Not so much to bitch about. She has a very impressive longetivity my opinion is that Beyonce and Adele are boring. Much prefer Lana del Rey and Britney Spears",
    "her country album was trash and shouldnt have won any awards",
    "It's not that she's a bad singer, I LOVED listening to her when I was growing up. I'll admit I didn't listen to the whole album, but I listened to Texas Hold Em (And that was because it went viral so I listened to it a few times) And I liked it and it's still very catchy, but something about it just didn't feel authentic. To me it just felt stereotypical, like most country music I've listened to doesn't just throw every single thing country related into a song. To me it isn't about color, and I think she's an amazing artist. And I'm still young so I don't know completely about the grammys, I just wanted to voice my opinion.",
    "Beyonc is so overrated Billie deserved AOTY award. Period.",
    "I have the album. Ive listened to it when it was released. Im a country fan. Just because I dont agree (AT ALL) with Beyonces win, this dialog of it being because shes black has to stop. The woman simply didnt earn it, and to try to write a huge explanation of why is admirable,,,its just reaching. She didnt earn it. And many other artists did better. Every single thing on this planet isnt about color. Nor are the CMTs required to give her an award when other artists are CLEARLY better at this genera. She and Jay wanted those wins. They used their clout to get them. Thats obvious to MOST people who watched. But, according to you, its all about get color. Come on!!!!",
    "I didnt listen to every nominee for country album so the spectrum of my opinion is limited BUT I did listen to Laineys and beyonces and I am blown away at Laineys. I think Beyonc winning album of the year is special and she earned it but best country album shouldve gone to Lainey Wilson.",
    "yup i agree worked her ass off and really literally bend over for them.",
    "The kids are upset and its ok. We have been there in 2010,2015, 2017, and 2023. They will get over it",
    "Beyonc is not a country artist and shouldnt have won best country album. Period. Thats like if Taylor Swift was to win best R&B album people would be in an uproar because it doesnt make sense, thats not her genre. On top of that, Cowboy Carter was not a great album all together and shouldnt have even been nominated for album of the year and then for her to win it was insane.",
    "Jay z brought and paid for this Grammy. What a joke. How many country fans listen to her album. I don't know any. They should of gave it to Dolly. Since most of the songs where hers.",
    "She's a brand, and that album was just a diversification of her brand. That's it.",
    "The op wants to say everyone is racist who didn't like that Beyonce won",
    "> I think it is so telling that people are being absolutely terrible to Beyonc after the Grammys. Good opening line. > She is genuinely the biggest artist of this generation Are you sure? Most would disagree. Look at Spotify stream numbers. > and people saying that this was rigged are not realizing how hard Beyonc has worked and that these wins were well deserved. Beyonce has worked hard her whole career. How was her award at the Grammys different. Did she work even harder this time? Show, don't tell. > Im not saying that the Grammys havent been unfair before, but I think people are being too critical of Beyonc specifically. People have been so quick to bash Cowboy Carter without even listening to it. People are mad that she won for best country album and are making fun of her, but nobody understands the history behind her album and her true motivation. Again, show, don't tell. What was the history behind the album? What was her true motivation. If you make claims support them! > She reclaimed a genre that has been taken over by white people despite its origins. This objectively not true. Country music was derived from many musical traditions including English, Scots, and Irish origins. African American influence only came about post Civil War times. The genre only gained popularity with the Carter Family and Jimmie Rodgers, both of which were of traditionally \"white\" origins (Jimmie Rodger's family was from Ireland.) > This was well deserved and shows her impact on country music. Explain her impact on country music. How did Beyonce change the genre with this album? >People are also not understanding how big of a deal it is that she won album of the year. Shes been working for over 20 years and she has more than 30 grammys and not one of them is an album of the year. Album of the year is not determined by how long an artist has been performing, but by how popular their music is amongst her fan and in the genre itself. > Billie is only 23 and has so many Grammys, I can guarantee that she will have another shot at album of the year in the near future. (mind you she already has won all of the year) This is a good point and goes more to show how popular Billie Eilish is compared to Beyonce. > I honestly think people are so quick to dismiss Beyoncs career and achievements just because shes a woman of color. I give this paper an F 1. Didn't properly discuss the topic 2. Didn't properly justify the win 3. Didn't compare or contrast Beyonce against the other artists she won against 4. Didn't explain how Beyonce impacted country music; Show, don't tell. 5. Doesn't properly attribute the AOTY. Album of the year isn't earned because one has experience. It's earned because people liked it. 6. Improper association between Beyonce's age and her popularity. Age of the artist doesn't guarantee popularity. 7. Didn't stay on topic. Brings race and politics into a discussion about music. In short, Beyonce didn't deserve Album of The Year because she's black. She deserved it because people liked it... which I'm not seeing evidence that they did. This was an undeserved win. This is why people are being terrible to her. She stole someone else's AOTY. Edit: Also before anyone tries to bring race into my comment, I'm American Indian. Which begs the questions, when are more AI artists going to gain national recognition and popularity and start winning Grammys?",
    "Because Its 100% based whatever reason of the judges opinion of artists who are on popular labels for whatever reason the judges choose. If you every heard someone say \"Music business\" its exactly like a business. Their product is the artist, just like Apple sells iMac.",
    "The only reason she flipped over to country music is cuz she failed in every other genre of music. Even the country singers that have been in the country music industry for decades do not consider her a country singer. Her husband bought her Grammy and all the whining and bitching and complaining that she didn't win all the other times yeah she didn't win.",
    "Bro how stupid do u have to be to not even account for the fact jay z paid radio stations 150 million dollars to pump that album up that high? It wasnt her music, it was her financial situation. That isnt what we care about and it never has been. The Grammys have been a shit show for years and tons of people see it, the only ones who think shes relevant havent stepped out from under a rock in 15 years. Shes made nothing of value since she was on that Austin powers movie and thats facts. She was scouted by jay z at a diddy party, thats where they met, she was also underage. Not opinion, fact. Theyre terrible people using money to control the entire system theyve laid out in front of us, and its happening on almost every front possible at this point. Bro do u actually expect people to believe some of the amazing country music that came out this year is just somehow irrelevant because jay z can push her into any lane and pay her way to streams, radio play, and media presence? Yeah thats not music",
    "Your opinion immediately lost any and all value the moment you chalked up the criticism to you only dont like it cause shes black! Instead of the fact that it had a single popular song and disappeared a month after it dropped, and suddenly appeared again at the Grammys",
    "Here's the reason why I think it's good. Just because an album has good intentions like Beyonce's does not actually make it a good album. I, unlike most, have listened to it. It is trash. It is unlistenable. 2/10 album. I do not want to listen to it ever again. When I listened to it, I was actually going in thinking it would be good, since that is what I heard at the time. I was mistaken. I think it is simultaneously this and the fact that this year was such a HUGE year for music with so many amazing albums and releases that explains why people are so upset. To be honest, I think literally every other artists who was nominated deserves the grammy more than her. Also, to put it lightly, Beyonc is overrated in general. She is a great artist, don't get me wrong, but she has the most grammies. She absolutely does not deserve that title. Also, \"Queen of pop\" is kinda crazy considering there are MANY other pop artists who are better than her. I think people are just fed up with Beyonc being dick-rode to no end and how she is held as some Golden standard when she hasn't made good music in years. Respectfully. I know her cultural impact has been huge and great, but the music is all that should matter in the grammies, and her music is FINE.",
    "What's amazing how people who listen to the likes of Lainey Wilson, Luke Combs, Chris Stapleton, Blake Shelton, George Strait, Reba, Dolly, Alan Jackson, the late Tim McGraw, Brooks & Dunn, the late Charley Pride, Rascally Flatts, Lady Antebellum, Barbara Mandrell, have NEVER heard Beyonce's air play on the likes of Dallas' 99.5 The Wolf... I guess she'll be voted as an outstanding pious woman and influencer in Christian circles next...",
    "I loved the reasoning and logic behind this argument all the way until the end. Loved how you reasoned that Beyonce's album was 2nd top charting country album, which is why she probably did deserve to win that one but I can see argument being made for why she didn't deserve it so also all is fair. But your last few paragraphs that's where you lost me. Maybe you're right maybe people love Beyonce for being black and a women but can't the same argument then be made for Taylor Swifts grammy wins except exchange black for white. That her being a white women is why she does so well with an award ceremony that hadn't awarded a black women album of the year in the last 27 years until this past Sunday. Maybe we can do that with Adele too seeing how the common listeners thought when Adele won and even Adele to my understanding of that night, everyone thought that was the actual year Beyonce deserved AOTY and not her. I think she unrightfully got it after complaining for years about how she was snubbed and to be fair in my opinion, some of those years she was. With her husband last year complaining at the previous grammys about how beyonce never won aoty even though she then and still now has the most grammys awards of any artist or group of all time played a factor and made it look a certain way. Do I think Billie Ellish should have won yes, do I think Beyonce won because she's black hell no because if that was the case she would have won album of the year already. And to just hit home the fact that it's not because she was a black woman performing country to break into it or represent for black people...there have been plenty of times in recent history where country music (CMA's) doesn't award or recognize black artist even when they have number 1 charting hits arguably the biggest country songs over their respective years, being Shaboozey and Lil Nas X. Shaboozey also didn't win any grammys so again I think if we're talking race that argument falls flat. Even with the intersectionality aspect I'm just not convinced. Not including that fact that only 3 black people have ever won period at the CMA's being black and doing country music is clearly not an advantage to anyone, including Beyonce.",
    "Agreed with every one of your points!!! Well said",
    "You reasoning is based off criteria that Grammy doesnt use. If that was the case, she would have beat Beck in 2015. Its based off artistic excellence and they mention that over and over that night. She may not of had the highest streams but her album was rated higher than Billie and Taylors on every outlet from Metacritic to billboard. Billie lost every category, she was never going to win AOTY. She lost to Charli, Sabrina, and Kendrick, 6 noms by 4 people before the last category was even called. Artistically Cowboy Carter was a bit more loaded than hmhas was. In rare cases they choose talent over popularity. Like Beck over Beyonce and Beyonce over Billie.",
    "SO, Beyonc's new album, just like her last one, has her dipping her toes into a genre that's not really her usual thing. The previous was dance music. And, yeah, the album's great and dominated the charts. But, honestly, I'm starting to think it's less about her genuinely wanting to explore these new sounds and more about just... knowing she can conquer anything she tries. Like, she's got such a massive fanbase that she's basically guaranteed to win, no matter what genre she tackles. It almost feels like she's going into these genres just to prove a point",
    "This was a fascinating comment! Thanks for breaking down the metrics.",
    "First of all, your claim that Beyonce only got the top album of the year simply because she's black is the dumbest thing I've ever heard. She won because it's actually a pretty damn good album, and it's completely different from anything she's ever done before. That's why it hit the top of the country charts, even if the country gatekeepers refused to recognize the fact that she was even on the charts. What you don't understand, and refused to even acknowledge, is how country music has deliberately kept black artists shut out of the genre for decades---that's just flat-out racism right there. It's only been in the last decade that black artists have started to make any real headway in country music----such as Mickey Guyton, Darius Rucker, Kane Brown, The War & Treaty, Miko Marks, Alice Russell, Brittany Spencer, Breland, and others. Both Guyton and Rucker have been open in the last few years how difficult it was for them to even get into the country genre, and the racism they're had to deal with along the way, just for being black artists in that genre. This claim that Beyonce should \"stick to her roots\" is a bunch of nonsense, too. She switched up genres because she got tired just sticking to her roots, and singing the same kind of music she's been singing for years. That's what most artists do----they like switching things up from time to time, to keep themselves sounding fresh. I've noticed that white artists get to do this all the time--hop from genre to genre, but black artists are only supposed to stick to singing R&B, gospel, jazz, and hip-hop, as if that's all they can sing or perform. It's an insult to black people to think that's all we're supposed to sing, and it's a bunch of BS. Beyonce literally grew up Texas, where so many country singers come from---that it's not even weird that she should actually be into it. The country music genre has been too lily-white, and too conservative, racist and stuck-in-the-mud for damn near a century know---and that's way too damn long. The country gatekeepers still act like it's the 1950s or something. White people do not have a claim on country music---that is, they are not the only ones who can play it, sing it, or write it, or even like it. Yet the white country gatekeepers still act like nobody who isn't white can't claim country music as their own. Screw that outdated, outmoded BS. The fact that Beyonce hit the top of the country charts is proof that even white people don't mind listening to country music that isn't sung by a white person for a change, and that even they're tired of the same old same old whatever in country music. . That's being said, I'm glad she won, because she deserved to win. She didn't take a damn thing from Billie Ellish or Taylor Swift, who are allowed to sing whatever the hell they want, like most white artists do. Funny how no one mentions the Swift started out as a country artist herself, and how many white pop singers have had hits on the country charts over decades. Yet a black artist like Beyonce tries to do the same thing, and some white folks who like country act like the sky caved in, just because she did. It's so damn ridiculous. If she was white, we wouldn't even be discussing this.",
    "cry about it",
    "Linkin Park has more Top 100 songs on two albums than her entire discography.",
    "i mean one of her albums literally changed the charting schedule for the whole music industry so yeah she's pretty big lol",
    "She's been one of the best-selling internationally known artists for nearly two and half decades, and is one of the biggest concert draws ever. Explain to me how that is supposedly \"subjective\".",
    "lmao yall will do anything so discredit a black woman when shes in a space u dont want her to be. keep hating and complaining shes sleeping just fine at night w her 35 grammys (most in grammy history).",
    "me when i have boring music taste ",
    "me when i dont understand critical theory and the intersections of race and gender bc my brain isnt fully developed ",
    "jay z didn't have a meltdown he simply spoke his mind, chapelle did this, tyler the creator did this, none of them lost composure in any way.",
    "The CMAs are known to snub Beyonc in the past BECAUSE she is Black and unwelcome in that genre. What does her not having any CMA nominations have to do with her performance at the Grammys? People voted for her because she makes good impactful music and she deserves the wins.",
    "The CMAs would be broadcasted in white hoods and burning crosses on stage before they give an award to a black person",
    "why are we not talking about the fact that the Grammys were fixed back in 2016 when she was supposed to win for album of the year and it was given to Adele? It was the most critically acclaimed album and the most successful, YET given to another artist? Its the same reasoning everyone is having for Billie, 2016 was a SNUB. If they cannot put their own likes aside and understand that Lemonade was a FANTASTIC album, then people are blinded. Its the same reasoning that everyone is having for Billie Eilish.",
    "Seriously? I find it interesting how it's okay for Post Malone, who's not even a country music singer, to go ahead and just put out a country album, and it's no big deal----or for Jelly Roll, who was formerly a rapper, to just switch over to country music. The point being, when white pop artists switched over to country music, no one makes a big deal about it----yet according to you trolls, Beyonce shouldn't have been able to do the exact same thing. Apparently it's only a problem when she does it---yeah, okay. The majority of Cowboy Carter is 99% country---which you would know had you actually listened to it.",
    "Um, she spent five years making this album, she didn't just throw it out there, and the fact that it hit number one on the country charts means that she did earn it. She didn't go to the country station to promote because, to be frank, there was such a hateful backlash about her even having played at the CMAs in 2016, even thought she was invited to play there by the Dixie Chicks (they just call themselves the Chicks now) to do a song with them. She got a lot of hate simply for showing up there, which was so damn ridiculous, and hell yes, it was all about her being black. You just refuse to admit that racism has anything to with why there was such hate thrown at her from the CMA audience. Explain to me exactly what Post Malone and Jelly Roll did to earn being country singers, even though neither one did anything like country before last year. What exactly is your definition of what one must do to be considered country, anyway? Oh, and Beyonce didn't have to use her clout to get anything. The point being, I've never heard of a artist who was nominated 32 times, but never won anything. I can't even think of a single white artist that's happened to. She earned it, just like most artists who get Grammy noms or wins have. Clout alone does not get you a Grammy. As usual, none of you trolls know what you're talking about on this subject.",
    "are you white",
    "Lainey Wilson is actually a pretty good singer, but let's be real-----most of these country singers--who are mostly white, of course---start to all sound alike after awhile, and look alike. There's really nothing original or new about the way most of them currently sing. It's like they all have to stick to what an image of a country singer is, and never go beyond that. Which is why country has become so conservative and boring. Which is also why these new black country artists coming up are putting some fresh blood into it, even if the country gatekeepers themselves won't admit that. Country needs to change just like any other musical genre, or grow stale as hell----it can't just keep being stuck in the past forever. That goes for any other musical genre, but country just seems more stuck in a rut, and not wanting to move forward---as if its gatekeepers want to stay stuck in the '50s or something. And it's been nice to see more black country singers coming up, because their mere presence is challenging this old racist idea that country can only be an-all white space, which it's been for way too many decades, and why the hell that is still even the case. That old racist idea that country music is only for white people, when both black and white people started out playing and singing country music together in the mid-1800s, only started in the 1920s, when white guys in the music biz trying to market certain types of music decided that country music--i.e. white people singing and playing guitars--would only be marketed to white folks, while black folks playing guitars would be marketed to them separate as \"the blues\". And it's been that ever since. This is the 21st century----this old, tired-ass racist, completely out of date idea that country is only for white people needs to stop, and be buried somewhere.",
    "Why wasnt Cowboy Carter a good album? Nobody has provided a valid reason for why the album wasnt good. Also thats a stupid comparison. If Taylor Swift MADE an r&b album then she would be nominated. The category is best country album, not artist. Cowboy Carter was a country album through and through so thats not a valid reason at all for why she shouldnt have been nominated.",
    "One song out of 27*",
    "get a job, you clearly hv too much time on your hands, nobody is reading this",
    "Beyonce didn't steal a damn thing from anybody---that's a bunch of stupid nonsense---her gain is not somebody's else damn loss, so get off that. She made a damn good country album, which nobody expected, and finally got a long overdue award for it. It went to the top of the country charts, meaning that enough people liked it to get it up there in the first place. It's made an impact because she also used it as an opportunity to showcase some new and upcoming black country singers, and to show and prove that country music is no longer just a \"white thing\", or something only for white people any more. And your claims that country music is lily-white just goes to show that you don't know jack about black Americans' contribution to country music. Hell, the banjo itself is an instrument that was invented in Africa by Africans in the 18th century or so. These articles show that black American musicians had far more of an influence on some of the first white country singers than they were ever given credit for, and that both black and white musician play what would come to be called \"country music\" until it got segregated for marketing reasons in the 1920s, and the contributions of black country musicians got completely whitewashed out of country music history, and brushed aside, ignored, and forgotten in order to sell country music as a \"whites-only\" musical invention, which it never was to begin with: [Black Artists Helped Build Country Music, Then It Left Them Behind]( [A Dive Into The Black History of Country Music: Giving Credit Where It's Due]( [Country Music Has A Problem: It's Not Beyonce]( [The Black Origins of Country Music]( [Not Their First Rodeo: Black Musicians And The Birth Of Country Music](",
    "me when i just talk to talk without actually knowing why the album was made in the first place. anyways name one genre she has failed in. At this point this sub just hates beyonce because it has been standard practice to do so for so many years now and yall have just stopped putting any critical thinking into your posts/opinions. Wether you like beyonce or not, saying that one of the top 25 best selling artist of all time has failed in every single genre is just laughable. Also, beyonce has never publicly spoken about not winning AOTY. actually she doesnt speak at all. This is why people like you and the rest of this sub feel so comfortable projecting your own opinions about Beyonc onto her & putting words in her mouth. Beyonce has never publicly said anything about not winning album of the year. Beyonce has never said she didnt win album of the year because of her race. Beyonce did not say anything about not being nominated at the CMA awards. Beyonce did not say anything PERIOD. In conclusion: please stop projecting your own made up stories, conspiracy theories, thoughts & opinions onto another person, whom you do not know and trying to put words in said persons mouth that never came out of them. This sub has been doing this for almost a decade now and it just gets really boring. Even you guys have to be tired of every single think piece/unpopular opinion post/discussion thread on this sub being some form of beyonce bad/overrated talk.",
    "i never said that the only reason people dont like the album is because shes black, music is subjective and people are entitled to their opinion. she has dealt with racism and it has impacted her career. her album was on the charts for weeks and there were like 15 trends on tiktok with songs off her album. it was number one for two weeks and continued to stay on the charts. it was also the first album by a black woman to top the country charts, do a google search before commenting next time.",
    "Take a chill pill, like everyone else, I'm just giving my opinion...Who wins a Grammy doesn't affect my life in anyway.",
    "I mean we all have access to the internet right in order to use reddit am I wrong here? Linkin Park has no #1 Hot 100 billboard songs, 3 top 10's, and 26 total top 100 songs. Beyonce on the other hand has 9 # 1's, 24 top 10's, and 106 top 100's (sources below)... we're all entitled to our opinions and if you prefer Linkin Park more power to you, but when it comes to top 100's yeah thats a no. And obvisouly this wasn't including genre list like top rock songs or top r&b because they don't cross compete. But beyonce has more charted songs in her genres/subgenres than Linkin Park does in theirs so yeah. And I came to this post to talk about how I think she shouldn't have won AOTY and I'm not really a beyonce fan [ [",
    "I'm not going to teach you the difference between subjective and objective. Many different factors go into what someone considers \"the biggest.\" Why is everyone on this thread so emotional?",
    "I'm not discrediting anyone. I genuinely asked a question to learn more. Not everything is an attack. Hope this helps.",
    "you? maybe speak for yourself, i understand both things but peoples hatred or rejection towards beyonce has nothing to do with that",
    "right cus free speech is ok until its a black person.. then its a meltdown. give me a breakkkkkk. yall will use any excuse to show off your racism.",
    "One has nothing to do with the other! what the fuck are on about.",
    "Being black has nothing to do with it. Darius Rucker, who is black, has won. The fact is, it's a shit album. But we couldn't let the queen B not get recognized... maybe that's why Ye was there in case she lost",
    "Lol, the opposite is, in fact, true. Theres little that country music would like more than to expand their audience. Why? Because people care about money before anything else.",
    "So is Darius Rucker not black?",
    "People forget that even Adele herself, when winning an award again a few years back (after 2016) said right after she was given her award---that Beyonce deserved that award, period. Or maybe it was 2016---I can't remember. The fact that even she said that should have made people wonder why Bey still didn't win that time, given how huge and impactful Lemonade was on the popular culture scale when it came out. .",
    "You spent a lot of time writing this. And I appreciate your dedication to Beyonce. Im sure it helps you feel better about calling certain people racist. But,,,,I said what I said. Read alllll the other comments on this thread. Look on social media in general. You are one of very very few people who thinks this album is Grammy worthy. Not with the other albums that were presented. Yes. There are racist people. Is the majority of the population racist? Not likely. This album had no business winning against artists like Lainey Wilson, or Chris Stapleton. It was bought. And lets be real. Billie Eilish had a better album. The majority of the nominees did? Did YOU listen to the other artists albums? Cuz I have. Most of them. If you were honest, you would listen, then re-evaluate your thoughts. But you are going to say all those artists are white. Meaning they dont deserve to win, and if they did, its because racism. Very few people think Bey deserved it. Im a fan of hers. I own Cowboy Carter among some of her other work. And I understand and comprehend that just because she made an album outside her normal genre, it DOES NOT MEAN she deserves these accolades. The album simply wasnt as good as the others. Period!!!! Morgen Wallen got his first Grammy nomination with Post Malone this year. His first. Such a joke. Do you know who Morgan Wallen is? Have you listened to his music?? It crushes most of the country albums out there,,,,,,and yet the Grammys never nominated him. Till this year with Post. Why is that? Its odd to me. Its odd to me that Cowboy Carter beat out a huge country artist that has arguably one of the most unique voices:Chris Stapleton. We could call this racist. Cuz Im telling you, and you should hear this: It isnt only white people who are racist. The way it sounds,,,,,is that YOU are the one who determines who should receive accolades based on color. Not achievements. Everyone who is country knows that the CMTs are the serious country awards. They arent having it, hun. Maybe part of it is Beyonces boo-hoo attitude of, They dont like me, they must be racist. Her husband whining and crying last year. Give me a break. She just EXPECTED to win. Because shes entitled. She didnt get recognition at the CMTsso she and her fans scream racism. Im so sick of it. That whole dialog of racism every five minutes by someone. Stop. Everything isnt about race. But,,,,to you, it seems to be. And Im sorry, hun. But the majority of the population feels this way. You cant call everyone a racist. Its just,,,,wrong. She won because she and her husband have power. Everyone knows it. History will remember it that way. Mark my words. Im sure she can live with that fact. She seems to have no shame at this point. Cant even PRETEND to be surprised when they announced her as the winner. Come on!!!!!",
    "Am I white??? Come on, now. Stop.",
    "than why is it a good albumb? i know i'm being a ahter right here and i don't want to. but just to put it simply i don't like her music. it's not like i haven't gave her a lot of tries before but it's just .... bad... pausing right here just to listen to her albumb again before commenting on this and yeah oh and i like her as i person not her music though so not that criticized huh... ok me back after finish listening to (ok not all most of the cowboy carter albumb) it's not \"country\" it just uses similar instruments it's more hip hop in my opinon and can't find it any good..............................",
    "The recording academy votes based on quality of music, not whether it was on someones playlist or not.",
    "basic, surface level lyrics. boring beats. songs themselves flat out werent enjoyable",
    "> edit: this is the last thing ill say > i hv stopped responding to the comments Can't you at least be consistent with you own words?",
    "Here's some good recent books about black folks' contributions to country music: My Black Country: A Journey Through Country Music's Black Past, Present and Future, by Alice Randall---the author writes about her love of country music, and what it was like being one of the few black country songwriters in Nashville in the early '80s, and the racism she had to deal with at the time. Black Country Music: Listening For Revolutions by Francesca T. Royster---this book is about the author's love of country music as a queer black woman, and what it's like being a black country music fan. DeFord Bailey: A Black Star In Early Country Music, By David C. Morton---this is the first book I've ever heard of written about Bailey, the first black country musician to play at the very first Grand Ole Opry, and who is credited with introducing the harmonica to the genre. Country Soul: Making Music and Making Race In The American South, by Charles L. Hughes. This book goes into detail about how black country musicians' influence on their white contemporaries rarely translated into them getting any support for making their own country albums, or even trying to make a career out of it because of the racism in the country music biz. Hidden In The Mix: The African-American Presence In Country Music, edited by Diane Pecknold. This is an interesting anthology of essays about black folks in the country music genre. There was also another book called From Where I Stand: The Black Experience In Country Music, but it appears to be out of print. There was also a 3-CD box set with that same title that came out back in 1998, featuring the work of black country artists I'd never heard of at the time---I'm guessing the book was a companion to it. That same CD box set has been updated as of last year with a fourth CD, featuring a new collection of black country artists that have arrived since 2000. Here's an article about that: [Country Music Hall of Fame Spotlights Black Country Artists With Expanded Version of \"From Where I Stand\"](",
    "Hot 100 are weird metrics, but yes, Beyonce beats them in that single category because she focuses mostly on singles and feats. Take out all the songs with feats and you're down to like, 5-6 tops with anything more than 1 week on the chart. Linkin Park has more top 10 and top 200 songs overall and an Album that absolutely destroys any metric compared to her albums with more top 100 AND nearly doubling the total time being on the charts (Hybrid Theory). Then keep in mind Numb has 2.4 billion views on Youtube And In The End with nearly 2 billion, compared to Beyonce's Halo (1.4) and Single Ladies (1) billion respectively.",
    "You got obliterated and never came back hahaha",
    "I already know the difference---I don't need you to tell me that. She's literally been one of the biggest names in popular music over the past 20 years, not only in America, but internationally---the only other artist who matches her fame-wise is Taylor Swift. That's an objective fact, not subjective. Just because you don't like her, that by itself does not make the fact that she's one of the biggest name artists in the world \"subjective\". That's only your opinion, period.",
    "When did I ever say free speech is okay until its a black person?",
    "Ur literally all up in this thread embarrassing yourself and if you had a bit of literacy you wouldve noticed I was defending jay z as well as Beyonc. Im all for the enthusiasm fighting implicit racial biases but youre literally providing nothing of substance when everyone here is looking to have nuanced discussion about her win. I love beyonce too but boo u need to hop offline ur heated",
    "chill the fuck out. jay z and beyonce aren't the pinnacle of blackness. im fighting ppl left and right based on their reaction towards kendrick bc THAT is racism, beyonce and jay z are just annoying.",
    "it was a meltdown bc beyonc has 35 grammys SOOOOOO the speech was v unnecessary (the beyonc part at least)",
    "ur calling someone else delusional, the call is coming from inside the house. get ur shit sorted first ",
    "Shes a black woman that is not solely a country music artist so that does have something to do with it. Have you even listened to the album before calling it shit? What does Kanye have to do with Beyonc he literally got kicked out two minutes after he got to the Grammys.",
    "Go do a quick google search for me. Racism is still prevalent, especially in the music industry, so it is not uncommon for artists of color to be shunned from certain genres.",
    "Hes the only example anyone here has been able to sight. Its like the CMAs version of Im not racist, I have one black friend",
    "First of all, I write a lot about subjects and things I like, just like anyone else on these boards. I'm not and have never been a part of the \"Beyhive\". I'm simply someone who liked Destiny's Child when they first came out, and thought all three of the ladies in the group could sing, and followed what each of them have done songwise since. Second of all, you're just mad that she won, and that your favorite artists didn't. Come on now----Beyonce winning is not taking a damn thing away from either Ellish or Morgan---everybody already knows who they are, and they're famous, too. So get over whining about them. The fact is, black artists have always been shut out of and ignored by the country music business, until recently, no matter how talented they were. That's just pure racism, pure and damn simple. Why else was Charley Pride the only black country artist they let slip in for decades? It darn sure as hell wasn't because they weren't any other equally talented black artists who wanted to sing country music. Also, how many white artists as talented as Beyonce do you know who have been nominated 32 times at the Grammys and still never actually won one? Can't think of one, can you? I thought not. The thing is, white artists have always been allowed to jump into any genre they want, and still sell CDs, and win awards and prizes for them. Black artists are still expected to only sing gospel, R&B, or rap simply because they're black, told to stay in their lane, and not allowed to jump from genre to genre and experiment/mix things up---which is really ridiculous, in this day and age. Which is what Beyonce did, and some white folks who still have this outdated as hell racist idea that country music is only for white people to play and sing, are just so damn mad that she didn't go through the usual country music gatekeepers and just went straight to the top of the country charts without their permission. Keep in mind, Beyonce did go perform at the CMT's in 2016, to which she was invited, and she got such a nasty backlash from the audience there, that of course she never went back. The CMT even performed the gutless move of cutting her performance out of that special, which was even more pathetic. Basically a lot of white people just flat-out hated the fact that a black artist period was trying to sing country music at the CMT. It didn't matter that she came from the same state as a lot of country singers, and grew up listening to it and liking it, their attitude was that she had no business being there because she was black. I guarantee you if Taylor Swift (who started out as a country singer) had done the same exact thing as Beyonce, nobody would have a single damn problem with it, and you know that. Your opinion is just that--your opinion,period---you do not represent the \"majority of the population\" and it's really arrogant and laughable of you to think that you do. Once again, the fact that she went to the top of the country charts proves that she finally earned that Grammy. She's an artist who has always pushed and challenged herself to put out the best releases, when she could have just sat back, took it easy, and coasted on her back catalog. Even after over 25 years of being in the music biz, her music still sounds fresh, which isn't always the case with pop or R&B artists who have been around as long, or longer than she has. That's why I continue to listen to her music, because I appreciate artists who continue to push themselves musically. Your ridiculous claims that she only won because of her clout are so damn ridiculous. If she could use her clout to win, then how come it took her so long to get a Grammy? Your reasoning about that dosen't even make any damn sense when you really think about it. You're in complete denial about how racist the country music biz is and has always been. That why I posted those articles about country singers Mickey Guyton and Darius Rucker discussing how they're always had to deal with racism throughout their careers as black artists in the predominately white country music industry. Obviously you didn't even bother to read them. It's easy for white people to be denial about racism because they never have to deal with it at all, or just pretend that it dosen't exist, because it never affect them at all. And you keep claiming that Beyonce didn't \"earn\" her Grammy or the right to even be on the country charts---well, explain to me how Post Malone, a pop singer, and Jelly Roll, a former rapper \"earned\" the right to be on the country charts when neither one of them, like Beyonce, were even a part of the country music scene? Funny how nobody has a problem with either one of them switching to country music, even though they're not even traditionally \"country\". I find it interesting that when I asked that question in a previous post, you ignored it completely, and never bothered to even answer that question. Because you know good and damn well it's because they're white. If they were black, they would have never been accepted that quick into the country fold. And there have been plenty of white pop artists that have crossed over into the country charts, like Olivia Newton-John, Jewel, and plenty of others. Yet nobody ever whined about them being on there, and yet white artist still do that with no whines or complaints about them doing the same thing Beyonce has done. Nope, apparently it's only a problem when black artists do it. So stop trying to twists things around and acting as if the very bringing up of the existence of racism is racist---that's just straight-up stupid as hell, and it's always been a reality that black people have had to deal with. You're just pissed off that it's even brought up in the first place--you need to ask yourself why, instead of just whining about it because you didn't want to hear it. I guess you forgot that part of the Grammys where the head of the Grammy voting committee had to explain how there had been changes over the past few years---especially since there have been other black artists complaining over the years about how they feel that black artists didn't get enough recognition at the Grammys. Heck the Grammys didn't even acknowledge that hip-hop existed until the early '90s, when it had already been around for just over a decade. Anyway, Beyonce won, so get over and stop whining and complaining about it yourself. I'm still loving the fact that she finally won, and that she deserved it, lol. That isn't just my opinion, it's a damn fact, which is backed up by her having won in the first place.",
    "i posted it twice by accident thats why i deleted it",
    "i sound ignorant for pointing out systemic racism and discrimination LOLLL?",
    "ok, based on your answer im assuming youre white. you clearly cant understand the hardships that poc face on a daily basis, so for you to say it has nothing to do with color is very ignorant. (also color is an outdated term, use race instead) im not making this all about race, its facts, beyonc has faced discrimination for almost 30 years because shes a black woman. the way you are able to dismiss that and say thats its not always about race tells me everything i need to know. you dont know or understand those experiences (if you are in fact white) and you cant relate to the fact that women of color are constantly put down and undermined whether it is blatantly said or not",
    "Also about Half the songs on her album were COVERS. Blackbird, Jolene, oh Louisiana then she also samples I fall to pieces and good vibrations.. come on",
    "So basically her team won, not her cause I can almost promise you that Beyonc isnt the reason that album has quality if were talking sonically. I seriously dont understand how she won.. and I havent even listened to the album. BECAUSE I DIDNT EVEN HEAR ABOUT IT. I am usually atleast semi caught up with releases in the music industry. I have not heard about this album until like 2 days ago, cant be that good ",
    "i wrote the post, if i decide that i want to respond to your bitch ass im gonna do it",
    "and 1.2 billion of those viewed it to try and make sense of how it got best anything.",
    "girl i was siding with u calm down ",
    "lmao i was agreeing with you and defending your point against the other person lmaooo i was just using some dry humor/sarcasm sorry if that didnt translate well over a reddit post",
    "Your funny  i won't even get into what is wrong with the statement i responded to as it will clearly fall on deaf ears.",
    "No...its garbage. Like for real. I wouldn't even download it for free",
    "Darius won the new country artist award when he jumped from college rock to country, so whats your other argument? And to be honest I think all of Beyonce's tracks are shit. She tried to \"conquer\" another genre and fell right on her face. Then when the CMAs didn't recognize her efforts, they were immediately bigots and racists. Give me a break Ye was there to make sure Beyonce won album of the year.",
    "Charly Pride won in the 70s. When the genre is white guess who's going to win. You guys are just trying to justify racism when it's not that. This is why discrimination will never leave because everyone is looking to be offended by the smallest thing.",
    "You sound young AND ignorant if you REALLY believe that everyone is racist because they dont believe Beyonce earned those wins. I appreciate you strongly defending your position, but its simply not true. Yes. There are some racist people. But everyone who disagrees with this win is not racist. And saying things like that will only haunt you later in life.",
    "You do realize that you said \" you clearly cant understand the hardships that poc face on a daily basis\" then the same sentence you chastised Specialist\\_Age7644 by saying \"so for you to say it has nothing to do with color is very ignorant. (also color is an outdated term, use race instead)\" .......... You just used the term POC and Color yourself, anywhoo Now regardless of whether Beyonce is she/ him/ they/ them/ white / green/ black or polka dotted . It was is a Shit album. I don't think it deserved anything other than a game of Frisbee out the back yard (Vinyl version of course)",
    "There are only two cover songs on the album, Dolly Parton's Jolene and The Beatles' Blackbird. That's it. You just showed that you didn't even bother to listen to it. Otherwise, you'd know those are the only two covers on it.",
    "Seriously? There's a lot of musicians that put out music you never heard of. Go listen to it on youtube, or spotify, or whatever.",
    "And you wouldn't have had to respond if you didn't think there was a chance that I was correct.",
    "![gif](giphy|ixLsslj5TQhxky9P1q)",
    "Then why reply to me with all that bruh reply to someone else LOLOLOL",
    "It did not translate at all but tbf Im horrible at catching sarcasm.",
    "youre* check your grammar before you come for me babe ",
    "Beyonc is also a woman, lets not forget that area of discrimination. Can you name other Black people that are truly successful in country music, a genre that has major ties to Black history? Her music has meaning and she makes tracks that people can relate. Why exactly is it shit. Music is purely subjective to the listener and generalizing every song she has ever made makes no sense. She has made hits for years and no two songs sound the same, so how can you say all her tracks are shit. Kanye got kicked out of the Grammys right after he got there, so stop trying to find some sort of association there. Beyonc made a great album that reclaims the genre, and that is undeniable.",
    "you sound like you want to dismantle DEI bc it causes more racism",
    "Since when is country a white genre? A whole ass genre that was invented by black ppl by the way. Also saying the CMAs are not exclusive because one black person has won makes no sense. thats like me saying the BET awards are not exclusive to black people because Christina Aguilera or whoever may have won one once",
    "You already deleted your comment?? Why?",
    "that is not even close to what i am saying, i definitely did say that beyonc is getting more hate because she is a woman of color, but i didnt say that everyone who disagrees is racist. music is subjective and that is major part of what plays into the hate. i responded to your comment because race is still a big part of the dismissal of beyonc accomplishments and careers. she has been set back before because she is a black woman, i.e. the CMAs. beyonc has said herself that she hasnt felt welcome in the country music scene, and i wonder why",
    "i was quoting what that person said and person of color is the correct term, so i dont what exactly your point is, but try again next time. good for you if you think the album is shit it told a story and had quality music, but youre entitled to your opinion and so am i",
    "wtf are you talking abt, correct abt what",
    "LOL i dont use reddit all like that im sorryi was trying to support ur point",
    "y'all both need to chill tf out im not against black ppl here lmfao",
    "They are all shit. They do nothing but pander to the sheeple, who think they can't do anything wrong. She was losing big time to Taylor Swift so she had to \"find\" another outlet and it failed. But the Queen B can't do anything wrong..... except make country music. She tried to jump on the bandwagon like Kane Brown and Lil Nas X. Quit listening to what the records labels tell you to listen to and make up your own mind. Top 40 music is just for the sheeple, if you want to find real musicians dig through bandcamp and soundcloud to find real artists. And quit getting your panties in a bunch over Ye. It was a joke regarding his actions at the MTV awards. Sheesh ... And btw here's a small list of black country singers who are female: Mickey Guyton Linda Martell Brittney Spencer Rissi Palmer Reyna Roberts Miko Marks Rhiannon Giddens Yola Tracy Chapman Allison Russell Tina Turner Adia Victoria Etta Baker Mavis Staples Brittany Howard Kaia Kater Leyla McCalla Candi Staton Muni Long Valerie June",
    "I certainly am not credentialed or researched in the area, but my Occam's Razor best guess would be that black youth not being interested in or embracing country anywhere remotely to the scale that black youth are interested in and embrace other genres is by far and away the main factor in the dearth of black country music starts. Not discrimination. Not lack of talent. I agree with you that country owes the majority of its existence to black musicians from the 19th and early 20th century.",
    "Omgf!!! Now it's the woman card? The way you tell it, we all would have thought we were still in 1950's racist America.  Child go somewhere with all that",
    "That's a stretch",
    "Read all the above comments from others about other black country artists. She is not the first to enter the country world. Lemme ask you this??? Have you listened to the competing artists albums??? Have you? Under Country or best album? Any of them? Ive listened to many of the albums. Music is subjective. You are right. But when the majority of people think she SHOULD NOT have gotten those awards,,,,you have to ask why? And YOU are saying racism plays into that. Perhaps her album just wasnt that great. People are voicing that opinion. That other albums are better and did better. Its obvious her clout got her those awards. Its fine if you are a fan of hers. I appreciate your defense of her win. But you cant say its all racism. People just think the album is not the winner. Thats all.",
    "Lmaoooo we good dw",
    "And how many of these women chart or are mainstream? I listen to Cowboy Carter and to Beyonc because her music is good, not because some record label tells me to. You are in denial that Beyonc has changed the game and thats it. She won awards, got streams and at the end of the day is still winning.",
    "Let's be real----the average person dosen't know who most of these artists are, because the ones who sing country don't get promoted or played anywhere on radio stations as much as white country artists do. I only found out about them by looking up black country singers online. Staples, Staton, Howard, and Chapman are the better known names only because they were already famous for singing gospel, R&B and rock. Mickey Guyton has been very open in the last few years about the decade she spent struggling to make in it country music, and the racism she had to deal with along the way. I remember coming across some videos she made a decade ago while looking up black country singers to see if I could find any, and ended up liking her voice after listening to a couple of them---she was still pretty unknown back then. I liked her voice, but I thought, \"She's not gonna get pushed or promoted in country music like these white artists always do because she's black,\" and that did turn out to be the case, until a few years back. Here, Guyton discusses how Beyonce's album did help put a spotlight on current little-known black country singers, and also challenged why more black people aren't in country music--it damn sure isn't for lack of talent, or hat black folks don't like it, because some of us do: [Mickey Guyton talks country music and Beyonce]( Oh, and Linda Martell was forced to cut her career in country music short after one album, even after having a hit; performing on the Hee-Haw country music show, being the first black female country artist to perform at the Grand Ole Opry, because of the constant blatant racism she got from white country audiences, and because her record producer, a white guy who was outside of the Nashville mainstream, decided it would be easier to just kick her to the curb and promote a white country singer. Here's her story, her struggles, and how Beyonce put her on Cowboy Carter to give her props for being a pioneer: [Who Is Linda Martell? All About The Singer Featured On Beyonce's Album Cowboy Carter ]( The podcast Color Me Country, created and hosted by Rissi Palmer, is named after one of Martell's songs, Color Him Father. Palmer herself wound up leaving the country music biz after only one album, and has since admitted that it was partly because of the racism she had to deal with, too. She's since gone indie and made a couple of albums on her own, while using her podcast to put a spotlight on not just black country singers, but other country singers of color, too. Here's what Palmer had to say about how country music dosen't really support balck artists---black female artists in particular---as much as they do white artists, and uncovering a forgotten, and hidden history of black woman in country music: [",
    "Uh, no-----it's because for the longest time country music pretty much ignored black country artists and never accepted them. Yeah, they let Charley Pride in the door, but that's mainly because he was selling a lot of records, and didn't rock the boat, so to speak. And it was the usual case of, they had their one black person, and that was all they needed. I used to like some country songs as a child, but as I grew up, it became harder to really like country as a whole when I never saw any country artists who looked like me, and there's the fact that country music itself was always associated with racist rednecks who hated black folks, and deliberately shut them out of the country music business for years--making it seem like country music was exclusively for white people and white people only---which it was, for a long as hell while, and for too damn long, to be honest. More black country artists have been coming up in the last decade, which has been great to see, and aren't keeping quiet about how ingrained the racism in the country music business really is toward black artists even today. Heck, in the last decade the country music gatekeepers have been accused of not even giving female country artists enough play on radio station, and prioritizing male country singers over them. Talk about going backwards. Here's an interview with country singer/songwriter Frankie Staton, who started the Black Country Music Association back in the '90s, along with singer Cleve Francis, as a platform to help black country musicians get a foothold into the business, and what a difficult struggle it was, since Nashville pretty much ignored them,and had no interest in pushing black country singers at all, no matter how talented they were, she said. Which is why the BCMA only lasted barely a decade. There's a Rolling Stone article from a few years back that goes into more depth about them, but Staton talks about managing to carve out a space in country music as a songwriter, dealing with yep, racism, even just for trying to be a songwriter, and the impact Beyonce's Cowboy Carter has had on country music for black country musicians in the article from last year: [Frankie Staton On Building a Future For Black Country Musicians](",
    "\"women accounted for approximately 0.5% of all airplay.\" \"country music, like other genres, continues to exhibit extreme gender disparity with women being underrepresented in all categories.\"",
    "\"Carrie Underwood spoke out specifically against the gender gap in country radio\"",
    "is it tho",
    "music is subjective and beyonc won for best album for a reason. her album tells a story and is a compilation of songs that come together to form a narrative. i stand by the fact that it was deserved and that she has been snubbed in the past due to racism. the academy also doesnt go based on whether the song is good or not its also about the artists accomplishments on the charts, how the album comes together, and whether the music has true quality or not. beyonc has dealt with racism in the past and she continues to as well. i want you to go take a look at twitter and see some of the racist shit people HAVE actually posted after her wins. not all the haters are racist, but there is no denying that racism has played a major part in the hate she has gotten throughout the years and also the discrimination she has faced in the industry. no one else is getting as much hate as beyonc after the grammys even though so many other artists also beat out billie eilish and others.",
    "Changed what game? You think cowboy Carter changed the face of country music? You drinking the same kool-aid as the trumpers?",
    "I dont feel like she reclaimed anything. She essentially made a pop album with some country typical instruments, threw some big name country legends on it and called it a day. If anything, she took away from black female artists that are true country artists. They are the ones we should be recognizing. Not someone who has been famous for the last 20 years, and is making the switch because country is cool right now.",
    "All thats being said, is that her awards were bought. You are defending the winand thats fine. Im black, and have walked this planet much longer than you. Ive experienced racism. And Im very aware of our history. But, when I commented my opinion, your FIRST response to me is, Are you white? You basically lost credibility when you asked that. Why? Because you asked that, and were fully prepared to lecture me about oppression because you thought I was white. This is why Im telling you to just stop. Please, stand up for our rights as black people, but dont boo hoo and make it sound like Beyonce is struggling through horrible oppression. Or that racism is the primary reason she is getting this hate. Her husband threw an embarrassing fit last year, and this year she wins? You think its all a coincidence? Money and power can buy just about anything. Thats what occurred. And as much as you want to say Cowboy Carter told a story or whatever,,,,,it shouldnt have been the winner. But it was. And we will all move on. But just know, that very few people think she deserved it. Not because of her color, but because the content of her album was not that great. Not at all. Beyonce will live the rest of her life under the shadow of this award. Because, although her and Jay think they earned it.few others think she did.",
    "LOL, yeah I didn't see anything special about it, and I personally hated that Texas Holdem song.",
    "Not only country music, music in general. Her album did in fact change country music because it not conventional country music. She is arguably the most influential female artist of our time and so many female artists would say that she is their idol and has influenced their work immensely.",
    "In 2016 when she performed her county song, Daddy lessons from her album lemonade at the CMAs with the chicks and she felt not welcome but she still decided to summit the the song for best country song at the Grammys but they told her that it wasnt eligible. So she went to work and worked on two albums, which are now act one Renaissance and act to Cowboy Carter, but the thing is Cowboy Carter was supposed to be at Act One and Renaissance supposed to be Act Two but because of the pandemic, she felt that it wouldve been best to release Renaissance first to lifted people up and its true because her last track on Cowboy Carter transitions into the first track on Renaissance. So when was time to release act two she already did the work, the proof is in the album. Not only that had three country legends: Linda Martell, Dolly Parton and Willie Nelson she also brought on five young black country artist: Tanner Adell, Brittney Spencer, Tiera Kennedy, Reyna Roberts and Shaboozey whos music numbers boosted after the release, especially Shaboozey whos song, A Bar Song(Tipsy) just entered its 27th week surpassing the weekends, blinding lights. Beyonc was also promoting the girls, especially putting their names on billboards. Wow promoting the album which all of them said, help them gain new fans. And because of her album of the year win they just won their first Grammy. And she dedicated her win to Linda Martell. The album is very thought out with from the instruments being played by Stevie Wonder harmonica, Paul McCartney and Nile Rodgers on guitar and Rhiannon Giddens on the Banjo to the fact that each song is it own reimagined version of a western film. The album is predominantly country with a blend of Americana, pop, blues, folk, classic rock, hip hop and R&B and because of her Texan roots she also blended in zydeco, rock and roll, psychedelic soul, rhythm and blues, funk, gospel, bluegrass, opera, rock, honky-tonk and go-go. And also international musical elements as well like Flamenco, funk Carioca and Irish folk. Hence her saying this is an a country album. Its a Beyonc album and on track 12, Linda Martell says the line genres is a funny little concept and on track 19 saying  this particular tone stretches across arrange a genres and that what makes it a unique listen So dont act like she just woke up one day and wanted to do a country album without knowing the history, theres a woman putting in the work and credit everyone that was involved with the album and that including the songwriters and producers of songs that she sampled for the album. This is the same woman that credit her husband on a song for just clapping.",
    "I found the comment that expressed exactly how I felt; word for word. It would have been a better move to include people she felt were being ignored in country music so she could boost them as well as herself and find some credibility on the way. Instead it feels like she's reaching for credibility by including all these big names in country which kind of makes the album feel nepo. This also does kind of feel like a revenge album, and does feel a little forced because it still feels like a pop album with country elements. And it's not like Taylor Swift hasn't done the same, but Beyonce is supposed to be a leader, not a follower. But on the other side, the album in and of itself is a statement, and that's enough for me. If this doesn't prove that the grammys is rigged and that she should have won before, and that it's a pity award for messing up, I don't know what would.",
    "theres no way of knowing if she bought the awards or not. idc if i lost credibility this is reddit not a dissertation . she still has faced discrimination and i stand by that. ignoring that discrimination creates a narrative that her career has been a breeze, which it hasnt. her awards are deserved, she is genuinely the best vocalist of this generation and i stand by that as well. agree to disagree i guess. just because im young doesnt mean i dont understand how society and the world works. i still stand by everything i hv said and if you disagree thats fine, beyonc stays winning and thats a fact.",
    "There'd be no reason to watch the award shows if the winner was the artist with the most plays in x category.",
    "the grammys have always and will always be an industry networking event that aligns around celebrating artists who have been successful that year. you might find a curveball winner every now and again (arcade fire with the suburbs, for example), but its predominantly an industry event to mingle and pat each other on the back.",
    "I agree with you completely. With that said, I was stunned that Sierra Ferrell won 4 Grammys--because she was the artist who most captured my attention in 2024. But I feel that in the ignored categories (like Bluegrass and alternative country), the nominations tend to be more based on merit because, frankly, most people have never heard of the artists in those categories.",
    "You think the Grammys are about artistic merit? lmao",
    "Alright I'll play. Define \"artistic merit\" for me.",
    "I mean, Im sure the recording academy has that defined. Its why their members are composed of artists and members in the industry. If what they wanted was award the numbers they would all be streaming and radio executives .",
    "What makes a particular song or album good? I'm sure you like some songs that I don't like and vice versa, so clearly two people can have different ideas of good music. Art is subjective, there is no scientific measure of \"good.\" The very concept of \"quality\" is a matter of endless philosophical discussion. What *is* quality? I don't have a problem with artistic awards, but I think it quickly becomes a problem if people take it too seriously. I don't think it's possible to define something like art with rational language, which makes the whole thing kinda silly. I'm not saying we shouldn't do it, but I think the harder we look at it, the less sense it makes.",
    "Turns out they were invited. Daily mail has redacted this.",
    "Uninvited. and naked.",
    "More like Bianca Uncensori",
    "Thats bullshit . They were invited . Issues came from showing up naked",
    "Mother of God, they are the more extreme version of the Ice T/Coco couple NSFW link -",
    "Uninvited or naked?",
    "This was debunked unfortunately, everybody whos nominated is invited to the Grammys.",
    "That's ... quite the dress.",
    "\"I need you to show Kim how much I don't miss her, okay second Kim?\"",
    "Parading his puppet around. Sick people",
    "Butt naked. Wtf. Leave that shit at home.",
    "Stop spreading fake fucking news.",
    "Will never understand why people tolerate Kanye.",
    "This isnt true",
    "Fake news, he was invited because he was nominated for a Grammy.",
    "I don't think they came uninvited",
    "Bianca Censori is like an actual real life NPC. She never looks like there's anything going on upstairs. I honestly don't know whether or not to feel bad for her or be repulsed by her.",
    "Drugs are bad..",
    "Classic Reddit. Running with an already debunked story. Itll be month before this site collectively acknowledges the truth.",
    "They werent kicked out, they left on their own.",
    "Those are the craziest crazy eyes Ive ever seen.",
    "Celebrities at the Grammys just so many of them are so ridiculous looking. This is just insane though.",
    " Serves them right, they have no class",
    "Their parents must be so proud!!",
    "she has no soul left in those eyse, completely empty in her head man, Kanye is a creepy mothefucker",
    "The way he parades her around like an object is pretty disgusting, she must be at his same demented level to accept all of this. And I'm not going to say anything about how he married a Kim Kardashian lookalike",
    "Is it just me or did this shit already happen ages ago. I remember these photos and I remember soon after they were splitting and since the split she was actually wearing clothes like a normal person.. it feels like I've gone back in time by at least 6-8 months now that this situation and these pictures are 'new'? Am I going mental?",
    "Being arrested would bring them both down a peg. I kinda feel sorry for her. He's a fool. She seems like a victim.",
    "Well for good reason too, she looks like sex trafficked victim at this event . Meanwhile, this is a black tie event",
    "She's literally a walking Kim K. knockoff",
    "Is he collecting trashy girlfriends?",
    "I stopped reading the NEWS because of this couple that was like 2 years ago!!! They're still at it. WOWzers",
    "When you have too much money and fame and you feel society norms dont apply to you. Seems like its becoming a trend.",
    "She needed two hairdos to wear her outfit!",
    "They both should have been arrested and banned from the public eye",
    "Oh, he da man now!",
    "Kanye, the next Diddy.",
    "how is this not fake news? they were invited",
    "Ye acted horribly. She did not want to show herself. He was a husband dead set on publicly embarrassing his wife.",
    "She looks so embarrassed, scared, humiliated. I have never heard her speak even. Is she allowed to?",
    "Wasnt he a nominee?",
    "Their fans should demand that if she must wear ridiculous outfits, then so should he. If she has to go basically naked, then so should he go naked. Lets see how far that gets them.",
    "They were literally nominated for an award ",
    "And these dumbnuts are worth 1000x anyone in this sub. Let that sink in.",
    "![gif](giphy|ltIFdjNAasOwVvKhvx|downsized)",
    "these morons are puke. why is news being posted in music?",
    "Looks like the were censorid",
    "So... Censori is being censored? I'll show myself out.",
    "UNINVITED AND NAKED WE STAND!! New US Motto! Cuz this United we stand shit just ain't workin for us yall. Any lil bit could help ",
    "But Elons in the White House.",
    "He was invited Matter fact this whole sub fucking retarted Yall believe anything the media spoon feeds you Well guess what bitches the media isnt everything Im tired of yall stupid ass dumbass fatherless idiots thinking that anything the media tells you is true Fuck yall and this entire sub Go enjoy your Taylor swift record I dont care if I get downvoted The fact you guys respond and reply is enough to prove you will do fucking anything to talk down on this innocent man Go Eat a dick And also Im tired of how you people will talk down on anyone who opposes your agenda People out here die and you all would rather want to see an innocent man kill himself Get a life you miserable evil people You disgust me Youre almost as bad as Tr U mp Matter of fact mods come here u/stabbinU u/stabbinU Ban me from this retarted sub Ye 2028 ",
    "You dont get kicked out of something when you couldnt get in in the first place. If they stone you at the gate because you dont have a ticket, you don t claim they kicked you out of the Super Bowl.",
    "It's AI... people!",
    "The Daily Mail is an absolute fucking rag and should be banned in most subs as a source anyway. And The Sun.",
    "Okay, I was confused how he could be a nominee and not get an invite. Then again, with Taylor and Beyonc both nominated for AotY, I could see them not wanting another incident.",
    "I wish the Daily Mail would redact itself. It was a nasty, small minded little newspaper before it became a nasty, small minded clickbait website",
    "yeah can someone delete this? 600+ upvotes and counting for disinfo from a tabloid account",
    "Huh, I can't think of any other possible reason they might have been kicked out though.",
    "Humiliation fetish, clear as day.",
    "They didn't get kicked out, he was nominated He had to get ushered into the red carpet He literally left after",
    "Alanis morrisette song ",
    "Yeah, can't forget that bit.",
    "I wouldn't be surprised if he was directed to do this as a distraction to the public",
    "That is not the look of an ok person. She honestly looks scared",
    "Came here to say exactly this. The pictures on TMZ right now are saddening.",
    "She looks disassociating.",
    "Im not sure she blinks, look at that face she looks like a robot",
    "People like you are reaching so hard lmao. Shes been dressing/styled like this since before she met Kanye. Youre just spouting out nonsense because you dislike him instead of having anything to substantiate what youre saying.",
    "![gif](giphy|9Juyzq1eH7QbuDyLCi|downsized)",
    "",
    "Unfortunately she's too rich to be arrested for indecent exposure.",
    "The real hero of these comments.",
    "Right, cause at least Coco wanna be naked",
    "Might be playing pimp to his ho",
    "He makes good ass music",
    "He was nominated. How is he not invited to attend? Wouldnt it just be because of the indecent exposure?",
    "Its half true. They were kicked out for their crazy stunt, but they were invited.",
    "Black tie for men, apparently whatever for women. They are wearing less and less & really pushing the limits.",
    "They have more money than the rest of us. Not more worth.",
    "what price a good night sleep without a worry in the world? i'm richer than they'll ever be. and yet. you dream of them. \"Because one speaks to legitimate need and one speaks to the ego of the elite.\" lol you're just another very confused young man.",
    "Google search says Kanye has a net worth of $2B. Id be willing to bet theres at least someone here with a net worth of over $2M. Thats actually not as much as it seems when you include home equity and retirement. Ive got a decent career in a high cost of living city and Im half way there at 37. But the vast majority is in my home and retirement.",
    "damn this guy musta been in the entourage",
    "Hahahaha holy fuck did you ever get butt hurt over this. Cheers mate, life must be hard worshipping him",
    "I need to know the source if this is pasta",
    "lol what crawled up his urethra",
    "Kaynes still not going to sleep with you.",
    "Must be a Ye throwaway account.",
    "Do you like fish sticks?",
    "Where the fuck is your punctuation",
    "Ill have what hes having ",
    "10/10 comment",
    "The guy is defending a nazi billionaire while also comparing a billionaire as someone who isnt a good artist. Amazing.",
    "Your user name says jack off.",
    "Do you have a moment to talk about our Lord and Savior, Punctuation?",
    "The Daily Mail should be launched into The Sun, and then what's left should be scooped up and launched into the Sun.",
    "You can add the NY Post to this list, too.",
    "\"I do not look like Kim, I do not look like Kim\"",
    "With a body like that? Doubt she feels humiliated.",
    "Don't also forget she's not a hob bit",
    "Yeah. I can 100% see someone doing this as a statement, a performance piece, a political disruption, etc. But I would expect someone doing something like that would do it with a twinkle in their eye, or a smirk, or at least some kind of fierce or confident look - the defiant face of someone who doesn't need approval. But she did look scared. Uncomfortable. Miserable. There was no pride or flaunting or impishness there. It was a wholly weird thing. I'm not one for conspiracy theories but whatever happened to cause that incident, the woman who performed it was entirely uncomfortable about the act and that raises alarm bells as to why she did it and what compelled her.",
    "She looks like someone who knows she has absolutely nothing else to offer.",
    "I dislike him because he's a nazi and treats his wife like a cheap cut of meat, which I think are good reasons",
    "A lip reader literally saw that he told her to take off the coat and that she was making a scene. So seems a bit coerced. Are you sure you are not doing the opposite of what you are accusing others of? Just making excuses for him because you like his music or whatever?",
    "Im sobbing this gif is all I needed to know what the link looks like.",
    "His music now is mediocre at best. Idc if hes Beethoven doesnt change the fact hes an asshole.",
    "seems likely to me",
    "Indecent exposure isn't a thing if you're on private property. The Grammy's aren't public.",
    "That he was kicked out or was uninvolved. He is nominated.",
    "he shouldnt even have been invited tbh",
    "Not like us.",
    "You know what I meant. Pedantry for karma ",
    "Yeah okay, I'll just tell my landlord that the next time my rent is due.",
    "That puts you in the top 1-2%. Congratulations.",
    "You aint got the answers sway",
    "",
    "Funny You sir win Reddit ",
    "The Sun, The NY Post and anything news/tv owned by Rupert Murdoch.",
    "Attractive people can also be humiliated",
    "Id be humiliated walking around being some knock off version of my husbands former wife. I guess shes willing to trade her identity for the drippings of his wealth. Strange life and Im glad its not mine or someone I care about.",
    "I dont know who she is, so I cant say for certain, but she seemed uncomfortable during the press photography part. Like I wouldnt be surprised if she was blinking SOS and hoping someone noticed.",
    "With her fully clothed husband right next to her? Shes beautiful and should feel no shame about her body. Being paraded around by her husband like that?  watch him wiggle himself into pictures behind her. Its disgusting.",
    "Its the fact that she is the only one naked and he probably made her do that too",
    "Did you know that a lip reader saw that he told her to take off the fucking coat and that she was making a scene?",
    "A lip reader said that Kanye was telling her to take off her coat and that she was making a scene. What a POS.",
    "She actually has a master's degree in architecture. She's just... doing this now.",
    "What a misogynistic take.",
    "So by your logic someone who doesnt look happy = looks like someone who has been trafficked??",
    "Read what you just said. Youre listing a dailymail lip reader as a source to take seriously ",
    "It's not even an excuse babe, the fact that she does this on the daily should be enough for you",
    "He was NEVER Beethoven. Lol He makes pop hop with 15 writers credited on every song.",
    "Youre talking about the crime. Im talking about common decency and the fact that probably dont want a fully nude person at their party.",
    "But what about the other crap they pull in public ? They are just nasty.",
    "He was kicked out. He was involved. A nomination is not the same as an invitation to the ceremony.",
    "Theres a real difference and i have no idea if you know that. Use your words carefully.",
    "Stop telling the world how broke you are. Go get a job",
    "This calculator says top 9% for the US - And again, thats for the whole US I live in a high cost of living city in the coast, so Im not really wealthy at all. Just a middle class person in an expensive city. But thats all beside the point my point is, there probably is at least one 55-65 year old in this thread with a $2M net worth. And they aint rich. Edit: they replied and blocked me. What a loser. >Pedantic and arrogant. Bet the ladies love you I save the pedantic shit for Reddit. But what the hell did I say thats arrogant?",
    "Lay em on me",
    "Yuck. What a fucked up way to talk about someone",
    "Kanye shouldve hung dong to stay relevant too.",
    "she always dressed like that lmao",
    "[ Newsweek sweetie. I have no idea where you got that I got that from the Daily mail but again, you fail.",
    "r/lewronggeneration is thataway good buddy",
    "You used the legal language so I responded to that. I have no bone to pick with your other statement tho",
    "What other crap do they do in public? I honestly have no idea.",
    "According to the Grammys they didnt kick him out or ask him to leave, he just left",
    "So youre telling me you can get nominated but not invited? What if by some chance you win? Nobody claims the award? Or theyre blatantly saying you got nominated but wont win anyway?",
    "Pedantic to the end, I see.",
    "i don't know if you understand how much of a flex affording rent is nowadays.",
    "Pedantic and arrogant. Bet the ladies love you.",
    "no! I got a chuckle out of ***copye pasta*** love you",
    "No youre good This one is actually funny",
    "She's literally Australian? What are you talking about?",
    "The lip reader that newsweek references originally made a tiktok that was written about by Dailymail. Regardless, Do you not understand the bigger point Im making about how dumb it is that youre quoting an article that uses a lip reader as a source? Its not even a firsthand or secondhand witness account of someone that was there but instead the source is some amateur on tiktok hypothesizing what they think was said  I wonder how youre able to get through your daily life being this clueless",
    "Hey, don't get mad at me because a musician you like turned out to be an untalented Nazi. If you think Kanye is on par with Beethoven, then it's just obvious you don't know anything about Beethoven.",
    "Fine, then you sonovabitch. It sounds like we agree entirely.",
    "You dont have to be present to win. Do you think you need to be present to win???",
    "You know that lip readers are trained, right? Like the person is a professional lip reader. Just because the Daily Mail also wrote about them, does not mean they have anything to do with the Daily Mail. You just really do not like being wrong and are now lashing out because you have a fragile ego. You have been proved wrong twice here and so you are going to spew a bunch of insults because insults are the last refuge for those with no arguments.",
    "I still hate that he ended up a nazi, you know your point is shit when you have to lie about what I actually said",
    "Fully listen to Graduation then you can tell me if you think he's untalented. Seriously the only people who say they think he's a bad artist or doesn't make good music are people who have never listened to his albums. He's OBJECTIVELY one of the best and most influential artists of all time, if you think he's not then you are completely ignorant of the modern HipHop landscape.",
    "Goddamnit, can you two just not get along, as is tradition!?",
    "No, but thats not the point. Ive seen some winners win awards but have someone else claim them on their behalf, but thats something the nominee should decide to do.",
    "Have a good day Stranger ",
    "You were trying to bag on Americans again, Australia. This one's yours.",
    "What the actual fuck are you talking about",
    "I didn't lie about anything. You replied in a comment thread about how Kanye isn't Beethoven. He doesn't even write his own music, dude. Take the loss.",
    "And Ye, especially Ghost Town (best song of all time)",
    "And I never said Kanye is on par with Beethoven so you lied about that.",
    "I mean, did you see that dress? Because I didn't. I sure saw everything else, though.",
    "I thought surely it can't be as bad as what they've pulled in the past. Lemme give it a goog- Oh....oh she's just straight up naked, tits to the wind with her coochie out and everything.",
    "Dude, I wear more clothing taking a shower",
    "Bianca Un-censori-ed",
    "What garbage news site was that?",
    "I dont know anything about this Bianca Censori but she looks like the kind of person that would eat a turd if dared too.",
    "This MF definitely walks around the crib with her on a leash.",
    "He should have been banned after he came out as a Nazi",
    "![gif](giphy|J8FZIm9VoBU6Q)",
    "She needs on the sex offender registry after now! Edit to add... if this had been a man... he wouldn't had just been escorted out but... escorted out in cuffs and straight to jail",
    "People need to stop watching these fuckin award shows. The awards are frequently bought and paid for and they do absolutely nothing to change the product. Just a stage for rich people to show off.",
    "![gif](giphy|2lG8fMhri8Pmw)",
    "While I dont agree with the look they were in fact not kicked out of the Grammys:",
    "They have a No-Nazi policy",
    "![gif](giphy|7k2LoEykY5i1hfeWQB)",
    "I guess it worked. I had no idea who she was before this.",
    "I thought this cant be true. Maybe shes wearing pasties on her nipples, a nude thong. Nope! Totally naked.",
    "Only way to prove he doesnt like fishsticks.",
    "They sent Will Smith to escort them out.",
    "Is his just in a vintage Nazi uniform?",
    "Hopefully, she's being arrested as a sex offender because had that been a man with his dick and balls \"hiding\" behind clear plastic, he'd already be on a predator list.",
    "Bianca show Kanye da pumpum Kanye want da world to see Bianca pumpum Da world dont wanna see Bianca pumpum So Grammy security escort out Kanye and Bianca pumpum",
    "Women are always complaining about how their clothes don't have pockets. That dress? Only comes with a prison wallet.",
    "Down with Censori-ship!",
    "At least she was happy right?",
    "Next Caller Please , Line 2 .",
    ":o ![gif](giphy|pYWyPf8dQWmGI)",
    "Showing up uninvited, dressed inappropriate and still being shocked youre escorted out.. Guess they had difficulty grabbing Bianca (un)Censori",
    "You know her name now. Mission accomplished. Thats all that is",
    "I can't imagine how embarrassed her parents must feel. Disgusting.",
    "I'm all for daring looks, but this just feels vulgar. It doesn't feel like a statement, it just feels like he's showing off her naked body.",
    "A man would have been arrested and charged... but on the other hand is anyone else sensing a Tom Cruise/Katie Holmes situation.",
    "Good, no nazis allowed.",
    "Good. She showed up naked. The guy has mental illness and is a Nazi too.",
    "She got her fucking tits out. *slow clap* How clever. How original.",
    "The surname doesnt do justice to the act. Or does it? ",
    "Stupid rich people shenanigans. This is not about music. It's not about anything.",
    "Kanye's a creepy fucker. I feel like he's the kind of lunatic that would have naked people standing around his house as coat racks and chairs.",
    "This is so unsettling. Noone in their right mind would show up naked to anything. I don't care who it is. Noone wants to do that. I'm wondering what was said and done to get that girl to agree to do this.",
    "That woman did not grow up with love at home",
    "Wonder how long it took her to get dressed? ",
    "Sex offenders list material",
    "Some bling with diamonds, some with Lambos, some with white sex slaves.",
    "Did she have any pasties on?",
    "I want to quit being subjected to her against my will. Every time I see her naked I did not ask to.",
    "WTF is wrong with this woman? Is she drugged? She looks like a Stepford wife. Does he pay her to prance around naked in public? I recall he used to criticize his other bimbo wife Kardashian about how she dressed too trashy LMAO and it went against his Christian values. Maybe his brain is fried, too.",
    "I got escorted out when I wore the same outfit to Costco. And I was just trying to return it.",
    "Wtf why womens body illegal unless it has the correct 3 little triangles",
    "As if being escorted out matters. Their goal was to get people talking about them. And it worked. I've seen more posts about this than about Beyonce winning her award.",
    "While I hate these 2 people I will be so glad when the Grammys are over.",
    "All the images I've found are censored. Can someone provide me a link to some uncensored shots so I can see? For science of course.",
    "Oh I dont care",
    "I wish she would get arrested for indecent exposure and charged with a sex crime for exposing herself around potential minors. And have her register as a sex offender and deport her ass back to wherever she came from. Ugh, they got what they intended - attention and all of us talking about this unfortunately. I just wish there would be some consequence to asinine behaviour.",
    "Whose bright idea was it to invite them?",
    "I think that poor woman has been so mentally abused that she submits to whatever Kanye tells her to do. This isn't the first time she's been seen wearing something inappropriate out in public with him. He probably has full control over what she wears. I hope one day she can break free from him.",
    "Does anyone have the bloody uncensored images? Seems like there are millions if fotos but everyone goes through the effort of censoring the interesting parts. Yawn.",
    "This isnt true. Hes nominated and hes still there",
    "Taking the trash out.",
    "Brian Warner did a similar thing years ago, and it's not going well for him now.",
    "oh no he is gonna blame *them* isnt he",
    "But Chris Rock can get assaulted all day",
    "You mean it wasnt a nudist event?",
    "They didnt appreciate Ye going on and on about nothing but hes rich and can do what he wants. Hes right. Sadly.",
    "I'm not sure what surprised me more, the couple's indecency, or that someone did something about it. Bravo Grammy Awards!",
    "So he's been progressively making her run around naked... At this point, I expect her to be lacking some flesh next time.",
    "I don't see no carpet",
    "I thought they'd broken up?",
    "When you have too much money and fame and you feel society norms dont apply to you. Seems like its becoming a trend.",
    "[Haha, he sure loves those sweeties!](",
    "Should have kept the fur coat for just in case",
    "This is not true. They did not get escorted out. They chose to leave.",
    "Attention Seeking, Kanye isnt forcing her.",
    "Hasn't done or said anything stupid in awhile. He must have started to feel depressed without all the attention",
    "This was a real shame. He should have been escorted out for his god awful music.",
    "More like Bianca Censored",
    "Another proud father moment! How would you like to be the Dad fielding the WTF questions. Both of the couldn't possibly be anymore useless. Two No talents trying hard to be relevant.....Epic FAIL!",
    "Kanyes been lame for the last 15 years at least. Will do anything for attention.",
    "Fuck Kanye West. I don't give a fuck how talented he was. That idiot fuked with the 2020 election",
    "More attention-seeking behavior from Kanye and his merry band of clout chasers and coattail riders.",
    "At least he allowed her to wear a modest coat. jk",
    "Who fucking cares.",
    "\"Look at meeeeeeeeeee!\"",
    "I watched the red carpet Grammys and they turned up uninvited, wasnt dressed appropriately and got escorted out the building. Nudity in public spaces is illegal in Los Angeles and this act have been going on for months, so I think the sex trafficking rumor could be true.",
    "Should be in jail not on the red carpet",
    "About a minute in the video, a kid is there! How is she not charged with exposure?",
    "They are so pathetic",
    "Article is so full of ads that it is difficult to read",
    "That girl needs to get away from him.",
    "What does he get from this? Does he like when men are jealous? Or women? It has to be an ego thing but I don't get it...",
    "He should be sharing a cell with dd",
    "It's not like we don't know what she looks like naked anyway",
    "Why are celebs always such degenerates?",
    "I've loved hip-hop my whole life, but never managed to get into kanye. Ive literally always thought this guy was weird since the 2000s and feel like it took 25 years for people to actually raise eyebrows. crazy....",
    "Should be arrested for exposing themselves to minors",
    "According to Kanye, they were invited and DECIDED to leave after the red carpet, they did not want to attend the show.",
    "What's this have to do with music?",
    "I mean they gave the AI porn gooners everything they need to start making fish stick porn of them both.",
    "America Has A Mental Health Crisis. After All 75 Million Idiots Elected A 6 Yr Old Brat For President.",
    "Yeah shes a damsel in distress alright",
    "When the elites deploy their celeb pawns for mass distraction, and you get stuck with the result of an abusive relationship.",
    "Her name \\*is\\* Censori, after all.",
    "Was her whole coochie out!?",
    "They look so happy together.",
    "Why is everyone so up in arms about some nudity. There's wayyyyy worse things to be upset about in the world.",
    "Show me Biancas dress award no blur",
    "I can't find pics that are not uncensored ",
    "Get wrecked, asshole",
    "Good. Thats ridiculous.",
    "And no one cares.",
    "![gif](giphy|cO39srN2EUIRaVqaVq)",
    "How many of y'all thought he did the Nazi salute when you read the headline?",
    "This level of weirdness doesn't shock me from Hollywood.",
    "They were headed to a freak off and took a wrong turn.",
    "Whats up with some of the other nominees dressing like a toddler and the hamburgler co designed their outfits?",
    "Good riddance - that nazi makes weird shoes",
    "Who actually cares?",
    "Kanye West is blonde and gone.",
    "Fake news, how about you update the article?",
    "I hear yall but them thangs is thangin! ",
    "Well, at least she didnt have a big bush.",
    "Bianca Censori got the gyaaattt but yeah, can't be naked out in public",
    "I am so surprised",
    "OH HELL NO",
    "List of Kanye songs I know: .",
    "Mans a marketing genius whether you like it or not. He knows this shitll get attention and you all fall for it. Yes name has never not been in the mainstream news cycle.",
    "Kanye is the best in the business",
    "",
    "So desperate to be relevant. Mental illness is no joke.",
    "Where can I find a picture of it.... So I know to stay away.",
    "she puts the censor in censori",
    "I thought it was an initiative to wear more condoms.",
    "Didnt see her dress, but definitely saw a slit",
    "Her stylish wrap is by Saran..",
    "I wouldn't have guessed the folk tale Emperor's New Clothes would be so on the nose and very literally relevant in 2025.",
    "Its a competition to see who can provide the most clickbait at this point ahaha. Teigen's outfit choice was like \\_\\_% less revealing.",
    "There you go Mr. President. Ive distracted the people for you.",
    "She is wearing by a giant condom to be fair! Lets not be too judgey /s",
    "Ah yes, now I see it",
    "Kanye is such a creative coward these days. Making his wife go naked instead of doing it himself, which would actually have been an interesting artistic statement instead of desperate, Robin Thicke level, exploitation.",
    "Ikr its funny as fuck",
    "Is any website not blurring it?? So lame",
    "So stunad why ... why do you think they do this..",
    "[In front of young children](",
    "Isnt he suppose to be a fashion designer but cant even get his wife to wear his shit.",
    "3 teets to the wind.",
    "Only poors need to worry about laws and ending up on a registry.",
    "Link, or it didnt happen",
    "Give it a goog guard rail!",
    "Coochie? Is that canadian?",
    "![gif](giphy|lw2fCXuxBmAVy)",
    "That made me gigggle",
    "Ive been waiting for this comment lol",
    "I need to know what the lives of people that design sites this are like. Are they the modern equivalent of people who dreamed of being actors and end up in a rabbit costume at a kid's party? Did they all grow up watching the Matrix and dream in code? Did they hope to build the next Myspace? Maybe get a fat government project? Only to wake up one day and find their boss demanded they build a site where every sentence ends in an ad instead of a full stop. A site where the slightest bit of user interaction causes it to jump about haphazardly in the hope of tricking them into tapping on an ad. A site where the portion of the screen the reader wants the text to be in is obscured so that they have to move the screen around more to feel comfortable on it. I hope you're reading this mystery coder. You could be so much more.",
    "It's the Daily Express, originating from the UK \"newspaper\" of the same name, direct competitor to The Daily Mail, some would say the readers of the Express are even more rabid than the Daily Mail readers.",
    "You click on the links?",
    "Don't think you need to go as far as daring her, just tell her everyone will look at her - that turd won't even touch the sides",
    "Eat, marry, same difference",
    "If *paid to.",
    "I know, I'm in love",
    "Definitely has those vibes. I don't think she chooses to do anything. Looks like she is forced to do this shit.",
    "100% had the same vibe.",
    "women will do anything for money",
    "Banned? Hell be awarded the presidential medal of freedom by musk himself",
    "They nominated him for a Grammy tonight for his song Carnival, thats why he was there",
    "As an artist, he was just a few steps ahead of society.",
    "Dude he watched 21 Jump Street and liked Jonah Hill, so he cant be a Nazi!",
    "He did a Nazi thing recently? Haven't heard anything about Kanye in news cycles lately. Edit: idk why I got downvoted lol I remember the Nazi stuff from a few years ago but I was just wondering if there was something recent related to Elons thing, I felt like Kanye hasn't really been in the news in this past year",
    "bruh, Ye IS the registry",
    "Okay, lets not lose the plot on why we have a sex offender registry. It exists to identify dangerous people, not to maximize punishment for those who piss us off, or who engage in performative stunts like this. its there to warn the public of potential predators, and Censori is very obviously not that.",
    "Public nudity is not allowed in Los Angeles if it is done with the intent to offend or sexually gratify someone. You could argue it's for Kanye's gratification, but that won't hold up in court. She did nothing illegal.",
    "Their voyeurism should have gotten them arrested a long time ago.",
    "iF It wAS a MAn",
    "I never even know the Grammys are going on until it passes. Society needs to stop obsessing over celebs period.",
    "Kanye should transition to MMA. Dana says that his fighters praising Hitler is free speech.",
    "I mean they clearly don't if he was there and nominated for an award",
    "She is wearing a barely noticeable, sheer minidress. Technically not naked.",
    "She aint no gay fish!",
    "Shes a victim. Not an offender. Her eyes remind me of Katie Holmes after a few years married to Tom.",
    "Crazy people. They dropped them off at a mental hospital.",
    "Thats funny. Im thrilled to be your first upvote",
    "Sure didnt look like it",
    "Negative. Its just censored for posting purposes",
    "[",
    "Oh, she definitely exposed herself to minors. [",
    "American Puritanism, at its finest folks. Nudity doesnt equal sex, male or female, and the majority of the civilized world feels the same way. Cant wait for the US to implode like every civilization before it so all you rednecks finally shut up.",
    "Apparently, nobody's.",
    "Apparently they werent even invited, they just showed up.",
    "From what I've heard she's been known to dress like this before they even got together. They just match each other's freak",
    "Shes no victim, shes straight up crazy. Also I thought they were getting a divorce?",
    "it's always on x.",
    "She kinda self-blurred it, but you'll find it via twitter search",
    "Me too. Supposedly divorcing",
    "It's funny how quickly misinformation spreads this day and age even for something as innocuous as this",
    "Right. Because that isnt his MO at all.",
    "Kanyes wife decided to show up with nothing on except a fur coat, then decided to flash her naked body to everyone.",
    "The Grammys are just sort of like that. Shorter looks just seem to be in.",
    "wop wop wop wop wop , dot fuck em up",
    "Mf when did he a child  mfs just be lying now",
    "What exactly is he marketing? What are we falling for? Obviously you are going to get attention if you show up with your naked wife to the Grammys. Any one of the numerous celebrities there could do the exact same thing and receive a similar response, but you wouldn't brand it \"genius\" because they haven't bred a cultish reverence in your impressionable peanut brain. It's attention-whoring. He got our attention in the same cheap way a child dropping trow at a birthday party would, what a genius.",
    "What movie is this gif from? Its seen so much relevant use and is perfect for so many things",
    "This is so funny",
    "Just a pair of pathetic attention seeking halfwits imposing their fetish on the rest of the world. Creepy fucks.",
    "And yet here we are talking about her again. Hm.",
    "I didn't realize Asshattery was a mental disorder",
    "Desperate for his money. This is prostitution.",
    "I saw a video on X. Not sure if this is one of the subs that ban X links or not, though. Regardless, I am sure it's all over the internet by now. Edit: Judging on the downvotes, this is probably one of the Elon hating subs. So you're on your own.",
    "Quite the opposite actually",
    "I saw a peach on her ass",
    "Oh wow. Didnt realize they had that kind of money",
    "At least she didn't decide to use any of their gas.",
    "She at least left a little to the imagination... Bianca was straight up naked.",
    "l ![gif](giphy|ZkzzUXi1qb8uQOXxjh)",
    "Apparently whatever Kanye has is contagious",
    "I definitely think it was too revealing for my taste, but it at least had some structure and material covering the nipples + genitals. That should be the bare minimum.",
    "Americans; Try not to make everything about politics, challenge. Level: IMPOSSIBLE Edit: I've upset the Americans it seems.",
    "",
    "If I post the video/screenshot here will I get flagged?",
    "Knowing Kanye, to make some kind commentary in the worst way possible.",
    "Pearl clutching intensifies.",
    "He prefers her naked and degraded",
    "Search your own celebrity wank material. Lazy-ass ",
    "[What do you mean?](",
    "Why? You lookin' to collect a tariff?",
    "![gif](giphy|kSlJtVrqxDYKk|downsized)",
    "I love THIS",
    "That site has over 900 partners purchasing the data of people who didnt pay attention to the popup. Its someone who figured out how to make a living while doing as little work as possible. Frankly, Im jealous.",
    "Oh its a preset on squarespace",
    "This is why I recommend browsing the Internet with NoScript and uBlock Origin.",
    "She was modeling in similar clothing before she met him. I think its just a case of matching each others freak lol. Its a game to them.",
    "Fucking bullshit, she willingly suck on those NUTS for some money and fame",
    "Exactly. I dont know whats going on with this sub. 30 minutes ago in another post all I said was that she always looks uncomfortable and I was dog piled on by a bunch of smooth brains for making assumptions.",
    "Think you mean Knight's Cross of the Iron Cross",
    "It was at the end of 2022 when he was a guest on the Alex Jones show. He was saying insane things like, \"I like Hitler.\" Among other pro nazi sentiments.",
    "Just look up Kanye interview with Alex Jones. Peak manic Kanye",
    "They both need charged",
    "If a random male had walked around wearing that in public, so you could see his dick swinging around would that be as ok.",
    "Just walking around with your dong out is considered dangerous in modern society. That's why it's enough alone to be put on a registry.",
    "Public nudity is straight up illegal in LA. She could totally be arrested. Especially since there were children there",
    "California Penal Code (CPC) 314(1)  Indecent Exposure  In California, **the crime of Indecent Exposure occurs when a person exposes his or her naked body or genitals in front of anyone who could be annoyed or offended by it**. Google. or [CA.gov]( fool. Its not about Kanye or his wife, it's about us. I guarantee no one on either side of this stupid argument knows what shoes she was wearing.",
    "Pretty sure flashing is assault so...",
    "you see, by claiming this is assault, we are all victims. so the next time someone gets raped or beaten until their bones break these people can pipe up and say 'im a victim too, i have been assaulted'. they will leave out the part where they saw a nude body at the grammys, but everyone around them will say 'oh that is terrible what you went through. people shouldn't have to suffer like that' its some sort of mental condition where people feel validated through victimhood complexes.",
    "Me either, didn't know about it until someone in a discord said Kanyes lady had her coochie out",
    "it is free speech. thats literally the definition of the word. you are free to speak.",
    "thats not how that works at all.",
    "why are you guys writing fanfiction about a person you dont know? shes a grown woman with autonomy and has never been modest or demure",
    "I really believe shes bought in with the Sub lifestyle.",
    "281 330 8004 Its insane I still have that burned into my brain",
    "![gif](giphy|DI2q9nxX8umUE)",
    "Got a lot of haters and a lot of homies",
    "Boss hog on candy",
    "Yeah mfs just act retarted for no reason ",
    "Thanks! That's hilarious.",
    "What is your comment even pertaining to? A man would be arrested a charged: Ive heard of men having to register as sex offenders for peeing with a school close by while drunk.",
    "Its illegal. What if a guy walked around with his dick out in front of little girls?",
    "thanks! No we only need a higher-res version of this and maybe slightly different position of her legs..",
    "Its obvious you havent seen how her sister dresses.",
    "Her being escorted out is getting censored ",
    "Did you seriously edit your comment? Lmfao.",
    "His brand, himself. His fucking antics. Everyone keeps making him more and more famous despite the either positive or negative effect from all the wild shit he does. You guys say hes canceled yet wtf is this? Ive seen this a thousand times all over reddit already.",
    "Its from Diary of a Wimpy Kid",
    "Yea I think its part of the kink. ",
    "If people would stop giving these kinds of people the attention they want then they would go away. Either that or do something even more outlandish. They don't deserve our attention so stop giving it to them",
    "It's often a symptom.",
    "It's not. It's just something people say about people they don't like.",
    "She has her own money lmao theyre both just disgusting perverts. Idk why people act like either of them are victims. Look up who her family is.",
    "Sexually-transmitted crazy.",
    "Two things: 1. He has strong ties with him. So, relevant. 2. Not American.",
    "",
    "Its sure as fuck more relevant to politics than it is to music.",
    "In all seriousness Kanyes a billionaire eclectic artist. If anyone should be doing this crazy stuff its him. I hate that society craps on him when hes just trying to advance fashion and shock us with art He made the most iconic shoe ever since Jordan 1 And then society deemed him unacceptable and cancelled his billion dollar shoes empire of course hes got a chip on his shoulder",
    "I finally found it on YouTube of all places",
    "Do these effectively hide my thunder?",
    "Tobias you blowhard!",
    "But they still did put in the work to forcibly override Darkreader and set the background to white again, blasting my eyes with ungodly amounts of back lighting.",
    "It was impressive when it was average joes gaming the system not Silicon Valley dorks. Guy who create shit like this dont have the imagination to appreciate an easy paycheck.",
    "And part of the problem. Examine your morals.",
    "you're weird",
    "Just really confused about the capitalization of nuts here. Why are you yelling about Kanyes nuts lol?",
    "she doesnt look uncomfortable. she literally loves the attention. which btw. she should be arrested. that would look uncomfortable. if a dude did this they would be in jail",
    "I believe it was \"I loooovvvveeee Hitler\".",
    "Yall cant lie that mf had style",
    "I have a question: Do you really think the public will be made safer if we weaponize the sex offender registry to go after everyone who does a performative stunt? Or if we threw everyone on it who could plausibly be charged when indecent exposure, whether they were actually predators or not? Is it a wall of shame, or a serious tool for identifying dangerous predators?",
    "Fine with me..... Honestly I think people should be far more upset with the fucking actual \"I love Hitler\" nazi beside her.",
    "that's way different don't even act like it isn't and also, it was most likely Biancas idea. Before she met Kanye, when she worked at Yeezy, she wore these exact same outfits.",
    "I think if a man did that he should be fined and cited. Whether he should end up on the SO registry is a question of whether or not he poses a danger to others. And if a man showed up to a red carpet award show with exposing clothes on (which is what were talking about here) then he obviously doesnt. This is not a binary. We dont have to choose between this is totally okay and put on a list and permanently subject to life altering restrictions for every single person who gets caught doing something indecent. Theres room for nuance, and that nuance should exist in motive and manner of an act of indecency and whether or not it poses a danger to others.",
    "Oh man, this thing our legal system does sucks.we should do more of it!",
    "State law says it doesn't.",
    "As a viewer, Im annoyed and offended. Lets all rally and sue.",
    "Brownish, almost darker flesh tone flip flop type things, from memory",
    "And arent children allowed to attend the Grammys..? Like are you allowed to just be naked like this in front of minors..? Because I didnt think so",
    "this really devalues the pain of actual victims.",
    "Free speech applies to your First Amendment rights against Government intrusion. It has nothing to do with private enterprise and one would expect a legitimate company to fire overt supporters of Nazi ideology.",
    "look it up",
    "I think thats the point of the discussion. Based on the circumstances and how they present in public, it looks like she does not have bodily autonomy. And- you are correct. We dont know these people.",
    "Hm. I hadnt considered that before.",
    "Hit mike jones up on the low cause mike jones about to blow",
    "If me or my brother ever say \"what's the number\" for something we always start \"281...330...\"",
    "What is that? (the numbers)",
    "You can still put it to good use! That number is almost always registered as a grocery or pharmacy rewards number, so just punch it in for the discount if you don't want to register. (Alt = [local area code] + 867-5309)",
    "I see. People being prudish, even on reddit.",
    "She is almost definitely his victim. There's a lot of signs of spousal abuse there.",
    "Nah. Then don't bring up American politics in a space unrelated to them. We have enough of that shit everywhere else on the internet.",
    "Based. Thanks for showing me that one haha, that's entirely fair",
    "Yes. I'm sure Bianca's tiddies at the grammy's are more relevant to politics than music lol",
    "It was working 2 days ago. Eh, must have crashed the site",
    "He's also a nazi and an egomaniac piece of shit. Do you know why Adidas cancelled his contract? It's because he told the Jewish employees to forgive Hitler's misdeeds. That may fly in an American company, but in a German one? That's a hell tf no. Is Kanye an amazing musican and artist? Yes. Is he also an antisemitic piece of shit with severe mental health issues? Also yes. And those shouldn't be excuse because he makes good music.",
    "You think it's immoral to desire money without work?",
    "I rented a room to an exotic dancer for a time. She ended up on the sex offender list because she wouldnt blow the cop who busted her for peeing in an alley, miles from any people or neighborhoods, at 3:30 in the morning. Its already weaponized.",
    "1. Is the act a crime? 2. Is the crime a sex crime? If yes; place on the offender's registry. If no; do not.",
    "yes. the public would be safer. without people exposing themselves. for there own gratification. thats why its illegal. we dont want to see johns dick. we dont want to see biancas everything. she flashed us. we didnt sign up for it. thats a law because its disturbing.",
    "Yeah no one said that, but you keep arguing with that straw man.",
    "In your opinion, what would constitute it?",
    "Ive literally reported people and had them arrested so might wanna check that again. Its called indecent exposure",
    "Exactly my point",
    "Oh no, a hypothetical child may have seen a pair of tits. It's the end of the world! Anyone who thinks something this benign is damaging for a child has some seriously misplaced priorities.",
    "Ok so if a guy flashes someone that's not assault? I'm pretty sure it is so it should be same for women as well.",
    "LOL. freedom of speech means you are free to believe what you believe you are free to say what you want. you said :\"Dana says that his fighters praising Hitler is free speech.\" i was telling you that by definition that is the word free speech. you are free to speak. nobody should be fired for believing what ever they want. just liek i dont believe in firing people. just because they think they are the opposite gender. they arent. they are mentally unwell. but thats there problem as long as they arent pressing it on kids.",
    "Nudity isthe state of being without clothing. It can also refer to wearing significantly less clothing than is expected in a given culture or situation \"look it up\" maybe you can use fucking google dumbass if you can see it. its nudity.",
    "Before this ice was in my grill before I had this major deal",
    "Mike Jones' phone number that he raps throughout his songs",
    "Like what? She has the money and the power to leave. Shes could easily have him killed if she wanted to. Theres no power imbalance here. Shes always been a weirdo freak, and she worked with him for years before their relationship. She knows exactly who he is. Theyre both perverts. Shes not a helpless victim, she is a willing participant. Unlike the rest of us (including the CHILDREN at this event) who are unwilling participants in their exhibitionism.",
    "just google both with images, no need to click any articles/links. Teigen's dress doesn't need to be censored, but still doesn't leave much to imagination.",
    "Nah. just relax please",
    "You know that Kanye is American, right?",
    "What does her haveing her titties out at the grammy's have to do with music seeing as she's not a musician ?",
    "Sometimes art is offensive! And if he has mental issues youre being pretty rough on him",
    "Not degrading sex workers here, but she has a masters degree. And shes clearly into it. I think shes hotter than Kim k too",
    "At the expense of making the world a worse place I do. At the expense of denying ourselves better things I do. At the expense of being lazy I do. The future looks grim to me when I read comments about new dreams being tricking someone into loading 100s of ads so you can go mess around somewhere doing f*** all for society. Absolutely. Its selfish and sad",
    "Got it. So if a guy is caught pissing outside, its indecent exposure, and he should spend the rest of his life as a sex offender.",
    "Bizarre that you think that standing naked somewhere for a few seconds is a \"sex act\". This is your brain on puritanism",
    "Okay, but there's a pretty big gulf of difference between \"Fine her, cite her and ban her from future events\" and \"Make her a sex criminal who's subject to movement and residential restrictions for the rest of her life\"",
    "It's not a straw man. This conversation was about whether or not Censori deserved to be on a sex offender registry before you bulldozed your way into it. Could you articulate what your point is supposed to be, exactly?",
    "I've worked in criminal law in SoCal before, this shit would get dropped unless they were jacking off or flashing people for gratification.",
    "Being arrested just means you're *charged* with a crime. Police are not lawyers. They charge you with something and then lawyers and judges determine if you're guilty of an actual crime based on the circumstances and charges. Seeing someone taken away in handcuffs isn't proof of anything.",
    "Thank God we have heroes like you",
    "In my state, no, it isn't. assault in ny is an act that requires physical harm. i guess it could be different in other states. comparing the trauma of seeing a naked body with the same level of suffering as someone who has been subjected to physical harm due to the intentional of reckless acts of another person is insulting.",
    "this boy mad lmao",
    "These girls didnt give a damn if I was here, CHYEA",
    "She could easily have him killed if she wanted to. My man time go to lay down.",
    "Also, what are your credentials to be making calls like this? Have you seen their patient history? You are acting as If youve personally interviewed each person ",
    "Thats not how abusive relationships work dude.",
    "Just because she's a shitty person doesn't mean that she is incapable of being a victim of domestic abuse. Shitty people are abused by their spouses all the time. Just because they are terrible people doesn't mean they deserve it.",
    "You obviously have never been in an abusive relationship. He is truly gaslighting her, she looked positively terrified. It's not as easy as you think to just leave. She looks to be so deep in his thrall. It's scary. I pray she finds the courage. But do not, and I repeat, DO NOT prejudge someone's actions and assume everyone is strong enough to make those types of decisions. That's not how abuse works. I know because I lived it.",
    "Nah. I decline your condescending request",
    "What do they have to do with politics? It's the grammy's, and she's married to a famous musician.",
    "You're correct, art can be offensive. But we're not talking about his art. We're talking about how he went on Alex Jones' show and openly praised Hitler, claiming he had great ideas. We're talking about his years of antisemitic comments and lyrics. We're talking about how he told the Jewish workers of Adidas to *forgive Hitler*. We're talking about how he said slavery was a choice. None of that is art. All of that is nazi behaviour. Kanye is not a good person, there's a reason why Kim divorced him.",
    "That would only be a sex crime in those states where any genital exposure is classed as a sexual offense (like California, or Georgia etc) - but even then a judge is unlikely to register them without malicious intent or additional crimes at play. That's pretty much 'the line' for any of this stuff - if it involves sexual crime or there is malicious sexual intent then yeah absolutely. I don't agree with those states that would automatically classify public urination as a sexual crime (without other intent or crimes involved) - but I also don't live in the US thankfully, so I don't have to worry about that.",
    "If it was a man with his dick out, hed be in jail",
    "yes there is. and she should be the ladder. she exposed her self unpromted. to millions which btw alot of which were kids. like my 16 year old sister. if a guy did this. he would be in prison. any if you are gonna say \"the grammys arent for kids\" for one thats stupid. two kids have literally won grammys. the youngest to win was 14 years old. this is the corruption of our society that you people keep trying to normalize its crazy and radical. she exposed her self. jail. end of story. if you wanna expose yourself to kids. go to a shittier country.",
    "The point is simple. Being unclothed alone is considered predatory and dangerous if you are a man. That's the point. Sure there's some nuance to it, but mostly the law does not believe there is a good reason for someone to be walking around exposed. And that's all I said (the bulldozing I guess), before you created your strawman to argue with. I don't agree with it, but that's the way it is. If Kanye was wearing something where his dick was showing the way her vag is, this scenario would play out very differently, grammys or not.",
    "It didnt for the people Ive reported. But sure",
    "The DA can also decide not to file charges if they recognize that it's not a crime and that they'd easily lose in court.",
    "It is definitely different in other states then. Where i am. It gets you on the registry first offense. Especially with minors around. And you can't tell me there aren't any fans who are minors around wanting to see their favs.",
    "Ok so some person, man or woman, pulls their pants down and starts playing with themselves. Maybe that's not traumatic to you but it would be to a lot of people including children.",
    "Showing someone your privates without consent is definitely sexual assault and harassment. Acting like it isnt is reckless and insulting",
    "well you pulled a look it up. you can look it up. and it shows you were wrong.",
    "Lol, the irony to call him condescending.",
    "Okay, so we're actually on the same page here. The way you initially phrased it made it sound like you think this incident was a sex crime (which, y'know, trolling an award show obviously lacks the malicious intent here)",
    "If it was a man, Id argue that permanent inclusion on the SO registry would also be stupid",
    "Sure, but I would also be against him going to jail too.",
    "> If Kanye was wearing something where his dick was showing the way her vag is, this scenario would play out very differently, grammys or not. See, this is the part I think is ridiculous. Trolling the Grammys is not an act of a sexual predator, whether a man or woman is doing it, and I doubt Kanye West, or even just an average joe streaker, would be facing a lifetime on the sex offender registry for doing it. Context matters. And yes, there are plenty of instances of people of both genders being popped for indecent exposure without that particular punishment being employed. You usually have to be exposing yourself to someone non-consensually, or directly to a minor for that to be employed.",
    "I really believe your anecdotes compared to my firsthand experience working in criminal law.",
    "Thanks for the update Karen",
    "In your state people are put on the sex offenders registry for physically attacking another person, or from causing injury to someone through reckless actions?",
    "But she neither pulled her pants down nor played with herself, so what's your point? Also, without any context provided to them, I think most younger children seeing a naked person in public would likely think it's funny. Imho the traumaticness of the experience will come down to how freaked out their parents are when dealing with the situation.",
    "nice goal post moving you got going on. what you describe is a crime, and not acceptable, but it's not assault. like i said, idiots like you devalue the suffering of actual assault victims by comparing what they have suffered to something that is not what any reasonable person considers to be the same thing.",
    "in California that is not sexual assault",
    "damn he still mad lol",
    "Yeah I wasn't sure why I was downvoted at first, but I get it now. It just seems simple to me, and I totally agree with you.",
    "That would say more about you than him.",
    "I agree with you, context should matter. And it does matter more...for rich famous people. And then it matters more for women. Men are at the bottom of the ladder for being excused for exposing themselves.",
    "I mean, technically \"firsthand experience\" is also just anecdotes by definition. That being said, you seem to know what you're talking about, enough that I'm giving you the benefit of the doubt haha.",
    "No, for indecent exposure. For exactly what Kanyes wife did. You can't even go around a building and pee in a vush if need be. If caught you get taken in and put on the registry first offense.",
    "My point is it's indecent exposure.",
    "Ok so if it is a crime but not assault then what is it? I was sure it was sexual assault, I was wrong. I never set out to devalue anything. To me trauma is trauma period. But for the and of this discussion what crime is someone committing, if not sexual assault by flashing someone without consent? Genuinely asking here",
    "You're the one who entered the word \"assault\" into this discussion.",
    "> Why? The line must be drawn somewhere Yes. We're debating about where that line should be drawn. > it normalizes it to the point where others do it and put ppls safety at risk. If you write her a citation, issue a nasty fine and ban her from future ceremonies, you send a message that's not normal. I don't see the need to put her on a sex offender list when she's not a sexual predator. You yourself think she isn't personally doing anything nefarious, so why would you punish her with a life long sanction that puts her on a public list as though she was?",
    "Why? Why is it so controversial that a modicum of common sense be applied to this? The SO list should be reserved for dangerous people. Male or female, trolling the Grammys isn't the act of a dangerous person.",
    "How it is in mine as well",
    "good, so we agree, what happened wasn't assault then",
    "Oh, I got that, I was just taking the mickey at your wording. Exposure, yes. Indecent, maybe. It also is free expression, though. And neither necessarily trumps the other, so it will always have to be decided on a case by case basis.",
    "indecent exposure? i dont know CA laws specifically.",
    "you suck at reading comprehension. i was responding to a comment that called it assault.",
    "Need to retroactively give one for Innerspeaker E: since this got some traction. I'd suggest watching the \"live from wavehouse\" version on YouTube. Somehow better live.",
    "Pretty sure theyve been giving out grammy awards for a while buddy",
    "But did you know Tame Impala is just one guy?!",
    "Kevin carrying Tame Impala... ![gif](giphy|kabjgjsiqjF4s|downsized)",
    "Let's go Tammy Impaler!!",
    "Happy for Justice. Met them after a show in October and they were the chillest people.",
    "First grammy ever!",
    "And 3rd one for Justice",
    "Tame Impala AND Justice win grammy*. This song was produced by Justice. Dont know why they were removed from that headline.",
    "Have to say, I really like the song.",
    "Congrats, but does anyone seriously still care about the Grammys?",
    "So happy for all members!",
    "Did you know its just one guy?",
    "Kevin piggybacked Gaspard and Xavier's grammy",
    "Such a good band",
    "Good for him!",
    "Damn had no idea it was just one guy",
    "Very cool to see a Grammy going to two artists I actually know/listen to although I haven't actually heard this song",
    "About time. Most talented person in all of music.",
    "Im just gonna say it. He still hasnt made anything as good as Lonerism, and thats okay. Still good, but I feel like he sounds too industry generic now.",
    "I also enjoyed wings of time from them. It was a song for the d&d movie.",
    "Love to see it",
    "I thought the first-ever Grammy award was won in 1959??",
    "Did you know hes just one guy?",
    "As opposed to the Wild Impala?",
    "Took them long enough.",
    "![gif](giphy|yzDtXjhGDvZRf6pPZW)",
    "He looks like he never drives faster than he can see.",
    "Been a huge fan of his for a while its about time he got some recognition",
    "YESSSSS well deserved",
    "Been around for a while! Still good!",
    "He does not need this award anyway, we all know that he's a good boy ",
    "Good to see :)",
    "![gif](giphy|l0Iyo78NhvUrzbEqs|downsized)",
    "Lets go!!! Congratulations",
    "Tommy Imp-Allah",
    "Does he have to give half of it to John Lennon for streaming his voice?",
    "Some of the most overrated, watered down garbage I have ever heard. Of course they got a Grammy.",
    "Undeserved. Edit: it's because of all the sucking they do musically. That's why it's undeserved. Because of the way the music they make sounds.",
    "TIL Tame Impala is still active.",
    "Never even heard of this jive ass turkey",
    "So did he finally make something interesting and good or was last year just not a great one?",
    "I liked the first Tame Impala song I heard. Then I realized they pretty much all sound the same.",
    "",
    "it's not meant to be",
    "It won a J award at least and that's probably a bigger deal",
    "Agree! I cant believe this is his first Grammy.",
    "An album that was at least in the top 10 of the decade.",
    "Runway houses city clouds still sounds so good.",
    "Funny that they didnt \"Let It Happen\" before now.",
    "Something something switcheroo?",
    "Yeah they definitely have ",
    "You're kidding me. You're telling me both Tame and Impala were both really the same person???",
    "One guy cant be all of The Tame Impalas",
    "Was originally going to be called Tame Tayou, but the Chuckle Brothers had already used it.",
    "I saw Tame WITH A LIVE BAND and my friend tried to be like What? No? Theres no other people like I wasnt just at the venue seeing multiple people on stage. We get it girl, its just Kevin.",
    "unironically I learned this like a month ago",
    "For years my dad thought I was telling him to listen to Tim and Paula",
    "so litty of this fire zaza you sold me",
    "Funny, next you'll be telling me Eagle-Eye Cherry is just one guy too",
    "begone russian disinfo bot",
    "![gif](giphy|jOjO7isnFImsDLi8mq)",
    "Justice has won two Grammys before this",
    "That would make a wrong headline since Justice won Grammys before.",
    "Its a fantastic track and it also sounds spectacular on good speakers.",
    "The whole album is amazing actually",
    "I care when bands I like win because I like to think it gets them more money or possibly just makes them happy. Thats about it",
    "Its fun if you dont take it too seriously",
    "you think i give a damn about a Grammy?",
    "The \"Best New Artist\" is a good category to see who will no longer be relevant",
    "The fact that he won a grammy for the garbage, generic electro-pop he puts out now, instead of the first two albums, tells you all you need to know about the grammys and quality.",
    "I seriously do not give a crap about awards for the arts.",
    "\"Band\" is debatable. Its basically just Kevin Parker.",
    "You mean Justice?",
    "Great flick. Sad it didnt get the numbers it needed for a sequel.",
    "quite a few categories are awarded before the main event, this was one of them",
    "I'm more concerned with Chris Brown still having a career. Fuck that woman beater.",
    "I feel like the Grammys give out \"make up\" awards a few years after they snub something excellent.",
    "TIL Tame Impala is a thing.",
    "To me, Neverender isn't even as good as both the Justice and the Tame Impala's other works. If you do not like the sound of it, you probably don't want to hear psychedelic music.",
    "Lmao hating on generational talent.",
    "Imagine being this musically-challenged that you cant differentiate one song from another in an artists discography. Its a you problem, buddy",
    "Really? I mean I'm no super fan or anything but I think if you listen to a couple of songs on one album like say, The Slow Rush and then a few on another like on Lonerism or something they sound pretty different? Even more differences and options if you include the song being talked about in this article that he did with Justice or any of the ones he does for various things like the D&D song or barbie song he did. A lot of em do have a certain feel to em that you'd find in any psychedelic rock song but I think a good number of em are different sounding.",
    "Feels like we only go backwards.",
    "Mods, exile this guy to Sri Lanka",
    "Had to happen Eventually",
    "I'm not your guy, clark!",
    "I miss those...",
    "*core memory unlocked*",
    "Just like Holland Oates!",
    "Is this sarcasm?",
    "The Tames Impala.",
    "if your counting Hyperdrama, yes, but before they won In 2018 for Woman Worldwide, and Cross was nominated in 2008",
    "Thats not what my headline wrote. But yes you are correct i soppose. Dont know why they excluded them fro. The title considering Tame Impala only sang in the song.",
    "Half of you critics cant even stomach me, let alone stand me",
    "Wow, an awards statue! Oh, its a Grammy",
    "RIP Chappell Roan",
    "Looked up the list and you're not kidding. 2010s are a bunch of duds and then I don't know half of the 2020s recipients. 2000s are pretty strong overall, cultural impact wise.",
    "Before he stole wave house from us the members of Pond in the share house at least helped with the writing",
    "For real - please listen to this song that just won an award and then listen to Innerspeaker and tell me they sound the same",
    "Lucky bugger could go to the second test.",
    "wouldn't mind being on a beach in Galle right now",
    "Like that's a punishment, lol",
    "He probably won because He's a Man, woman.",
    "oh youre smart for this",
    "![gif](giphy|Atc9QCyWLGHgLZhHDp|downsized)",
    "Kinda like Attorneys General?",
    "They also won Best Remixed Recording in 2009 (Electric Feel)",
    "Well, the title of the post doesn't say that either. It just says \"Tame Impala Wins First-Ever Grammy Award\" which is true. If you click on the actual news, it states further information: *Tame Impala and Justice won Best Dance/Electronic Recording for their song \"Neverender\"*",
    "smooth edit, i dont think anyone saw! ",
    "Hey, dont throw your garbage down here!",
    "Its funny to see some of the nominees that lost that category and went on to be massive artists. At the same time, I dont think it should be a popularity contest, but thats pretty much what the Grammys are anyway, especially now. I dont think theres any chance well ever get an underdog AOTY winner again with how rabid and fanatic people are these days.",
    "Had no idea either. Tame Impala, not Tame Impalas. It was there the whole time.",
    "Are you being facetious, or did you not know? That tidbit has kinda become a meme.",
    "Oh yeah forgot about that, I think that was also MGMTs only Grammy win",
    "Yes. But its justice's song. Why snub credit from their achievement. Tame only came along for the ride.",
    "![gif](giphy|cYgCX9axpoe2hPPTMt)",
    "There will always be someone who just recently finds out that its just one person and thats what keeps the meme funny to me lmao",
    "[XKCD Lucky 10,000](",
    "Have you considered that some artists don't care about the Grammy awards and think they are meaningless?",
    "They are still getting glammed for the red carpet. It's a long night. Nobody wants to get there 3 hours early.",
    "I would suspect that they genuinely cant be arsed. And good on them for that.",
    "The pre-Grammy ceremony is limited in its audience so many artists just won't bother if it means they won't be seen/photographed",
    "they're to they're there they're their.",
    "Okay yeah that's pretty understandable- I keep forgetting that the whole show genuinely takes like 6 hours",
    "Oh dang, I just saw that I made some spelling mistakes, thanks!"
]