[
    "If you would like this roundup sent to your reddit inbox every week [send me a message with the subject 'popheads']( Or if you want a daily roundup, [use the subject 'popheads daily']( (<--Click one of the links. The bot can't read chats, you must send a message). #####Please let me know if you have suggestions to make this roundup better for /r/popheads or if there are other subreddits that you think I should post in. I can search for posts based off keywords in the title, URL and flair - sorted by upvotes, \\# of comments, or awards. And I can also find the top comments overall or in specific threads.",
    "#this weeks top 10: 1 Not Like Us - Kendrick Lamar (+1) 2 Messy - Lola Young (-1) 3 Pink Pony Club - Chappell Roan (+1) 4 Luther - Kendrick Lamar & SZA (+6) 5 All The Stars - Kendrick Lamar & SZA (+6) 6 The Days - Chrystal (-1) 7 Abracadabra - Lady Gaga (-4) 8 Beautiful Things - Benson Boone (-2) 9 Please Please Please - Sabrina Carpenter (RE) **10 Busy Woman - Sabrina Carpenter (NEW)** #top 40 new entries: 19 Nokia - Drake 21 Gimme A Hug - Drake 22 CN Tower - PartyNextDoor & Drake 23 Crush - AJ Tracey & Jorja Smith #of interest: 12 APT - Ros & Bruno Mars (-4) 13 Denial Is A River - Doechii (-4) 15 Sports Car - Tate McRae (-3) 17 Thats So True - Gracie Abrams (-3) 33 30 for 30 - SZA ft Kendrick Lamar (+6) 34 Born Again - Lisa, Raye & Doja Cat (-21) 37 Who - Jimin (-20) ***** You can view the full top 100 [here]( New to the UK chart? Want to know how it works? [check out my post here](",
    "Wild to see Not Like Us becoming bigger this year globally than last year.",
    "Wow, surprised this is his first in the UK but amazing to see! Also, All the Stars back in the top 5 after 7 years of release is amazing to see.",
    "All the Stars getting that love again. Its such a good song especially the SZA parts.",
    "69: Addison Rae - High Fashion (NEW) Addison, the icon you are!!",
    "I'm surprised this is his first #1 in the UK, since he's gotten them in a lot of other countries",
    "He just keeps winning",
    "THEY NOT LIKE US! THEY NOT LIKE US!! Say Drake listeners, why did one of his songs even make the top 20??",
    "WHO is listening to beautiful things by benson boone omg",
    "I've had Not Like Us being recommended to me by Spotify all the time lately even though I don't usually listen to Kendrick. It was obviously a massive pop culture moment for a variety of organic reasons, but people going out of their way to deny there was a big push for the song are kidding themselves.",
    "Why is there a headline about a rapper on a subreddit about pop?",
    "It's crazy how much the super bowl propelled him even in places that don't watch the super bowl. 3 top 5 songs It's a shame bed chem snuck past 15 Minutes to star it out, I was watching all week knowing please please please was gonna be reset and hoping 15 Minutes would stay above bed chem",
    "Born again down 21 places oof",
    "I remember in the year-end shit when people were telling me Not Like Us only made noise in America. Keep in mind, at that point it had already gone to #1 in countries on four different continents",
    "and its getting a boost from being performed at the biggest US sporting event",
    "Believe it or not until last week, the song had only reached #6 - All The Stars had been his only top 5 hit as a lead artist up until then",
    "American rap/hip-hop generally does not perform that well in the UK commercially (compared to the US). I think maybe it's because it's got a tighter cultural appeal than pop, just like country.",
    "Can someone explain to me why this sub chooses to ignore that Addison Rae is a Trump supporting racist? She said supporting Black Lives Matter is a cult. Edit: looks like the raecists found my comment lmao.",
    "Because we have our own rap scene, it is significantly harder for US rappers to chart well over here without pandering to us. Look at Drake as an example, his only songs that charted really well were with Rihanna, who the UK loves, or more dance focused stuff like Hold On We're Going Home, until he reworked an old UK dance track for One Dance and topped the charts for 15 weeks. And then the mixtape after that was explicitly made to appeal to the UK in both it's sounds and it's features, and funnily enough he charted most songs from the album. And then following the 1-2 pinch of God's Plan and Nice For What, the former released whilst he was promoting over here a lot and the latter just appealing to our tastes, people just sort of clicked with him and he started regularly charting well on his own Then compare to Kendrick. His music doesn't, and never has, particularly appeal to UK tastes, and as such his biggest songs have been pop collaborations until now",
    "In the past he wouldve been top 10 lol",
    "Why did Drake sell out 150k tickets in London in 3 minutes when Kendrick hasn't sold a SINGLE arena yet, not even in his home town? ",
    ">Say Drake listeners, why did one of his songs even make the top 20?? This...makes no sense????? How is this a dig towards Drake? According to the internet Kendrick killed Drake's career but the second he dropped an album everyone is buying it to the point where it's outranking GNX and a random album track is charting higher for sales than Not Like Us.",
    "Labels obviously push stuff but I think when something is already popular amongst so many people at one time the algorithms recommend it more.",
    "Oh my god a label is pushing n promoting their hit song ..what a shocker that is..shut up man...even espresso was recommended to us when we didn't even listen to sabrina",
    "Yall are so dumb omg. Spotify works that way for EVERY big song. They recommend and \"autoplay\" songs that people actually listen to. All of the biggest songs recently were pushed BECAUSE they already were the biggest songs. Yall don't get algorithms it's actually sad",
    "I mean yeah, thats what major labels do. Its kind of their whole reason for existing. They have done it for literally every single artist that popheads likes. This is not something unique to Not Like Us.",
    "Youre blabbing nonsense lol",
    "No way the SB or the Grammys had this effect on the UK charts, its defo been pushed. All the stars for me is the real surprise here but maybe some people forgot about how much of a classic it is idk",
    "So pop music is short for popular music, and this is the most popular song in the country this week.",
    "charts, despite what you may believe, sometimes contain songs that aren't pop related and are just as important",
    "It's always people who never post on this sub commenting weird shit like this lmao",
    "I would guess that the Super Bowl halftime show gets easily 10x the number of viewers in the UK as the actual Super Bowl does - just by the nature of sharing a single internet it gets a big push.",
    "Born Again needs to be higher wtf its such a UK sounding hit esp with Raye in it",
    "I Genuinely think people downplay the relevance of hip hop globally severely in this subreddit",
    "I'd never heard it! Still haven't, but I keep meaning to check it out.",
    "Squabble Up and Luther both made the top 5 last year",
    "I was looking into that its crazy billie & Sabrina have 3 no.1s more than on hot 100 charts",
    "Eminem and 50 Cent are actually pretty popular there. Both of them still have albums charting there.",
    "Yeah apart from Eminem  weird that",
    "She was actively criticizing his administration in her French Vogue interview that came out two days ago",
    "Like 10 years ago. its weird how yall wont let people change?",
    "Because FauxMoi is the sub that wants to perpetually cancel everyone Btw, she was 15 and had since issued an apology for being uneducated. It deserves some common sense. Eye roll of an edit. Dont ask a question if you dont want it answered.",
    "What about nicki how does her music do in the UK?",
    "You realize that arenas and stadiums are different things, right? Kendrick is on a stadium tour.",
    "I'm not even a Drake fan but the cringey glazing people have over Kendrick is insane and a major turn off. According to the internet Drake is supposed to be dead and have no career but the second he dropped a new album it started outselling GNX and a random album track starts outpacing Not Like Us. In addition to him selling out arenas.  One reason why stan twitter is such a useless indicator of success and the users have no sense of reality or impact on the music industry because they're always so off",
    "That was a dig against his fans streaming it because it's not that good. I guess we'll see if it has any legs going forward. Yes, I am a certified Drake hater. I was a casual listener during the early to mid-2010s. And nothing has grabbed me from his recent releases! I also haven't seen any of my friends blasting his songs, except Rich Baby Daddy for a brief second. Obviously, Drake still has fans and there are people in the GP who don't know or care about the beef. He still pulls crazy streaming numbers, but the ass whooping he got after NLU was so embarrassing, I'm surprised he's still showing his face in public!! Hearing tens of thousands of people scream \"A MINOOORRRRR\" at both the Super Bowl and the Grammys has to sting! The first week sales from this album is still worse than his other projects and likely won't make much of an impact going forward so maybe think about the facts of NLU's success almost a year later!",
    "True, NLU really crossed over past the beef more than euphoria which is weird to say since hip hop has always been big but its one of those songs that people who literally NEVER listened to the genre prolly know a line or 2 (HUMBLE was also similar)",
    "I literally never said it was shocking? Just that people going above and beyond in the fandom trying to say the success of the song was entirely organic are being too sensitive about the obviousness of a normal business strategy being used.",
    "Or is it song because they promote it",
    "I love Kendrick but you have to be blind to not see that Not Like Us is being shoved everywhere",
    "Espresso has never been recommended to me in playlists that arent pop related. NLU will get recommended in LoFi playlist, baile funk playlist, classical music playlists, etc.",
    "They dont get it. ",
    "The biggest songs become the biggest songs because they are pushed. It's been this way since the first days of radio. The comment was not about why big songs pop up constantly on the algorithm, but about the reticence/denial of fans online to give credit business choices for a song's popularity because they feel doing so \"cheapens\" the impact of said art pieces. The good ol' art vs business debate in fan spaces that doesn't allow the truth of the two of them being intrinsically linked to each other to be acknowledged.",
    "Popheads being popheads as usual. They dont understand something that gets popular so they dismiss it ",
    "Never said it was unique. Just that some people have gotten overly sensitive about the song's success, especially after Drake's bogus lawsuit, that they find the idea of NLU being anything but a fanmade success story irks them. No hit song is fully \"chosen by the people\". No hit song is fully a fanmade success story. It doesn't take away from the artistry or the song's popularity/impact, and it's weird to see fandoms act like it does when it's just the rules of the game.",
    "You know the Super Bowl is a global event right? It is broadcast to 190 countries. Over 4 million people watched it in the UK this year.",
    "Pop music is a genre",
    "It's always weird people saying shit like this when someone asks a question lmao",
    "People get online every day and claim something isnt big internationally because its not big in their specific country. Everyone accuses Americans of thinking their tastes are universal but people from other countries ~~especially Europeans~~ do it too",
    "The Grammys thread was telling. There were a lot of folks who didn't understand just how big of an impact NLU capping off the beef had. The fact that it helped lead to one of the wildest live performances I have ever seen at The Pop Out concert (from playing NLU fucking five times in a row to have rival gang members dancing together in the same building) is just one part of the story. The fact it is getting even bigger now is insane.",
    "Oh my bad, I completely missed that",
    "So interesting I wonder why lol....",
    "There are a few exceptions - as someone else mentioned as well as Eminem there's 50 Cent, but also Kanye, I'm sure there's a couple others too. British rap/hip-hop is what is popular (and for what it's worth is mostly dominated by non-white artists), as I said I think because the genre tends to have more of a tight cultural appeal rather than appealing to the widest possible audience like a lot of pop/rock.",
    "They have nothing other than trying to be morally superior than everyone.",
    "The Trump support happened when she was 20 years old.",
    "About what you'd expect for someone that spends most of their time in the US Hip-hop world. When she appeals to the UK audience (either by making dancier tracks, using big old samples or working with an artist that's big here) she does well, otherwise she sorta flounders",
    "Kendrick hasnt even sold out LA ",
    "Drake sold 3 50k capacity events in 3 minutes. Kendrick hasn't sold a single 50k capacity arena yet",
    "Obviously Drake isn't dead and he is still going to sell well. But recently Kendrick has definitely outsold them. You realize that Drake's album released last week and Kendrick's album is months old and Not like Us is 9 months old.",
    "> Drake is supposed to be dead and have no career Show me 1 person that said this. You are literally making up people to be mad at.",
    ">That was a dig against his fans streaming it because it's not that good. I guess we'll see if it has any legs going forward. Yes, I am a certified Drake hater. I was a casual listener during the early to mid-2010s. And nothing has grabbed me from his recent releases! GNX isn't good either so what now >The first week sales from this album is still worse than his other projects and likely won't make much of an impact going forward so maybe think about the facts of NLU's success almost a year later! Some differences: * $$ is a collab album, not a solo Drake album * The debut sales are not that far off from GNX, and this is without any hit to promote it unlike Kendrick's album riding off the popularity of Not Like Us. ([250,000]( vs. [319,000]( * Nokia, a random album track that wasn't even promoted as a single,[ is doing better globally than Not Like Us without any promotion behind it]( This is immediately after Superbowl and Grammy promotion for the latter * $$ is worse compared to his last two, not in overall. *Honestly, Nevermind* [debuted with 50k less]( and the album only came out in 2022. This would make $$ his third-best selling debut. I never thought I'd encounter a cringier fanbase than Nicki Minaj fans but Kendrick Lamar lapdogs seem to be competing for that title",
    "What are you saying man",
    "Thats not true for me at all! Espresso as well as Lunch were played for me on non pop playlists just as much lol",
    "Ah I'm sorry I didn't realize that this didn't fully concern your original comment. It's just people in the replies are making me mad because they're saying that Not like us (and many hits) aren't actual hits since they're being \"shoved down our throats\" by the algorithm. Which is just false because the algorithm only pushes songs that are already big, that's how it works. But yes, obviously songs get big because their label pushes them. That's why music videos and the radios exist. However I'd say that with \"not like us\" it was initially big the second it dropped due to the beef lol. But the label push obviously made it even bigger than before so that almost everyone actually knows the song now.",
    "> No hit song is chosen by the people. No hit song is fully a fanmade success story. I completely disagree with these statements. Major Labels use payola literally all the time to push every single big new song from every single big new artist. And yet many of those songs do not become hits. Tyler the Creator has an 8 year old song that is higher on the Spotify charts than a brand new Tate McRae single that is being pushed heavily by her label. The people chose that Tyler song as a hit, almost a decade after it came out. Doechii has a 6 month old, old school hip hop style storytelling song about depression and drug abuse with no hook that is being streamed more than a brand new Lady Gaga pop song.",
    "That tracks, I still doubt that alone has this song where it is on the charts, the song was ovbs pushed which is fine thats just how the industry works hes clearly got the right label now.",
    "Yes, people in my country have been wondering for years now about Taylor Swift just because her songs are not that suitable for a top-40 radio full of eurodance and edm-adjacent pop hits. The same with hip-hop (the biggest foreign hip-hop song of 2024 here was Houdini by Eminem, which popularity was pretty much based on his legacy)",
    "50 is associated with Eminem which is part of it imo, Kanye yeah he was super super popular, his music had super widespread appeal. The British rap thing is true.",
    "Do you have a source? Ive googled Addison Rae Trump and all I can find is articles of her calling him out or slamming him for this and that There was one article about how she introduced herself to him at a UFC event, is that what youre talking about?",
    "Damn and what you never did something stupid at 20? Man go get angry at a real problem",
    "Lmao pop heads just downvoting every comment that doesn't dickride Kendrick. I'm not even a Drake fan, but this shit is hilarious. The hive mentality is insane.",
    "its wireless though",
    "Youre gonna suffer saying shit like that in this sub. This a Kendrick dickriders club only",
    "You do realise that GNX heavily rode off of the popularity of Not Like Us still? Age doesn't particularly matter, nor does it matter if GNX was released freshly at the beginning of 2025 or not Drake is doing fine. Nokia [is outperforming Not Like Us on iTunes]( for example, and it's literally just a random album track and not a single. This is almost immediately following Kendrick having a successive Grammy plus Superbowl promotion which supersedes how old the song is.",
    "Your incredulity isn't an authority so whether you believe it or not isn't relevant. I can show one post and you'll keep changing the goalpost. Literally just a simple search on Twitter for example and you see tonnes of people saying it, and it's been said for months since Not Like Us dropped",
    "Girl have you not been online in the past 6 months? Particularly after the super bowl Kendrick just killed Drake drakes career is over every other headline",
    "If you click on the same link, NOKIA is only doing better on iTunes where more people are purchasing it. But if you check the same charts for Apple Music and Spotify, Not Like Us is doing much better! GNX is a highly lauded album by critics AND fans and the streams reflect that. More people have been introduced to the album through the Super Bowl than when it was first released!! Kendrick had 2 solo #1s and 1 as part of the Metro Boomin and Future song Like That last year. You know how many Drake had?? 0 I think the only cringy fanbase here is Drizzy's. JFC",
    "Do they promote it because its a big song, or is it a big song because they promote it?  Why would a big song need to be promoted",
    "On occasion, you have those types of success stories, and they're a beautiful exception to rule. But they are exceedingly rare, and for a reason.",
    "[I think they might be referring to when she went out of her way to meet him when she was 20](",
    "No, at 20 I was a grown adult with a job, I was developed enough not to be a racist.",
    "Honestly its totally fine to not like Drake but its getting kinda cult-y when every comment not in praise of Kendrick is met with anger or downvotes. The beef made people in this sub weird",
    "Yea, people don't like reality, Kendrick saw gains in every statistic, except ticket sales lol",
    "> Nokia is outperforming Not Like Us on iTunes ITunes is a platform where you buy the song once and then don't have to buy it again. A song that is ~9 months old and sold a lot when it released should absolutely have less sales right now than something brand new, that's just how it works Edit: they responded to me, and then I assume blocked me? I'll quote their comment and respond here >Considering sales matter more than streams for chart placement, L take You get that this just makes Kendrick look more impressive, right? Drake is doing better in the dominant metric for charting and yet his placement is significantly lower on the chart - so Kendrick must clearly be absolutely dominating streaming. Just goes to show that cherry picking a single stat doesn't matter much in an argument if you aren't looking at the bigger picture > It being brand new doesn't matter considering it just had back to back Grammys + Superbowl performance in like less than a month which increased its popularity like never before. Also contradicted how there've been multiple works that range from being several months old to several years old that have been in the top 20 for multiple weeks. So there's two things here. Firstly, the Grammy's didn't have much of an effect on his chart placement, but the Superbowl did, probably because it was a big performance that was viewed by millions in the UK, unlike the Grammy's that isn't shown in the UK for some reason. Secondly, and more importantly, songs tend to have one peak in their sales in the digital era. You buy the mp3 (or whatever the apple equivalent is) when the song is popular and then you have it forever, you don't re-buy it. That happened for Kendrick 9 months ago. You mention songs from a few years ago, I assume you mean Pink Pony Club that's getting it's main push now, and songs from 20 years ago, which are pretty damn irrelevant given that there's been a whole new generation since then that haven't bought the songs and those that did at the time would have bought them physically which is much easier to lose, meaning they can have a second wave. Drake's single now is having it's wave at release, as most songs do - you would expect that wave, from a large star, to be bigger than songs that have already had their waves, including Kendrick's > Stan culture really is just brain rot That really does seem to be the case, huh?",
    "No, age absolutely does matter when judging current listeners. Are you serious?",
    "Headline? Show me 1 news headline that said this lmao. Thats absurd. > Kendrick just killed Drake Yes..in the rap battle. Interpreting people saying that as, Kendrick has now ended Drakes career forever. He is officially banned by the worlds governments of ever making music again. is a ridiculous way to take that.",
    "If you think Not Like Us only became a hit because of inorganic push, you need to get outside more. Ive never seen a song be so well liked everywhere I go like it has. It was actually shocking. Ive seen people going crazy over it when it plays in hipster cafes at 11AM, at baseball games, when it was just playing on house speakers before a concert I went to for a white indie rock band, and it doesnt matter how many times it comes on at a club, everyone still goes completely crazy for it when it plays, even 9 months after it came out. There were kids in remote villages across the world making dance videos to it. It was playing at weddings in India. Go on the Spotify charts and click on a random country: itll be all songs of artists from that countryplus Not Like Us. The song is a true global phenomenon crossing race, ethnicity, age, and nationality borders.",
    "I dont even know what to say to you... why do you think labels pay for payola ????? Not like us became an instant hit after it came out ...then the label just boosted the song with payola and by promoting it everywhere that's what they do with a big song",
    "Bro, DJs were playing that shit in the club the *instant* it came out. They didnt have to be paid, they just lived through one of the craziest 24 hours in rap history and knew this shit was a hit the moment they heard it",
    "They are exceedingly rare, and yet I just gave you two examples that are literally happening right now lmao",
    "Im sure youve never done anything wrong ever in your life",
    "I like hip hop, R&B, and pop, but I was mostly just a casual listener of both Drake and Kendrick. This beef was so annoying because of the insane hypocrisy involved. Kendrick said that Iggy fucking Azalea and her weird, fake Southern blaccent had a place in hip hop, but that Drake is a colonizer...even though his dad is Black American and his uncle is part of Black American music royalty. Or supporting abusers like Dr. Dre, who got a woman pregnant when she was 16, while calling Drake a pdf based on the kind of innuendo that would apply to all of male hip hop. Honestly, it made me look at Kendrick a little different especially since idiots online were turning this into some kind of movement for \"the culture,\" when to me, he just came across as a dude who envied Drakes success, while too online FBA xenophobes were just pissed Jimmy from Degrassi became the biggest artist in hip hop. There I said it lol.",
    ">ITunes is a platform where you buy the song once and then don't have to buy it again. A song that is \\~9 months old and sold a lot when it released should absolutely have less sales right now than something brand new, that's just how it works Considering sales matter more than streams for chart placement, L take > A song that is \\~9 months old and sold a lot when it released should absolutely have less sales right now than something brand new, that's just how it works It being brand new doesn't matter considering it just had back to back Grammys + Superbowl performance in like less than a month which increased its popularity like never before. Also contradicted how there've been multiple works that range from being several months old to several years old that have been in the top 20 for multiple weeks. Stan culture really is just brain rot",
    "Did we not witness Chappel Roan having multiple hit songs last year that ranged from being released in 2020 to 2023? Songs do not have a one week shelf life and people stop listening to it, especially after big events like the Grammys or Super Bowl",
    "I was in Korea the week it came out and heard it in a very fancy coffee shop. Heard it played on a Bluetooth speaker a week after outside a pub in London. I can't believe Kendrick paid for all this.",
    "Yes a song can become massive from widespread payola. I think it would've gotten big regardless, but the trend is too obvious Explain how NLU goes #1 after the superbowl, them suddenly after it goes #1, Luther surges past it to add another #1?",
    "Yeah, those two examples are a perfect example of the rarity of this phenomenon. You have something like that now, you won't have it again for a good while. And even those songs aren't exactly setting official country charts on fire (Billboard, UKSC, etc) or saturating pop culture, which is still the metric for real success. Spotify numbers are all but one drop in an ocean of ever expanding categories that are counted to quantify popularity.",
    "You have to be an idiot to think Kendrick envies drakes success. What a shock as the Canadian dickrides drake though.",
    "Chappell becoming one of the biggest artists of the year off a back catalogue that blew up is basically unprecedented. Can't use the exception to justify the rule.",
    "> Explain how NLU goes #1 after the Super Bowl If someone needs to explain to you how this happened..lmao > then suddenly after it goes #1, Luther surges past it to add another #1? Because Not Like Us is a 9 month old song, and Luther was already a top 3 charting active hit song on Billboard the week right before the Super Bowl? Like its not that hard to understand lmao. You realize Luther already almost went #1 multiple times in 2025 before the Super Bowl, right?",
    "Canadians don't dickride Drake at all. He's always been hated hard in Canada. Canadians have actually been mocking him this whole beef and dickriding Kendrick. Only his Canadian fans love him. I've personally NEVER been a Drake supporter. I don't like people just because they're Canadian lol. Thanks for creeping through my profile and comment history, though. Rap is an *extremely* competitive genre. If you don't think hip hop artists, including Kendrick and Drake, envy each other's success, especially those on top, you're deluded. Btw, thanks for completely avoiding the topic about the hypocrisy in this beef. Not shocking at all.",
    "But that directly contradicts what was just said. And it still applies to Not Like Us' popularity as well. Lola Young's *Messy* got popular months after it was released in the US. It's really not that rare. The notion that songs only can get popular within the week of its release is false. Other factors can 'bring it back to life' or make it more popular than it ever was before.",
    "It's qlmost like they turned on payola for NLU and then turned on Payola for Luther week two, if you follow the trends it was very obvious",
    "I have mentioned Kendrick being hypocritical myself before I think its a fair point. The people I know that lived in Canada spoke about how much people love him and Canadians I know love him too but maybe thats selective and theyre all speaking about Toronto basically. Drake definitely envies Kendricks critical acclaim which is part of it, Kendrick just doesnt envy drakes popularity I dont know how you can come to that conclusion. Kendrick stays off social media, he doesnt release music constantly like drake, he makes things that arent whats typically popular. After DAMN when he could have gone really commercial and was at his highest he then went away for ages and released an album with no singles that was a personal album with little mainstream appeal, about personal growth and coming to terms with things and mistakes in his life etc. If he wanted to be more popular he would be, not everyone wants to be Drake, Kendrick is a popular artist who also has artistic merit thats what he wants to be not Drake.",
    ">But that directly contradicts what was just said I'm not OP so not going to provide an explanation for their point, I'm just replying to yours. >It's really not that rare. The notion that songs only can get popular within the week of its release is false Whilst you're correct, using Chappell is probably the most extreme example of that to happen in the mainstream independent of being used as a soundtrack such as Running Up That Hill",
    "Yeah this surge in streaming for Kendrick is all a conspiracy. It certainly had nothing to do with him performing at the global television event that was watched by 250 million people worldwide. Drizzlers are delusional lol",
    "1. Kendrick Lamar - Not Like Us (+14) 2. Kendrick Lamar & SZA - Luther (+1) 3. Kendrick Lamar featuring Lefty Gunplay - TV Off (+7) 4. Lady Gaga and Bruno Mars - Die With A Smile (-3) 5. Kendrick Lamar - Squabble Up (+15) 6. Billie Eilish - Birds of a Feather (-2) 7. Ros and Bruno Mars - APT. (-1) 8. Shaboozey - A Bar Song (Tipsy) (-3) 9. Chappell Roan - Pink Pony Club (+9) 10. SZA & Kendrick Lamar - 30 for 30 (+12) **Meanwhile, Not Like Us becomes the first non-holiday song to top the Hot 100 three separate times with breaks of two or more months in between each domination.**",
    "Curious where Abracadabra lands. Assume it rose from 29?",
    "Every damn time this song gets performed on a huge stage it goes right back to Number 1. Its crazy. Hopefully Luther goes Number 1 next week.",
    "Damn I was hoping it would be Luther",
    "Drake just fell to his knees in a Claire's",
    "As a society I think we can let A Bar Song go. No reason it needs to be hanging around the top ten anymore",
    "Wop wop wop wop wop",
    "Wow, an imperial period for Kendrick",
    "I remember the first time I heard Pink Pony Club in early 2021 and being blown away, immediately restarting it when it ended because it felt like something so special. And now 5 years after release its a top 10 hit??? Couldnt have happened to a more deserving artist",
    "30 for 30 getting top 10 is the real gem.",
    "I want him to drop a video for TV off and get it to number one. Luther will get there eventually",
    "Kendrick having the entire top 3 post-Super Bowl is ICONIC! I cant actually remember the last time Super Bowl had a significant impact on the charts, but then again the last few years artists didnt have current hits on the charts. Surprised to see 30 for 30 in the top 10! Interesting because they didnt actually perform that during the halftime show so it must have been organically rising anyway.",
    "what a song, what a hit, what a ride",
    "Aubrey in shambles",
    "Kendrick having half of the top 10 is absolutely crazy",
    "It's interesting that as of yesterday Die with a Smile is back to #1 on the Spotify Global Top 50, now 123 days at #1. The closest other relatively recent song is Flowers, tied with Blinding Lights at 82 days. But Kendrick continues to dominate the US Top 50 for obvious reasons",
    "Drake responding to like that verse pretty much ended his career in every way tbh. His numbers during and after the beef seems to take a big hit. Even his new album isnt doing big numbers and hes struggling to get a top 10 atp. In the midst of this Kendrick career took a new peak (this era is prob bigger than DAMN) as a whole.",
    "The best billboard top 10 Ive seen in a long time honestly",
    "Solid top ten. Nice to see some movement. Luther for #1 next week!",
    "Finally no Espresso, Lose Control and Beautiful Things omg",
    "But I thought no one's heard of this Kendrick guy and it was the most boring halftime ever! >!/s in case that wasn't obvious!<",
    "Drake, just hang it up. Kendrick murdered you and hes *still* murdering you",
    "Kendrick is like the boogeyman he is everywhere making sure drake knows no peace  Didnt drake release something last week? The singles didnt chart?",
    "Not Like Us back on top, Pink Pony Club becomes Chappell Roan's second top-10 hit...and only three new arrivals: \\#55: TWENTIES by GIVON (Best Of The Week) \\#61: Ordinary by Alex Warren (Worst Of The Week) \\#68: Born Again by LISA feat. Doja Cat & RAYE And finally, the FOURTEEN re-entries, six of which are from Kendrick Lamar: \\#96: Push 2 Start by Tyla \\#93: THE GREATEST by Billie Eilish \\#90: MUTT by Leon Thomas \\#89: \"Kh?\" by Rauw Alejandro y Romeo Santos \\#88: Guess by Charli xcx featuring Billie Eilish \\#84: Backseat Driver by Kane Brown \\#81: dodger blue by Kendrick Lamar feat. Wallie the Sensei, Siete7x & Roddy Ricch \\#80: euphoria by Kendrick Lamar (SHOO, SHOO, BIH BIH BIH BIH BIH BIH) \\#77: wacced out murals by Kendrick Lamar \\#76: Burning Down by Alex Warren \\#63: Hard Fought Hallelujah by Brandon Lake \\#45: Like That by Future & Metro Boomin feat. Kendrick Lamar \\#33: \"HUMBLE.\" by Kendrick Lamar And finally... ***Love...*** ***Let's talk about love*** ***Is it anything and everything you hoped for?*** ***Or do the feeling haunt you...*** ***Or does the feeling haunt you...*** ***This maybe the night that my dreams might let me know*** ***All the stars approach you, all the stars approach you, all the stars approach you*** ***This maybe the night that my dreams might let me know*** ***All the stars are closer, all the stars are closer, all the stars are closer*** \\#14: All The Stars by Kendrick Lamar featuring SZA",
    "Im sick of this song. Pls make it go away ",
    "Im so tried of this song ngl",
    "Drake wasnt falling off on his own they had to send him packing one way or another",
    "Really number 10 for sza also why is that diss track number 1 again the songs on gnx are much better",
    "Chappell having a 2nd top ten hit is pushing her into the pop supreme",
    "Wooooo Pink Pony Club in the top 10, I had the feeling that Grammy performance would boost it.",
    "this time last year i dont think anybody wouldve believed anything about this chart except billie being there what a time",
    "Records like this are so funny to me Not Like Us becomes the first song by an artist with consecutive letters for the start of their names to hit no1 3 times in 365 days ",
    "Entire Kendrick top 3 and pink pony club top 10, thank god for that",
    "Pink Pony Club galloping up the charts like that is crazy.. was it from the VMAs?? why come no one else",
    "What a top 10! Im so proud of Kendrick like hes my cousin or something. GNX is a really good album.",
    "Four songs in the top 10, and the whole top 3?!??!?! That's insane! He deserves it.",
    "This is the most stacked top 10 in a while. Like, the worst song here is DWAS and that one is still good! Also, Pink Pony Club might have a shot at 2025 Year-End!",
    "Loving todays chart ",
    "Wow, not even a track off of the new Drake album hit the top 10.",
    "Not in the top 10 grrr",
    "Luther has a pretty good chance at reaching #1 next week",
    "Luther is hitting #1 next week. Projections have it there by a considerable margin.",
    "If it ends up being Luther I swear Im like 50% of streams",
    "It still stands to top the chart next week",
    "Not me googling whether or not Luther Vandross is dead like I thought",
    "Luther will avenge the injustice of Snooze languishing at #2 for weeks.",
    "If his new album gets blocked by GMX next Sunday that might actually be worse lol",
    "Just fell to his knees saying hi to your padre",
    "IN A CLAIRES screaming crying throwing up",
    "this comment is diabolical considering the usual claires clientele",
    "Looks like somebodys not at the bar getting tipsy /s",
    "I was rooting for Shaboozey to get another hit. People won't let this one go.",
    "it should have never happened. shaboozey is a cool guy, but that song gets on my nerves",
    "Going for record downvotes here. A Bar Song > Not Like Us And it's not even close.",
    "Dot fuck em up",
    "By far the best thing to come out of streaming/tiktok for music is sleeper hits like this. Its so cool that songs released years ago can gain traction like this. The way Miguel - Sure Thing charted 14 years after release was crazy.",
    "I played it for an hour straight then messaged her on ig the first time I heard it. I knew she and it were something special.",
    "Such a solid song also.",
    "Nothing is even near DWAS globally (except Luther this week). Even for new releases very few can peak that high. And it might get another boost from Gaga's album release..",
    "What? Hes been consistently the top 1 most listened rapper throughout the whole beef. It only changed when Kendrick passed him. Just because the beef made Kendrick rise to a new status, that doesnt mean that Drakes flopping.",
    "Boomers and Gen X getting mad that pop culture has entirely stopped catering to them. Like, they announce the halftime performer weeks in advance. If any of them had cared at all, they could have at least googled his name. Millennials got screwed after JT exposed Janets boob 20 years ago and its taken a long time to correct itself.",
    ">Didnt drake release something last week? The singles didnt chart? Next week will be his first week on the chart.",
    "Every time lightning flashes drake sees Kendrick in the corner of his eye ",
    "ADDENDUM: According to Talk Of The Charts; Money Trees by Kendrick Lamar featuring Jay Rock & Anna Wise was predicted to debut this week approximately at #48. But for some stupid reason Billboard decided to omit the song. Headlock by Imogen Heap (released in 2005) is in its fifth week on the Hot 100 at #83.",
    "Ive been watching Pink Pony Clubs streams and the views on YouTube slowly rise and I love that the song that got her dropped by the label is finally (!!!) having its moment. Just pure fuck you energy paying off ",
    "She must have already been the way the pop culture subs loooooove to trash talk her. Shes as divisive as TS now except the mods dont seem to care as much about brigading.",
    "Having a brilliant awards speech boosted her for sure.",
    "I mean, the wording in this case is kind of weird, but I actually think its pretty significant that there have been a couple cases of this song just going in the natural order that many other songs do in dying down in popularity, but then because of how culturally significant it is, its rebounding many times not even within a year of it coming out.",
    "My brain must not be working what does this mean?",
    "She performed it at the Grammys.",
    "She got that Todd in the Shadows boost, I'm sure of it",
    "Americans finally had their gay awakening under Trump",
    "Actually 5 in the top 10  Not like us, Luther, TV off, squabble up, and 30 for 30",
    "When GNX came out he also took up the whole top 5 and I think 8 places of the top 10, if Mariahs Christmas boost didnt start he would have had 9 places of the top 10",
    "That will count for next week's charts. Not this week. That being said, GIMME A HUG is gearing for a weak debut at #10.",
    "Oof so close. Is Abracadabra holding up on streaming/radio? Maybe it can get top 10 next week",
    "Just by my streams alone, I helped it jump a few placements. Your welcome.",
    "Where do people view these projections?",
    "That honestly would be extremely impressive especially considering how much Drake's fanbase has been pushing his sales and inflating his streams since it was released. But even if wouldn't, they already have all the excuses and narratives prepared. It's because it had no promotion, it's because PnD was the lead artist instead of Drake, it's because Spotify is faking his numbers, it's because they are trying to hide the album on streaming services, it's because it's an RnB album, it's because Kendricks streams were botted Basically whatever they can thunk of even though they know it's untrue. They grasp at every straw they can find only to avoid the reality that the most probable answer is that many people simply realised that Drake has been shitting out mediocre albums for over a decade and they just are fed up with it",
    "r/KendrickLamar is also telling everybody to stream Sabrinas new album, lol",
    "That would be a shock. I think the Drake/PND album has CDs and vinyls available first week this time around. Which typically these rap/hip hop artist never have ready at launch.",
    "That would be crazy if he debuts at number two. I dont think thats EVER happened!",
    "That's the joke.",
    "if you want p.diddy jokes popheadcirclejerk is great for that",
    "> Going for record downvotes here. Im doing my part ",
    "I honestly think both are fine, I enjoyed both quite a bit at one point, both have kind of worn out their appeal on me (but the horns on not like us are still fire so I would def rather listen to NLU at this point) but even if you feel Bar song> NLU, surely you can acknowledge that theres logic behind why NLU is getting enough play to chart this high now while theres not really a great reason why we havent moved onto the next Shaboozey song or other country crossover hit. Weve played tipsy into the ground imo.",
    "Youre right about the not even being close part!",
    "Yeah for all the hate TikTok gets on this sub and while its admittedly annoying that every song is two minutes long now, I still wouldnt go back to the pre social media, total industry control era of music.",
    "I'm not sure there's much of a point to \"Out of two people, 1 was the most listened to until 2 became the most listened to.\" Drake was only the Number 1 because he wasn't just rapping. His pop songs are what kept him up there, and pop has historically always done much better with these numbers than rap. Drake enjoyed the inertia of being one of the biggest artists in the world for a decade. Once Kendrick put his tracks out, the numbers shifted almost immediately. The fact that Drake even got dethroned by someone who primarily is a rapper who makes hip hop music is not just some interesting quirk. That's a major blow to someone who operates more as a pop star. And that's just data from last year. The numbers from his latest release show that the infamous \"Drake stimulus package\", which was treated as a real, known phenomenon just a year ago to the tune of hundreds of millions from UMG, has been destroyed. This is a major career low for Drake, for the first time in over 10 years.",
    "Hes only there b/c of his old music. Im not saying hes going to be next Ja rule or anything but its clear his career has taken a massive hit atp. Everything he releases will do bad numbers now. Hes essentially a legacy act now if that makes sense",
    "Any super streamed artist will never lose streams. Drake cant even get a top forty single since hes released a bunch of singles that didnt do so hot.",
    "Theyre ticked off that Kendrick beat MJs Super Bowl halftime show ratings going see MJ still has it by a few points! Lol",
    "Boomers maybe but I feel like pop culture still cares about Gen X? Nirvana and Alanis Morissette just did fireaid and everyone loved it",
    "I'm so basic, like I've heard the song before and appreciated the message. But hearing it on the radio has made me crave it and seek it out more, it really does make a difference.",
    "What that classic song got her dropped by her label?!?",
    "She generates such weird discourse, more than a lot of genuinely awful people in the industry",
    "I agree, but I dont see how its brigading in this case.",
    "I just find overly specific records funny idk why",
    "Its gone to number one three times but had a long break between each number one (two months plus between each time it went #1), it shows the song has a lot of longevity. Holiday songs obviously do this easily because they chart every year with a big break between the last time they were #1 but its the first non-holiday song to do this.",
    "K and L are consecutive letters",
    "I definitely gave it another few spins after his video and the Grammy helped too.",
    "Its dropped a fair bit on streaming I think, if it goes top 10 it probably wont be until album release week",
    "Itll get there next week for sure. Only reason its not there already is the Kendrick effect",
    "its predicted to fall next week",
    "TalkOfTheCharts on twitter",
    "Yep. Despite everything you said above maybe being factors, the big difference right now is that at least currently it is just not cool to like to Drake. The music itself has not changed, this is the same mediocre Drake album as usual.",
    "Using the Disney girl to push out Drizzy..... diabolical",
    "They should. Its a good album.",
    "CDs yes but not vinyls.",
    "If you missed the point, heres the explanation: The original comment I replied to said: >Drake responding to like that verse pretty much ended his career in every way tbh. His numbers during and after the beef seems to take a big hit. For that I replied that before, during and after the beef, Drake managed to stay the top 1 and (after Kendrick surpassed him) now top 2, which would invalidate the claim that Drake pretty much ended his career and even that his numbers () seems to take a big hit. Thats the point in bringing the fact that he was top 1 until he became top 2. It should be also noted that if we count Bad Bunny, then Drake would be the 3rd most listened. Regarding your explanation of why Drake used to sit on #1 for so long, I must say that thats irrelevant. He used to be the most streamed rapper and now he isnt, Kendrick took his spot after the beef. Its also a bit disingenuous to claim that Drake was only #1 because of his pop songs when you check his most listened songs. Its simply not true. Unless you think Kendrick got to #1 by defeating a pop star lol >Thats a major career low for Drake I guess we could say that, but the for Drake is doing some heavy lifting here. Lets not act like being the 2nd most listened rapper in the US is anywhere close to career ending or bad numbers.",
    "Even if that was true, it would be quite different than having his career pretty much ended in every way tbh.",
    "And you know whats crazy? MJs Super Bowl is the first time I ever remember understanding cultural moments. I was 5 and *begged* my parents to let me stay up to watch. I remember where I was in our home, even! Weirdly I dont remember if I actually got to watch, ha. So, shocker!, getting currently popular artists can actually satisfy multigenerational viewers.",
    "It wasnt just Boomers upset over Kendrick. 50 year olds are Gen X.",
    "Even the Dr. Dre and Snoop halftime a few years ago was kinda aimed toward Gen X.. and Kendrick was *in* that one, lol. At the same time, I think some of the people talking shit about the halftime show were younger, just extremely sheltered/living in homogeneous white areas or salty about the symbolism in the performance itself",
    "I'm guessing the rise is mostly due to the Grammy performance!",
    "Yeah, they dropped her shortly after releasing it in 2020. It was her first song with a new sound, also her first working with Daniel Nigro (Olivias producer) They felt she wasnt marketable enough and basically gave up on her after several EPs under that contract. She was barely getting by before Good Luck, Babe blew up. Now people are finally hearing the talent, we love to see it",
    "She has the classic problem of a small, yet LOUDLY, obnoxious, entitled, this music isnt for YOU, fanbase that dominates Twitter.",
    "Here is a pretty niche UK chart fact for you then. In the UK an Australian act impersonating Italian music has gone to number one and has blocked a song that would go on to outsell it twice. Suddapa you face blocked Vienna by ultravox, and We No Speak Americano blocked Love The Way You Lie. Both songs they blocked were higher on the year end charts with Eminem being the best performing song of the year.",
    "He reminded Americans how awful homophobia is so theyre all streaming Pink Pony Club and dreaming of escaping this awful mess.",
    "i think it will definitely hit top 10 when the album drops and may surge even higher after an SNL performance/other promo",
    "Current predictions have it dropping next week, not rising",
    "There's a double standard going on here if your pointed needed a doubling down on explanation to show how it still can apply but my point about the reading of those metrics can be quickly dismissed as \"irrelevant\". Also Kendrick did go to #1 by defeating a pop star. That's the whole thing. Considering Drake more of a pop star than a rapper is not an uncommon perspective. The hip hop community has been pointing this out for a long time. \"I like Drake with the melodies\" wasn't about his rapping. Many of his biggest hits are not rap. Drake's entire gamble was that this beef would not affect him or his numbers, and that Kendrick would never match them. He said this directly in his opening salvo. Even if we want to look at numbers objectively, it's clear Drake himself doesn't. He put a lot of pride and braggadocio into his numbers. Him getting dethroned is a huge personal career low for him. Yes, it's not far to say his career is dead or limping but we can't ignore that he never thought this would ever happen to him as recently as last spring.",
    "Drake lost buddy",
    "Yeah I was at my brothers apartment when MJs Super Bowl performance came on. It was allowed lol",
    "Im just saying Gen X isnt culturally irrelevant the way boomers are yet like the comment claimed. I think it was mostly boomers though. At any rate my Gen X parents liked the performance and Kendrick being in with Dr Dre and paying homage to Pac constantly seems to buy him some grace with that generation lmao",
    "Clearly it's because of Todd in the Shadows ranking it the best of 2024",
    "But this isnt twitter - this is Reddit and the comments on any post about her are just atrocious. I agree with AigisAegis - shes a vocal lesbian and that doesnt fit the pop girlie mold for many.",
    "I think most of her \"problem\" is less about that and more about her being an especially vocal queer woman tbh",
    "my favorite chappell roan fan tic is that anyone saying good luck babe is kinda biphobic gets accused of \"lesbophobia\"",
    "With how huge Eminem is in the UK Im surprised Love the Way You Lie wasnt a #1",
    "Everyone knows that lil bro Weve been talking about it for almost a year now",
    "Old asf lmfao",
    "TITS mention and Bjrk flair. I havent felt this safe in weeks.",
    "This sub is a very queer space. This reasoning makes no sense. It's probably because people turned against her after she rightfully defended her personal boundaries when not in a performance / professional situation.",
    "If it hasn't been obvious, those people have also signed up for reddit *en masse* in the last ~7 years. Look at reddit traffic/subscriber charts: the lines shoot up post-2017. So yeah, this isn't Twitter. But the people there have arrived here.",
    "Do you really think popheads hates her because shes gay?",
    "She's also from the Midwest, so she gets shit from coastal folks for having sympathy for people in red states.",
    "Well, agree to disagree.",
    "I think we all need to go outside and enjoy the sunshine",
    "Found the Drake stan right here",
    "Queer /= free from misogyny. This is completely anecdotal but all my gay male friends irl hate her and are vocal about it. Blaming her for the election loss, etc etc. I unsubbed from popculturechat because of how they talked about a woman brand new to stardom. This is not a safe space either but at least there is more real discussion.",
    "Do I think gay men dislike lesbian women? Yes.",
    "This right here. Being from the south, its insane how out of touch coastal liberals are. Like yes I am indeed progressive, but I also understand why half of my family is disillusioned by the democrats. I have dealt with these kinds of people my entire life, was raised by them, went through natural disasters with them  I see them as human beings with their own experiences that led them here today. Ive tried the no contact thing, but the real way to change peoples minds is through their hearts. Showing empathy for the other side can only result in a net positive for society. Note: That doesnt mean rolling over and not calling them out when theyre clearly in the wrong.",
    "i dont understand how she gets hate for the election, if taylor who is the biggest celebrity in the US couldn't help then i doubt what chappell said made any difference",
    "when your states been sending billions of dollars of aid for decades towards the south only to have those folks turn around and say we deserve to burn in hell in our wildfires, its pretty fucking frustrating",
    "This is cool and all but as somebody who is from a similar area as you I am transgender so I don't really get to just change my family and community's mind through their hearts they just hate me for no reason Nuance is important, and this sort of lionizing rural America is not actually better than demonizing it. Red states contain a lot of people just living their lives, and a lot of people who are justifiably disillusioned with a broken system. And they also contain a lot of horrible, hateful people who genuinely do just want bad things for bad reasons. And the latter are not a minority! They're a huge part of the population, and *you have to deal with that*. You don't get to just ignore them and act like everybody in every red state is one of those innocent disillusioned folk Or I guess you do get to just ignore them. But again, I'm trans, so I super don't!",
    "I get it, I moved to California. People in red states see you as the pretentious elites who hoard money and buy up all of our cheap real estate. They either dont realize or choose to ignore that there are working class people like them in the expensive blue states. It makes no sense why they think a handful of billionaires are totally fine, but alas, Im not here to defend their views. Im just saying they are people, and people can change if you act as an example and dont just cut them off.",
    "Most people don't really think that. It's the anonymity of the internet and the distance that make s think that \"they\" are out to get us. We each demonize the other, and people like Chappell are going to be critical to move forward through all the division that's been sown among working-class Americans. I live in California, too, btw.",
    "Good thing I clearly said in this thread that theres a difference between harmful people and those who are open to discussion. You are preaching to the choir. Youre also proving my point for why we need to change our messaging and communication strategy to win America back. Do whatever you feel is best for you and your community, more power to you. And Ill continue doing what is best for mine.",
    "Sooooo... this is a BIG week! We're celebrating **400 WEEKS** of the popheads charts! I have a few big stat overviews, but first let's get started with this week's takeways: * **'Abracadabra'** has managed to pull a real magic trick and chart with MORE points this week than it did in it's debut! With 9249.5 points, it overtakes Rain on Me to become not only Gaga's biggest song, but the 9th most points any song has recieved in the charts history (Which places it just above Olivia Rodrigo's **'Vampire'** (9127.5 points) and just below Charli XCX's **'Sympathy is a Knife featuring ariana grande'** (9369.0)) * **'Good Luck, Babe!'** charts at #25 this week, which brings it up to a **record-breaking** 45 consecutive weeks on the popheads charts!! Chappell takes the record from herself, beating the impressive 44 week streak Red Wine Supernova managed to hold (a track which also managed to chart this week at #41). **'Pink Pony Club'**'s re-entry at #7 is ALSO a new peak for the song! * That's not the only track growing an impressive streak however, as this week brings Charli XCX's **'360'** streak up to 40 weeks, tying it with Taylor Swift's **'Delicate'**. And only one week behind that is Billie Eilish's **'BIRDS OF A FEATHER'**, tying yet another Taylor Swift song **'Cruel Summer'** at 39 weeks. All of these massive hits show no signs of slowing down, so who knows how far these streaks will go! * The big album bomb this week was Oklou's debut album *choke enough*, which charted 11 of it's 13 tracks on the chart. Oklou had previously charted 3 different songs, but ict and Blade Bird mark her first entries in the Top 10! The biggest debut song this week is the triple threat **'Born Again'** with LISA, Raye and Doja Cat, with the only other debut this week being Ava Max's **'LOST YOUR FAITH'** at #42. Additionaly, thanks to a feature on Oklou's **'Harvest Sky'**, Underscores gains her first entry in the popheads chart this week, at a respectable #24. * Thanks to the continual charting of **'Espresso'** and **'Taste'**, Sabrina Carpenter has been on the chart for 44 consecutive weeks this week (from April 29th, 2024) tying her with Olivia Rodrigo's (lol) previous best streak from January 18th, 2021 - November 15th, 2021 (between **'drivers license'**, **'deja vu'** and **'good 4 u'**). Chappell Roan still maintains her top spot in this statistic however, with her current streak of 65 weeks starting from November 27th, 2023 with **'Red Wine Supernova'**, and **'Good Luck, Babe!'** helping to maintain this mammoth run.",
    "##**400 Weeks Stats Update!** There is a lot of data to present here, so I will provide the charts broken up into sections, and let them speak for themselves. I intend to update these every week, and I'll mention any significant updates/changes in the weekly takeaways, but I am also hoping to be able to get the up-to-date charts put into the [wiki]( to allow anyone curious to check at any time :) --- #**Song Statistics** ##Biggest Point Peaks | # | Song | Artists | Points | #1 Listeners | Total Listeners | Week | |:-----------:|:------------|:------------|:-----------:|:-----------:|:-----------:|:-----------:| 1|Girl, so confusing featuring lorde|Charli XCX, Lorde|12029.0|418|1004|Jul 1, '24 2|Guess featuring Billie Eilish|Charli XCX, Billie Eilish|10447.5|368|911|Aug 12, '24 3|yes, and?|Ariana Grande|10397.5|404|867|Jan 22, '24 4|Von dutch|Charli XCX|10100.0|390|812|Mar 11, '24 5|Houdini|Dua Lipa|9859.0|394|814|Nov 20, '23 6|360|Charli XCX|9847.0|111|978|Jun 17, '24 7|Sympathy is a knife|Charli XCX|9745.0|128|969|Jun 17, '24 8|Sympathy is a knife featuring ariana grande|Charli XCX, Ariana Grande|9369.0|197|896|Oct 21, '24 9|Abracadbra|Lady Gaga|9249.5|294|807|Feb 17, '25 10|vampire|Olivia Rodrigo|9127.5|328|735|Jul 10, '23 11|Solar Power|Lorde|8940.0|158|816|Jun 19, '21 12|Anti-Hero|Taylor Swift|8841.5|397|680|Oct 31, '22 13|Rain On Me|Lady Gaga, Ariana Grande|8821.0|322|724|Jun 1, '20 14|Rush|Troye Sivan|8347.0|317|699|Jul 24, '23 15|LUNCH|Billie Eilish|8340.5|130|829|May 27, '24 16|Talk talk|Charli XCX|8275.5|68|902|Jun 17, '24 17|bad idea right?|Olivia Rodrigo|7944.5|272|694|Aug 21, '23 18|we can't be friends (wait for your love)|Ariana Grande|7892.5|163|779|Mar 18, '24 19|Taste|Sabrina Carpenter|7820.5|182|718|Sep 2, '24 20|Good Ones|Charli XCX|7777.0|300|632|Sep 13, '21 21|Espresso|Sabrina Carpenter|7748.0|182|702|May 6, '24 22|bye|Ariana Grande|7267.5|47|774|Mar 18, '24 23|Sour Candy|Lady Gaga, BLACKPINK|7258.0|180|657|Jun 8, '20 24|ALIEN SUPERSTAR|Beyonc|7195.0|123|720|Aug 8, '22 25|the boy is mine|Ariana Grande|7184.0|103|738|Mar 18, '24 ##Most Weeks in Chart | # | Artist - Song | Weeks | |:-----------:|:------------|:------------| 1|Taylor Swift - Cruel Summer|107 2|Ethel Cain - American Teenager|62 3|Chappell Roan - Red Wine Supernova|60 4|Taylor Swift - august|56 5|Taylor Swift - Delicate|52 6|Dua Lipa - Levitating|50 7|Charli XCX - Von dutch|47 8|Chappell Roan - HOT TO GO!|46 9|Chappell Roan - Good Luck, Babe!|45 10|Dua Lipa - Don't Start Now|44 11|Taylor Swift - Anti-Hero|42 12|Charli XCX - Good Ones|41 13|Charli XCX - 360|40 =|Taylor Swift - Lavender Haze|40 15|Billie Eilish - BIRDS OF A FEATHER|39 16|Sabrina Carpenter - Espresso|38 =|Lorde - Perfect Places|38 =|Lorde - Green Light|38 19|Caroline Polachek - So Hot You're Hurting My Feelings|37 =|Rina Sawayama - XS|37 21|Taylor Swift - cardigan|36 22|Taylor Swift - Karma|35 23|Olivia Rodrigo - good 4 u|34 24|Ariana Grande - no tears left to cry|33 =|Lady Gaga - Rain On Me|33 =|Chappell Roan - Super Graphic Ultra Modern Girl|33 =|Dua Lipa - New Rules|33 ##Most Weeks in the Top 10 | # | Artist - Song | Weeks | |:-----------:|:------------|:------------| 1|Dua Lipa - Don't Start Now|24 2|Taylor Swift - Cruel Summer|23 3|Charli XCX - 360|23 4|Chappell Roan - Good Luck, Babe!|21 =|Charli XCX - Good Ones|21 6|Dua Lipa - New Rules|18 7|Dua Lipa - Houdini|16 =|Taylor Swift - Anti-Hero|16 =|Tate McRae - greedy|16 10|Charli XCX - Von dutch|15 =|Camila Cabello - Havana [ft. Young Thug]|15 =|Taylor Swift - Lavender Haze|15 ##Most Weeks at #1 | # | Artist - Song | Weeks | |:-----------:|:------------|:------------| 1|Beyonc - ALIEN SUPERSTAR|6 =|Charli XCX - Good Ones|6 =|Dua Lipa - Houdini|6 =|Taylor Swift - Anti-Hero|6 5|Ariana Grande - thank u, next|5 =|Charli XCX - 360|5 =|Dua Lipa - Don't Start Now|5 =|Lady Gaga - Rain On Me (feat. Ariana Grande)|5 =|Sabrina Carpenter - Taste|5 =|SZA - Kill Bill|5 =|Taylor Swift - Cruel Summer|5 ##Most Weeks Without Peaking in the Top 10 | # | Artist - Song | Weeks | |:-----------:|:------------|:------------| 1|Chappell Roan - Super Graphic Ultra Modern Girl|33|#12 2|Chappell Roan - Femininomenon|23|#16 3|Carly Rae Jepsen - Run Away With Me|22|#25 4|NewJeans - Hype Boy|19|#22 =|Taylor Swift - Style|19|#22 6|Paramore - Hard Times|16|#13 =|Sigrid - Strangers|16|#14 8|Marshmello, Bastille - Happier|15|#27 =|Post Malone - Circles|15|#16 =|Steve Lacy - Bad Habit|15|#15 =|Tinashe - Needs|15|#14 ##Most Consecutive Weeks in Chart \\* denotes a streak that is currently ongoing | # | Artist - Song | Weeks | |:-----------:|:------------|:------------| 1|Chappell Roan - Good Luck, Babe!|45* 2|Chappell Roan - Red Wine Supernova|44 =|Taylor Swift - Delicate|40 4|Charli XCX - 360|40* 5|Taylor Swift - Cruel Summer|39 =|Billie Eilish - BIRDS OF A FEATHER|39* 7|Taylor Swift - Anti-Hero|37 8|Taylor Swift - Lavender Haze|37 =|Charli XCX - Good Ones|36 10|Charli XCX - Von dutch|34 =|Dua Lipa - Don't Start Now|34 --- #Artist Stats ##Most Songs in Top 50 | # | Artist | Songs | |:-----------:|:------------|:------------| 1|Taylor Swift|262 2|Charli XCX|128 3|Ariana Grande|95 4|Kim Petras|93 5|Lana Del Rey|82 6|The Weeknd|77 7|Nicki Minaj|75 8|Tinashe|73 9|Carly Rae Jepsen|70 10|Beyonc|69 =|SZA|69 ##Most Songs in Top 10 | # | Artist | Songs | |:-----------:|:------------|:------------| 1|Taylor Swift|125 2|Charli XCX|92 3|Ariana Grande|66 4|Kim Petras|48 =|Lana Del Rey|48 6|Carly Rae Jepsen|41 7|Dua Lipa|40 =|The Weeknd|40 9|Billie Eilish|37 10|Lady Gaga|35 ##Most #1 Songs | # | Artist | Songs | |:-----------:|:------------|:------------| 1|Charli XCX|30 2|Taylor Swift|26 3|Ariana Grande|17 4|Dua Lipa|12 5|Carly Rae Jepsen|11 6|Billie Eilish|10 7|Lady Gaga|8 =|Olivia Rodrigo|8 =|The Weeknd|8 =|Troye Sivan|8 ##Most Songs without reaching Top 10 | # | Artist | Songs | Highest Song |:-----------:|:------------|:------------|:------------| 1|Porter Robinson|17|#11. Look at the Sky / Cheerleader 2|Hozier|15|#11. Nina Cried Power =|Maisie Peters|15|#15. Cate's Brother 4|Beach House|12|#12. Lemon Glow =|Denzel Curry|12|#17. SIRENS =|Roisin Murphy|12|#25. Simulation 7|5 Seconds of Summer|11|#12. Want You Back =|Imagine Dragons|11|#14. Bad Liar =|The Killers|11|#11. Caution 10|Amin|10|#16. Jailbreak the Tesla =|Avicii|10|#11. Levels =|Foxes|10|#17. Sister Ray =|Juice WRLD|10|#26. Fast =|Let's Eat Grandma|10|#15. Levitation ##Longest Gaps Between #1's Artist|Wks|Song 1|Charting Week|Song 2|Charting Week :--|:-:|:--|:--|:--|:-- Kendrick Lamar|353|All The Stars|Feb 27, 2018|squabble up|Dec 2, 2024 Bruno Mars|345|Finesse - Remix|Jan 15, 2018|Die With A Smile|Aug 26, 2024 Post Malone|343|Homemade Dynamite (Remix)|Sep 25, 2017|Fortnight|Apr 29, 2024 Tove Lo|256|shedontknowbutsheknows|Nov 27, 2017|Grapefruit|Oct 24, 2022 Kesha|246|Raising Hell|Nov 4, 2019|JOYRIDE|Jul 22, 2024 Nicki Minaj|244|Barbie Dreams|Aug 20, 2018|Princess Diana|Apr 24, 2023 Camila Cabello|226|Never Be the Same|Dec 18, 2017|psychofreak|Apr 18, 2022 Charlie Puth|224|How Long|Oct 16, 2017|Light Switch|Jan 31, 2022 Demi Lovato|212|Solo|May 28, 2018|SKIN OF MY TEETH|Jun 20, 2022 Lady Gaga|204|911|Sep 28, 2020|Die With A Smile|Aug 26, 2024 ##Most Consecutive Weeks In Chart \\* denotes a streak that is currently ongoing | # | Artist [Songs] | Weeks | Date Range |:-----------:|:------------|:------------|:------------| 1|Chappell Roan [Red Wine Supernova / Good Luck, Babe!]|65*|11/27/23 -| 2|Ariana Grande [Into You, sweetener / thank u, next]|58|4/24/18 - 5/27/19| 3|Charli XCX [OUT OUT / Crash / Hot Girl]|57|8/23/21 - 9/19/22| 4|Taylor Swift [Lover]|56|5/6/19 - 5/25/20| 5|Taylor Swift [Cruel Summer / folklore / evermore / Fearless TV]|53|6/8/20 - 6/7/21| 6|Taylor Swift [reputation]|51|8/28/17 - 8/13/18| 7|Taylor Swift [Midnights / Cruel Summer]|48|10/31/22 - 9/28/23| 8|Dua Lipa [Future Nostalgia]|46|11/11/19 - 9/21/20| 9|Ariana Grande [Rain On Me / positions]|45|5/18/20 - 3/22/21| 10|Olivia Rodrigo [drivers license / deja vu / good 4 u]|44|1/18/21 - 11/15/21| =|Sabrina Carpenter [Espresso / Taste]|44*|4/29/24 -|",
    "Nothing like a post-Halftime Show cope Rank|Song|Total Points|Number Ones|Total Listeners ---|---|---|---|---|--- 11659|Drake - Family Matters|2.0|0|2 [Full Chart]( [Full Chart 2]( [Full Chart 3](",
    "Well deserved win for Gaga here Abracadabra is one of the best pop songs I have heard in a very long time. Disease is also damn good and might even be better, this album is shaping up to be one of her best if not her best ever.",
    "Damn, Olly Alexander couldn't even break the top 100? Pretty sad, I thought that album was good.",
    "1. Kendrick Lamar - GNX (236k) (+3) 2. SZA - SOS (109k) (+1) 3. The Weeknd - Hurry Up Tomorrow (101k) (-2) 4. Bad Bunny - DeB TiRAR MS FOToS (78k) (-2) 5. Chappell Roan - The Rise and Fall of a Midwest Princess (59k) (+1) 6. Billie Eilish - Hit Me Hard and Soft (51k) (-1) 7. Sabrina Carpenter - Short n' Sweet (51k) (=) 8. Morgan Wallen - One Thing at a Time (41k) (=) 9. Kendrick Lamar - DAMN (39k) (+20) 10. Kendrick Lamar - good kid, m.A.A.d (37k) (+17) **With GNX, DAMN. and good kid, m.A.A.d city all in the top 10, Lamar is the first rap act with three albums in the top 10 of the Billboard 200 at the same time.**",
    "Damn this is probably the superbowl that has impacted the charts the most overall... honestly kendrick is amazing and totally deserves this. 3 albums in the top 10!!! I'm excited to see how he does on the Hot 100",
    "Ridin in my GNX wit Anita Baker in the tape deck, it's gon be a sweet love",
    "GNX is great, as well as Hurry Up Tomorrow. Genuinely enjoying a lot of recent releases",
    "It would be very hilarious if Kendrick somehow blocks Drake next week",
    "Ive had GNX on repeat since the Super Bowl dropped. I really enjoyed it when it dropped, but had moved on to more recent releasesbut now Im fully back in committed to hearing GNX daily. lol",
    "Ive been listening to GNX and a Luther Vandross best of list!(thx Kendrick)",
    "Wow! Those numbers are crazy.",
    "All I ever wanted was a black Grand National, fuck being rational, give em what they ask for!!!",
    "Love this for Kendrick and realllllly love this for all of the \"who? Rap isnt music\" people when he was announced for halftime",
    "GKMC, the album you are. I dont think theres been a week where Ive not listened to at least half the album since it was released.",
    "Its Kendricks year.",
    "Kendrick is already breaking records and its not even March yet.. Hes that guy!",
    "Kendrick is such a good run! Breaking records after records.",
    "The Drakeification of Kendrick Lamar",
    "Where is TTPD??????",
    "damn, that halftime show boosted his albums like crazy",
    "That is crazy that no one else in hip hop has ever charted three of their own albums at once in the top 10 until now",
    "I love that Kendrick didnt even perform any *good kid, m.A.A.d city* songs at the Super Bowl but enough people were like Damn, he killed it at the Super Bowl! Im gonna listen to the classics again to get it back into the top 10.",
    "What an insane week for Kendrick. That is mental to also have two of your other albums chart within the top 10 again.",
    "i distinctly remember people saying kendricks performance was a waste of the opportunity & it was embarrassing",
    "Damn Weeknd had like an 80% drop but still did over 100K. That shows that people are still consistently listening to the album because just his streaming numbers last week was 131K, I think its gonna have some staying power. Kendrick is on insane run, I wonder if literally all his albums will be on the billboard 200 this week.",
    "Also the first living male solo artist with three albums in the top 10 of the Billboard 200 at the same time! (which is a long way of saying not posthumous Prince or The Beatles)",
    "Three albums?! I wonder what the Hot 100 will look like this week, luther or tv off could be headed for #1",
    "well good for him love the top 10 albums this week w!!!",
    "Morgan wallen steady at top 10 for 2 years running",
    "I think this is indeed true. I dont remember a recent Super Bowl creating such a surge up the charts like Kendricks. Its typically one or two songs from the set that make a reappearance.",
    "Not Like Us literally went from 100mil before Superbowl to 600 million listens, 400 million short or actually being 1 billion listens. It's hilarious that a Drake diss track actually became the most listened song in Kendricks discography",
    "Thats probably because he was the only artist truly relevant while doing the halftime show. Most artists are past their prime when they do it.",
    "God I want a GNX. Damn my being in New Zealand and not having the money to import an old Buick to New Zealand.",
    "I love that true artistry is back to the forefront",
    "r/KendrickLamar is encouraging everybody to stream Sabrina, lol",
    "\"oh yeah, by the way, heres another surprise album\" -Kdot potentially ",
    "Looking pretty likely that GNX will surpass Drakes new project in daily streams either today or tomorrow. But unless Drakes album continues to see huge drops daily, it will end the week with more streams overall",
    "Drake fans are for sure mobilized and it is a great strategic move to release the album when he did. The beef benefits both teams and the industry A LOT.",
    "Out of the top 10, where it belongs",
    "236k units for a months-old release is insane. The album debuted with ~310k units, 3 months ago. Only Taylor or an artist passing could pull numbers like this.",
    "B-but I was told by certain people his halftime show flopped?.. ",
    "*GKMC* is literally from 2012! Never left the charts.",
    "I feel like those people would be saying that regardless of how he performed",
    "Yapping and yapping and yapping. His performance is at over 60M views on YouTube a week after release. Clearly even *they* have been tuning in again and again...",
    "Not Like Us is going to be #1 with Luther and TV Off at #2 and #3. But Luther is currently projected to hit #1 next week.",
    "I think its because these songs were already charting as hit songs even before the performance. So youre getting the usual Super Bowl boost, but on top of already current smash hits. So theyre going super saiyan. Its beautiful to watch. I dont care how corny it is to say, but this is such a win for true artistry, culture, and morals/values. His music is just so true to the art form of hip hop, so full of good-hearted messaging and themes (especially Mr Morale), its so inspiring to see that win commercially over the microwaved McDonalds, hedonistic, misogynistic, narcissistic, vapid, bland music that Drake has been running the charts with over the last 8 years. Whats happening in the country is so fucked right now, but the zeitgeist/pop culture choosing the introspective, good-natured, true art rapper over the incumbent narcissist, creatively bankrupt, self-obsessed rapper who pushes gambling and misogyny to kids gives me hope that things can get better again.",
    "most of the set list was off of GNX and all the stars was already getting renewed attention on streaming (kinda like with Tylers see you again out streaming most of chromakopia 8 years after it was already a hit for pretty much no reason) but its still impressive that money trees is charting and gkmc got up here when he didnt perform anything off that album",
    "Doesn't not like us have over 1 billion streams on spotify? And HUMBLE. and All the stars have over 2 billion. But yeah not like us definitely made him even bigger damn",
    "May you elaborate on this please? I'm curious as to what you mean.",
    "I mean GNX deluxe is not *impossible* ",
    "Quick Kendrick release some target exclusive vinyls",
    "All we need is for One Thing At A Time to leave the top ten and all will be right with the world.",
    "Vinyls shipped last week, so that's where most of these sales come",
    "Then they havent",
    "Its the longest charting rap album of all time",
    "That is crazy. I saw the (+17) and did a double take. Super impressive.",
    "you have a point.",
    "This is definitely the reason",
    "That's even funnier, 1 billion people just heard Kendrick's diss track against Drake, literally almost a quarter of this planet just heard the line \"Say Drake, I heard you like them young\" and \"A minor\"",
    "People putting extra effort into their projects with a hope to leave both personal and cultural impacts.",
    "Hit his turf and get crackin, double back like a deluxe ",
    "True but it says streaming brought in 117k sales meaning he would still by #1 without any physical sales, which is honestly even crazier.",
    "Aah I think they edited their comment lol, no worries",
    "They have, just not 3 of them!",
    "The longest charting hip hop album of all time? But I was told that nobody knows who this man is. /s",
    "People listened to it 1 billion times, it's not 1 billion people listening to it",
    "Ah yes. It's nice to see those with the resources and room to leave out some effort, like Kendrick, deliver projects with extra love and care for their craft. Like look at his music videos too for this era. Really cool stuff",
    "Still waiting for the trailer snippet song",
    "Fair enough, those quick edits will have you out here looking crazy haha",
    "I wasn't being sarcastic but holy shit now I can't unsee it haha",
    "Lmao I'm so sorry I read it that way. I'm so used to people on Reddit being pricks about stuff for no reason",
    "I get it. I think I talk that way because I've been reading too many classic novels",
    "If you would like this roundup sent to your reddit inbox every week [send me a message with the subject 'popheads']( Or if you want a daily roundup, [use the subject 'popheads daily']( (<--Click one of the links. The bot can't read chats, you must send a message). #####Please let me know if you have suggestions to make this roundup better for /r/popheads or if there are other subreddits that you think I should post in. I can search for posts based off keywords in the title, URL and flair - sorted by upvotes, \\# of comments, or awards. And I can also find the top comments overall or in specific threads.",
    "#this weeks top 10: 1 Messy - Lola Young (=) 2 Not Like Us - Kendrick Lamar (+25) 3 Abracadabra - Lady Gaga (+3) 4 Pink Pony Club - Chappell Roan (+10) 5 The Days - Chrystal (-1) 6 Beautiful Things - Benson Boone (+27) **7 Ordinary - Alex Warren (NEW)** 8 APT - Ros & Bruno Mars (-6) 9 Denial Is A River - Doechii (+7) 10 Luther - Kendrick Lamar & SZA (+24) #top 40 new entries: 13 Born Again - Lisa, Raye & Doja Cat #of interest: 11 All The Stars - Kendrick Lamar & SZA (RE) 12 Sports Car - Tate McRae (-3) 14 Thats So True - Gracie Abrams (-11) 17 Who - Jimin (+6) 18 Timeless - The Weeknd ft Playboi Carti (-11) 20 Cry For Me - The Weeknd (-12) 21 Guess - Charli xcx ft Billie Eilish (+10) 29 Sailor Song - Gigi Perez (-24) 30 GBP Central Cee ft 21 Savage (-15) 32 Red Wine Supernova - Chappell Roan (RE) 34 Burning Down - Alex Warren (+15) ***** You can view the full top 100 [here]( New to the UK chart? Want to know how it works? [check out my post here](",
    "How do we feel abt born again debuting at no 13-",
    "Denial is a river <3",
    "This week was really interesting to watch. You had Chappell and Gaga still running high off the grammys, looking maybe to take the top spot, then Kendrick out of nowhere threatened. None quite being able to reach Lola. Next week will possibly be even more interesting. Messy is having its moment but now it goes up against two artists who've combined for nearly a year atop the singles chart in their career in Drake and Sabrina Carpenter, the 8th and 16th most prolific artists in UK history in terms of weeks on top. Shall be a fun week.",
    "I havent been interested in following the charts in such a long time! Admittedly its cause Im a huge Gaga fan but its been a genuinely interesting week",
    "Another top 5 for chappel! And doechii has a top 10! And UK giving All the Stars its stars  love to see it",
    "How is TDE so good at getting new talent? They honestly seemed like they were kinda screwed after Kendrick left",
    "Kendrick still number one on Spotify and downloads today. I hope it goes number one in the UK I love seeing the people stuck in the 70s and 80s have a meltdown on Facebook.",
    "Go Doechii omgggg",
    "Yo Doechii is in the top 10 thats fire. Gotta be her first time right? Only a matter of time for billboard next.",
    "Mad how much the Grammys impacted the chart considering they dont even air on UK TV",
    "Im always surprised by how well Tate McRaes songs do in the UK. Her sound is just so AMERICAN to me (yes, I know shes Canadian) so its really surprising that her music is bigger in the UK than in the US!",
    "I think its a good placement, it was kinda overshadowed but still got to 13",
    "Pretty good actually",
    "I feel like it probably wont rise though, and will fall, the song hasnt really got any promo at all from RCA",
    "Is Kendrick really out of nowhere? He just performed at the Halftime Show lol",
    "Yeah it was just edging into the top 40 a few weeks ago, its had an amazing rise",
    "It all goes viral online now.",
    "I've been showing anyone who will listen her Tiny Desk. ImDoingMyPart.jpg",
    "I mean her sound is pure pop, which has always been super popular in the UK",
    "Well, by out of nowhere, i mean like, the Monday numbers didn't show much, and then he was there. I know why he's there",
    "I thought that people on here said that no one outside of America is even aware of what the Super Bowl is?",
    "omfg??? Lady Gaga, Beyonce, Madonna, Rihanna, Shakira/JLo, etc...why don't y'all do this as well??",
    "this is so smart and cool!!! hope they keep it forward for all future halftime shows/pre game performers like national anthem",
    "Need them to also release the halftime where Bruno Mars and Beyonce performed with Coldplay as the special guest",
    "Are you telling me we can now track the success of this performance via single success in addition to YouTube and broadcast views? Rack up them numbers, Kenny. Bury Drake's dead body further.",
    "Kendrick really does get special treatment from the industry cause why they never do this with other artists..",
    "Music Videos are just being rolled out.",
    "Probably a label/licensing/legal issue of some kind",
    "I mean it has to start with someone, maybe this will become a trend.",
    "Jennifer Lopez & Shakira, The Weeknd, Dr Dre Snoop Dogg Eminem & Kendrick, Rihanna as well as Usher all have this as well",
    "I disagree with OP's idea that Kendrick is getting special treatment but none of those artists have released their half-time shows as audio on Spotify",
    "Yeah my bad, I only checked Tidal",
    "Tickets on sale the same day as Beyonc they really want to see me broke.",
    "Perfect time for tickets to go on sale",
    "His superbowl performance made me a new fan. I'll be buying tickets.",
    "Can't believe they're not doing Dublin, considering that they toured here for Mr. Morale and SOS",
    "I dont have the money to go but I love the poster!",
    "I'll try and go to the concert in Cologne, I hope the tickets are not too expensive",
    "This is gonna be a great show! In terms of male rappers, I cant think of anyone who puts on a better show than Kendrick. I saw SZA during her SOS tour, and I was pleasantly surprised!",
    "Damn stadiums in the UK too, thats wild, and I wonder if either of them are planning UK/EU festival dates as its during festival season",
    "Im so broke pls not rn ",
    "Begging them to put on a Manchester OR Liverpool date, would be so much more ideal for me",
    "the US tickets went on sale in december ",
    "USA, UK, and Canada! We haven't been annexed... Yet",
    "I bought my Saint Louis tickets back in December and booked my hotel as well before they jacked up the rates.",
    "Ticket prices for Cardiff  Tickets have peen priced in advance by the tour, ranging from 75.10 to 476.00 (including fees) with a per order handling. fee of 275, Please note that this does not include VIP package prices, and tickets are subject to availability",
    "does anyone know if i need a code to join the ticketmaster presale??",
    "Why no Manchester? lol",
    "GUYS DOES ANYONE KNOW : will the concert be more of a kendrick tour with sza featuring or will sza play some of her own songs aswell? (like 50/50)",
    "So many tickets still available, I don't think that performance last night will help either",
    "Can't imagine what will happen with Ticketmaster's servers on Friday ",
    "they performing at my husbands football team stadium aswell which is a downgrade ",
    "It was so good I dont even like rap ",
    "Ikr though! they're doing my husband fave football team stadium at Aston Villa park and that's a downgrade ",
    "bought tickets yesterday through deutsche telekom. they vary between 120-400.",
    "No, OP forgot to include there are EU stadium dates too hehe",
    "Ikr my husband from Birmingham and when a singer i like tours it never in brum in rude",
    "Whole north west just getting ignored like whatttt :(",
    "That rude then ",
    "The prices are not great. I wanted to buy tickets when they announced, but the cheapest nosebleeds were still like $200.",
    "just too expensive. i love sza and kendrick but 300 level tickets in my city were starting at $150, it's a stadium tour so i will likely be checking stubhub or whatever the day or so before and might end up going but im not dropping that much on it.",
    "No chance, both have headlined too recently.",
    "how is that a downgrade",
    "As our resident mod, Villa fan, and general everything, this combined with the Sabbath show is just surreal to see this past week",
    "I have just seen an advertisement for their concert in Barcelona at the Olympic Stadium.",
    "Cause I hate football and he forced me to go and I went for his brothers so I mock him saying asston villa shit I also do it to my uncle who also supports villa",
    "Ikr my husband is going to that with his dad and uncle and me and if u see a shirtless black hair yelly man in the doug Ellis stand that's my husband ",
    "Ahhh British love blooms so strong",
    "he steals my alcohol and food so that love half way "
]